Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: By default :manual:`ctest(1)` does not print the output from the tests. The command line argument ``-V`` (or ``--verbose``) enables verbose mode to print the output from all tests. The ``--output-on-failure`` option prints the test output for failing tests only. The environment variable :envvar:`CTEST_OUTPUT_ON_FAILURE` can be set to ``1`` as an alternative to passing the ``--output-on-failure`` option to :manual:`ctest(1)`.
it: Per default :manual:`ctest(1)` non stampa l'output dei test. L'argomento della riga di comando ``-V`` (o ``--verbose``) abilita la modalità "verbose" per stampare l'output di tutti i test. L'opzione ``--output-on-failure`` stampa l'output del test solo per quelli falliti. La variabile d'ambiente :envvar:`CTEST_OUTPUT_ON_FAILURE` può essere impostata su ``1`` come alternativa al passaggio dell'opzione ``--output-on-failure`` a :manual:`ctest(1)`.

source: Using Dependencies Guide
it: Guida all'Uso delle Dipendenze

source: For developers wishing to use CMake to consume a third party binary package, there are multiple possibilities regarding how to optimally do so, depending on how CMake-aware the third-party library is.
it: Per gli sviluppatori che desiderano utilizzare CMake per usare un pacchetto binario di terze parti, esistono molteplici possibilità su come farlo in modo ottimale, a seconda di quanto sia compatibile con CMake la libreria di terze parti.

source: CMake files provided with a software package contain instructions for finding each build dependency. Some build dependencies are optional in that the build may succeed with a different feature set if the dependency is missing, and some dependencies are required. CMake searches well-known locations for each dependency, and the provided software may supply additional hints or locations to CMake to find each dependency.
it: I file CMake forniti con un pacchetto software contengono istruzioni per trovare ciascuna dipendenza della build. Alcune dipendenze di build sono facoltative in quanto questa potrebbe avere esito positivo con un set di funzionalità diverso se la dipendenza è mancante e alcune dipendenze sono obbligatorie. CMake cerca posizioni note per ciascuna dipendenza e il software può fornire ulteriori suggerimenti o posizioni a CMake per trovare ciascuna dipendenza.

source: If a required dependency is not found by :manual:`cmake(1)`, the cache is populated with an entry which contains a ``NOTFOUND`` value. This value can be replaced by specifying it on the command line, or in the :manual:`ccmake(1)` or :manual:`cmake-gui(1)` tool. See the :guide:`User Interaction Guide` for more about setting cache entries.
it: Se una dipendenza richiesta non viene trovata da :manual:`cmake(1)`, la cache viene popolata con una voce che contiene un valore ``NOTFOUND``. Questo valore può essere sostituito specificandolo sulla riga di comando o nello strumento :manual:`ccmake(1)` oi in :manual:`cmake-gui(1)`. Consultare la guida :guide:`User Interaction Guide` per ulteriori informazioni sull'impostazione delle voci della cache.

source: Libraries providing Config-file packages
it: Librerie che Forniscono Pacchetti di file di configurazione

source: The most convenient way for a third-party to provide library binaries for use with CMake is to provide :ref:`Config File Packages`. These packages are text files shipped with the library which instruct CMake how to use the library binaries and associated headers, helper tools and CMake macros provided by the library.
it: Il modo più conveniente per una terza parte di fornire file binari di libreria da utilizzare con CMake è fornire :ref:`Config File Packages`. Questi pacchetti sono file di testo forniti con la libreria che istruiscono CMake su come utilizzare i file binari della libreria e gli header associati, gli strumenti di supporto e le macro CMake fornite dalla libreria.

source: The config files can usually be found in a directory whose name matches the pattern ``lib/cmake/<PackageName>``, though they may be in other locations instead. The ``<PackageName>`` corresponds to use in CMake code with the :command:`find_package` command such as ``find_package(PackageName REQUIRED)``.
it: I file di configurazione di solito si trovano in una directory il cui nome corrisponde al pattern ``lib/cmake/<PackageName>``, anche se potrebbero trovarsi invece in altre posizioni. Il ``<PackageName>`` corrisponde all'uso nel codice CMake con il comando :command:`find_package` come ``find_package(PackageName REQUIRED)``.

source: The ``lib/cmake/<PackageName>`` directory will contain a file which is either named ``<PackageName>Config.cmake`` or ``<PackageName>-config.cmake``. This is the entry point to the package for CMake. A separate optional file named ``<PackageName>ConfigVersion.cmake`` may also exist in the directory. This file is used by CMake to determine whether the version of the third party package satisfies uses of the :command:`find_package` command which specify version constraints. It is optional to specify a version when using :command:`find_package`, even if a ``ConfigVersion`` file is present.
it: La directory ``lib/cmake/<PackageName>`` conterrà un file denominato ``<PackageName>Config.cmake`` o ``<PackageName>-config.cmake``. Questo è il punto di ingresso al pacchetto per CMake. Nella directory potrebbe anche esistere un file facoltativo separato denominato ``<PackageName>ConfigVersion.cmake``. Questo file viene utilizzato da CMake per determinare se la versione del pacchetto di terze parti soddisfa gli usi del comando :command:`find_package` che specifica i vincoli di versione. È facoltativo specificare una versione quando si usa :command:`find_package`, anche se è presente un file ``ConfigVersion``.

source: If the ``Config.cmake`` file is found and the optionally-specified version is satisfied, then the CMake :command:`find_package` command considers the package to be found and the entire library package is assumed to be complete as designed.
it: Se il file ``Config.cmake`` viene trovato e la versione specificata facoltativamente è soddisfatta, allora il comando CMake :command:`find_package` considera il pacchetto da trovare e si presuppone che l'intero pacchetto della libreria sia completo come progettato.

source: There may be additional files providing CMake macros or :ref:`imported targets` for you to use. CMake does not enforce any naming convention for these files. They are related to the primary ``Config`` file by use of the CMake :command:`include` command.
it: Potrebbero esserci file aggiuntivi che forniscono macro CMake o :ref:`imported targets` da utilizzare. CMake non applica alcuna convenzione sui nomi per questi file. Sono correlati al file ``Config`` primario tramite l'uso del comando CMake :command:`include`.

source: :guide:`Invoking CMake <User Interaction Guide>` with the intent of using a package of third party binaries requires that cmake :command:`find_package` commands succeed in finding the package. If the location of the package is in a directory known to CMake, the :command:`find_package` call should succeed. The directories known to cmake are platform-specific. For example, packages installed on Linux with a standard system package manager will be found in the ``/usr`` prefix automatically. Packages installed in ``Program Files`` on Windows will similarly be found automatically.
it: :guide:`Invocare CMake <User Interaction Guide>` con l'intento di utilizzare un pacchetto di file binari di terze parti richiede che i comandi cmake :command:`find_package` riescano a trovare il pacchetto. Se la posizione del pacchetto è in una directory nota a CMake, la chiamata :command:`find_package` dovrebbe riuscire. Le directory note a cmake sono specifiche della piattaforma. Ad esempio, i pacchetti installati su Linux con un gestore di pacchetti di sistema standard verranno trovati automaticamente nel prefisso ``/usr``. Allo stesso modo, i pacchetti installati in ``Program Files`` su Windows verranno trovati automaticamente.

source: Packages which are not found automatically are in locations not predictable to CMake such as ``/opt/mylib`` or ``$HOME/dev/prefix``. This is a normal situation and CMake provides several ways for users to specify where to find such libraries.
it: I pacchetti che non vengono trovati automaticamente si trovano in posizioni non prevedibili da CMake come ``/opt/mylib`` o ``$HOME/dev/prefix``. Questa è una situazione normale e CMake fornisce agli utenti diversi modi per specificare dove trovare tali librerie.

source: The :variable:`CMAKE_PREFIX_PATH` variable may be :ref:`set when invoking CMake <Setting Build Variables>`. It is treated as a list of paths to search for :ref:`Config File Packages`. A package installed in ``/opt/somepackage`` will typically install config files such as ``/opt/somepackage/lib/cmake/somePackage/SomePackageConfig.cmake``. In that case, ``/opt/somepackage`` should be added to :variable:`CMAKE_PREFIX_PATH`.
it: La variabile :variable:`CMAKE_PREFIX_PATH` può essere :ref:`impostata quando si invoca CMake <Setting Build Variables>`. Viene trattato come un elenco di percorsi in cui cercare :ref:`Config File Packages`. Un pacchetto installato in ``/opt/somepackage`` tipicamente installerà file di configurazione come ``/opt/somepackage/lib/cmake/somePackage/SomePackageConfig.cmake``. In tal caso, ``/opt/somepackage`` dovrebbe essere aggiunto a :variable:`CMAKE_PREFIX_PATH`.

source: The environment variable ``CMAKE_PREFIX_PATH`` may also be populated with prefixes to search for packages. Like the ``PATH`` environment variable, this is a list and needs to use the platform-specific environment variable list item separator (``:`` on Unix and ``;`` on Windows).
it: La variabile d'ambiente ``CMAKE_PREFIX_PATH`` può anche essere popolata con prefissi per cercare pacchetti. Come la variabile di ambiente ``PATH``, questo è un elenco e deve utilizzare il separatore di voci dell'elenco di variabili di ambiente specifico della piattaforma (``:`` su Unix e ``;`` su Windows).

source: The :variable:`CMAKE_PREFIX_PATH` variable provides convenience in cases where multiple prefixes need to be specified, or when multiple different package binaries are available in the same prefix. Paths to packages may also be specified by setting variables matching ``<PackageName>_DIR``, such as ``SomePackage_DIR``. Note that this is not a prefix but should be a full path to a directory containing a config-style package file, such as ``/opt/somepackage/lib/cmake/SomePackage/`` in the above example.
it: La variabile :variable:`CMAKE_PREFIX_PATH` risulta comoda nei casi in cui è necessario specificare più prefissi o quando sono disponibili più file binari di pacchetti diversi nello stesso prefisso. I percorsi dei pacchetti possono anche essere specificati impostando variabili corrispondenti a ``<PackageName>_DIR``, come ``SomePackage_DIR``. Notare che questo non è un prefisso ma dovrebbe essere un percorso completo a una directory contenente un file di pacchetto in stile configurazione, come ``/opt/somepackage/lib/cmake/SomePackage/`` nell'esempio precedente.

source: Imported Targets from Packages
it: Target Importati dai Pacchetti

source: A third-party package which provides config-file packages may also provide :ref:`Imported targets`. These will be specified in files containing configuration-specific file paths relevant to the package, such as debug and release versions of libraries.
it: Un pacchetto di terze parti che fornisce pacchetti di file di configurazione può anche fornire :ref:`Imported targets`. Questi verranno specificati in file contenenti percorsi di file specifici della configurazione rilevanti per il pacchetto, come versioni di debug e di rilascio delle librerie.

source: Often the third-party package documentation will point out the names of imported targets available after a successful ``find_package`` for a library. Those imported target names can be used with the :command:`target_link_libraries` command.
it: Spesso la documentazione dei pacchetti di terze parti indicherà i nomi dei target importati disponibili dopo un riuscito ``find_package`` per una libreria. I nomi dei target importati possono essere utilizzati col comando :command:`target_link_libraries`.

source: A complete example which makes a simple use of a third party library might look like:
it: Un esempio completo che fa un semplice utilizzo di una libreria di terze parti potrebbe essere simile a:

source: See :manual:`cmake-buildsystem(7)` for further information about developing a CMake buildsystem.
it: Consultare :manual:`cmake-buildsystem(7)` per ulteriori informazioni sullo sviluppo di un sistema di build CMake.

source: Libraries not Providing Config-file Packages
it: Librerie Senza Pacchetti di File di Configurazione

source: Third-party libraries which do not provide config-file packages can still be found with the :command:`find_package` command, if a ``FindSomePackage.cmake`` file is available.
it: Le librerie di terze parti che non forniscono pacchetti di file di configurazione possono comunque essere trovate col comando :command:`find_package`, se è disponibile un file ``FindSomePackage.cmake``.

source: These module-file packages are different to config-file packages in that:
it: Questi pacchetti di file-modulo sono diversi dai pacchetti di config-file in quanto:

source: They should not be provided by the third party, except perhaps in the form of documentation
it: Non dovrebbero essere forniti da terzi, tranne forse sotto forma di documentazione

source: The availability of a ``Find<PackageName>.cmake`` file does not indicate the availability of the binaries themselves.
it: La disponibilità di un file ``Find<PackageName>.cmake`` non indica la disponibilità dei binari stessi.

source: CMake does not search the :variable:`CMAKE_PREFIX_PATH` for ``Find<PackageName>.cmake`` files. Instead CMake searches for such files in the :variable:`CMAKE_MODULE_PATH` variable. It is common for users to set the :variable:`CMAKE_MODULE_PATH` when running CMake, and it is common for CMake projects to append to :variable:`CMAKE_MODULE_PATH` to allow use of local module-file packages.
it: CMake non cerca in :variable:`CMAKE_PREFIX_PATH` i file ``Find<PackageName>.cmake``. Invece CMake cerca tali file nella variabile :variable:`CMAKE_MODULE_PATH`. È normale che gli utenti impostino :variable:`CMAKE_MODULE_PATH` durante l'esecuzione di CMake ed è comune che i progetti CMake aggiungano a :variable:`CMAKE_MODULE_PATH` per consentire l'uso di pacchetti di file di moduli locali.

source: CMake ships ``Find<PackageName>.cmake`` files for some :manual:`third party packages <cmake-modules(7)>` for convenience in cases where the third party does not provide config-file packages directly. These files are a maintenance burden for CMake, so new Find modules are generally not added to CMake anymore. Third-parties should provide config file packages instead of relying on a Find module to be provided by CMake.
it: CMake fornisce i file ``Find<PackageName>.cmake`` per alcuni :manual:`pacchetti di terze parti <cmake-modules(7)>` per comodità nei casi in cui la terza parte non fornisce direttamente i pacchetti di file di configurazione. Questi file rappresentano un onere di manutenzione per CMake, quindi i nuovi moduli "Find" generalmente non vengono più aggiunti a CMake. Le terze parti dovrebbero fornire pacchetti di file di configurazione invece di fare affidamento su un modulo "Find" fornito da CMake.

source: Module-file packages may also provide :ref:`Imported targets`. A complete example which finds such a package might look like:
it: I pacchetti di file modulo possono anche fornire :ref:`Imported targets`. Un esempio completo che trova un pacchetto di questo tipo potrebbe essere simile a:

source: The :variable:`<PackageName>_ROOT` variable is also searched as a prefix for :command:`find_package` calls using module-file packages such as ``FindSomePackage``.
it: La variabile :variable:`<PackageName>_ROOT` viene cercata anche come prefisso per le chiamate :command:`find_package` utilizzando pacchetti di file modulo come ``FindSomePackage``.
