Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: Well-behaved CMake-based buildsystems do not create any output in the source directory, so typically, the user performs an out-of-source build and performs the build there. First, CMake must be instructed to generate a suitable buildsystem, then the user invokes a build tool to process that generated buildsystem. The generated buildsystem is specific to the machine used to generate it and is not redistributable. Each consumer of a provided source software package is required to use CMake to generate a buildsystem specific to their system.
it: I sistemi di build basati su CMake ben funzionanti non creano alcun output nella directory sorgente, quindi in genere l'utente esegue una compilazione fuori sorgente ed esegue la compilazione lì. Innanzitutto, è necessario istruire CMake affinché generari un sistema di build adatto, poi l'utente richiama un tool di build per elaborare il sistema generato. Il buildsystem generato è specifico per la macchina utilizzata per generarlo e non è ridistribuibile. Ogni "consumer" di un pacchetto software con sorgente è tenuto a utilizzare CMake per generare un sistema di build specifico per il proprio sistema.

source: Generated buildsystems should generally be treated as read-only. The CMake files as a primary artifact should completely specify the buildsystem and there should be no reason to populate properties manually in an IDE for example after generating the buildsystem. CMake will periodically rewrite the generated buildsystem, so modifications by users will be overwritten.
it: I sistemi di build generati dovrebbero generalmente essere trattati come di sola lettura. I file CMake come artefatto primario dovrebbero specificare completamente il sistema di build e non dovrebbero esserci motivi per popolare manualmente le proprietà in un IDE, ad esempio dopo aver generato il sistema di build. CMake riscriverà periodicamente il sistema di build generato, quindi le modifiche apportate dagli utenti verranno sovrascritte.

source: The features and user interfaces described in this manual are available for all CMake-based build systems by virtue of providing CMake files.
it: Le funzionalità e le interfacce utente descritte in questo manuale sono disponibili per tutti i sistemi di build basati su CMake grazie ai file CMake.

source: The CMake tooling may report errors to the user when processing provided CMake files, such as reporting that the compiler is not supported, or the compiler does not support a required compile option, or a dependency can not be found. These errors must be resolved by the user by choosing a different compiler, :guide:`installing dependencies <Using Dependencies Guide>`, or instructing CMake where to find them, etc.
it: Gli strumenti CMake potrebbero segnalare errori all'utente durante l'elaborazione dei file CMake forniti, ad esempio segnalare che il compilatore non è supportato o che il compilatore non supporta un'opzione di compilazione richiesta oppure che non è possibile trovare una dipendenza. Questi errori devono essere risolti dall'utente scegliendo un compilatore diverso, :guide:`installing dependencies <Using Dependencies Guide>`, o indicando a CMake dove trovarli, ecc.

source: Command Line cmake tool
it: Strumento cmake da Riga di Comando

source: A simple but typical use of :manual:`cmake(1)` with a fresh copy of software source code is to create a build directory and invoke cmake there:
it: Un uso semplice ma tipico di :manual:`cmake(1)` con una nuova copia del codice sorgente del software è quello di creare una directory di build e invocarvi cmake:

source: It is recommended to build in a separate directory to the source because that keeps the source directory pristine, allows for building a single source with multiple toolchains, and allows easy clearing of build artifacts by simply deleting the build directory.
it: Si consiglia di creare una directory separata rispetto al sorgente perché ciò mantiene la directory dei sorgenti incontaminata, consente di creare una singola sorgente con più toolchain e consente una facile cancellazione degli artefatti di build semplicemente eliminando la directory di build.

source: The CMake tooling may report warnings which are intended for the provider of the software, not intended for the consumer of the software. Such warnings end with "This warning is for project developers". Users may disable such warnings by passing the ``-Wno-dev`` flag to :manual:`cmake(1)`.
it: Gli strumenti CMake possono segnalare warning destinati al fornitore del software, non all'utente del software. Tali warning terminano con "This warning is for project developers". Gli utenti possono disabilitare tali avvisi passando il flag ``-Wno-dev`` a :manual:`cmake(1)`.

source: cmake-gui tool
it: Il tool cmake-gui

source: Users more accustomed to GUI interfaces may use the :manual:`cmake-gui(1)` tool to invoke CMake and generate a buildsystem.
it: Gli utenti più abituati alle interfacce GUI possono utilizzare :manual:`cmake-gui(1)` per invocare CMake e generare un sistema di build.

source: The source and binary directories must first be populated. It is always advised to use different directories for the source and the build.
it: Le directory sorgente e binaria devono prima essere popolate. Si consiglia sempre di utilizzare directory diverse per il sorgente e la build.

source: Choosing source and binary directories
it: Scelta delle directory per i sorgenti e i binari

source: Generating a Buildsystem
it: Generazione di un Buildsystem

source: There are several user interface tools which may be used to generate a buildsystem from CMake files. The :manual:`ccmake(1)` and :manual:`cmake-gui(1)` tools guide the user through setting the various necessary options. The :manual:`cmake(1)` tool can be invoked to specify options on the command line. This manual describes options which may be set using any of the user interface tools, though the mode of setting an option is different for each tool.
it: Esistono diversi strumenti dell'interfaccia utente utilizzabili per generare un sistema di build dai file CMake. Gli strumenti :manual:`ccmake(1)` e :manual:`cmake-gui(1)` guidano l'utente attraverso l'impostazione delle varie opzioni necessarie. Il tool :manual:`cmake(1)` può essere richiamato per specificare le opzioni sulla riga di comando. Questo manuale descrive le opzioni che possono essere impostate utilizzando uno qualsiasi degli strumenti dell'interfaccia utente, sebbene la modalità di impostazione di un'opzione sia diversa per ciascuno.

source: Command line environment
it: Ambiente della riga di comando

source: When invoking :manual:`cmake(1)` with a command line buildsystem such as ``Makefiles`` or ``Ninja``, it is necessary to use the correct build environment to ensure that build tools are available. CMake must be able to find the appropriate :variable:`build tool <CMAKE_MAKE_PROGRAM>`, compiler, linker and other tools as needed.
it: Quando si invoca :manual:`cmake(1)` con un buildsystem a riga di comando come ``Makefiles`` o ``Ninja``, è necessario utilizzare l'ambiente di build corretto per garantire che gli strumenti siano disponibili. CMake deve essere in grado di trovare il :variable:`tool di build <CMAKE_MAKE_PROGRAM>` il compilatore, il linker e altri strumenti appropriati secondo necessità.

source: On Linux systems, the appropriate tools are often provided in system-wide locations and may be readily installed through the system package manager. Other toolchains provided by the user or installed in non-default locations can also be used.
it: Sui sistemi Linux, gli strumenti appropriati vengono spesso forniti in posizioni a livello di sistema e possono essere facilmente installati tramite il gestore pacchetti di sistema. È possibile utilizzare anche altre toolchain fornite dall'utente o installate in posizioni non predefinite.

source: When cross-compiling, some platforms may require environment variables to be set or may provide scripts to set the environment.
it: Durante la cross-compilazione, alcune piattaforme potrebbero richiedere l'impostazione di variabili di ambiente o fornire script per impostare l'ambiente.

source: Visual Studio ships multiple command prompts and ``vcvarsall.bat`` scripts for setting up the correct environments for command line buildsystems. While not strictly necessary to use a corresponding command line environment when using a Visual Studio generator, doing so has no disadvantages.
it: Visual Studio fornisce più prompt dei comandi e script ``vcvarsall.bat`` per impostare gli ambienti corretti per i buildsystem a riga di comando. Sebbene non sia strettamente necessario utilizzare un ambiente a riga di comando corrispondente quando si utilizza un generatore come Visual Studio, farlo non presenta svantaggi.

source: When using Xcode, there can be more than one Xcode version installed. Which one to use can be selected in a number of different ways, but the most common methods are:
it: Quando si utilizza Xcode, è possibile che sia installata più di una versione di Xcode. Quale utilizzare può essere selezionato in diversi modi, ma i metodi più comuni sono:

source: Setting the default version in the preferences of the Xcode IDE.
it: Impostazione della versione di default nelle preferenze dell'IDE Xcode.

source: Setting the default version via the ``xcode-select`` command line tool.
it: Impostazione della versione di default tramite lo strumento a riga di comando ``xcode-select``.

source: Overriding the default version by setting the ``DEVELOPER_DIR`` environment variable when running CMake and the build tool.
it: Sostituire la versione di default impostando la variabile di ambiente ``DEVELOPER_DIR`` durante l'esecuzione di CMake e dello strumento di build.

source: For convenience, :manual:`cmake-gui(1)` provides an environment variable editor.
it: Per comodità, :manual:`cmake-gui(1)` fornisce un editor di variabili d'ambiente.

source: Command line ``-G`` option
it: L'opzione ``-G`` della riga di comando

source: CMake chooses a generator by default based on the platform. Usually, the default generator is sufficient to allow the user to proceed to build the software.
it: CMake sceglie un generatore per default in base alla piattaforma. Di solito, il generatore di default è sufficiente per consentire all'utente di procedere alla build del software.

source: The user may override the default generator with the ``-G`` option:
it: L'utente può sovrascrivere il generatore di default con l'opzione ``-G``:

source: The output of ``cmake --help`` includes a list of :manual:`generators <cmake-generators(7)>` available for the user to choose from. Note that generator names are case sensitive.
it: L'output di ``cmake --help`` include un elenco dei :manual:`generatori <cmake-generators(7)>` tra cui l'utente può scegliere. Notare che i nomi dei generatori fanno distinzione tra maiuscole e minuscole.

source: On Unix-like systems (including Mac OS X), the :generator:`Unix Makefiles` generator is used by default. A variant of that generator can also be used on Windows in various environments, such as the :generator:`NMake Makefiles` and :generator:`MinGW Makefiles` generator. These generators generate a ``Makefile`` variant which can be executed with ``make``, ``gmake``, ``nmake`` or similar tools. See the individual generator documentation for more information on targeted environments and tools.
it: Sui sistemi simili a Unix (incluso Mac OS X), il generatore :generator:`Unix Makefiles` viene utilizzato per default. Una variante di quel generatore può essere utilizzata anche su Windows in vari ambienti, come il generatore :generator:`NMake Makefiles` e :generator:`MinGW Makefiles`. Questi generatori producono una variante di ``Makefile`` eseguibile con ``make``, ``gmake``, ``nmake`` o strumenti simili. Consulta la documentazione del singolo generatore per ulteriori informazioni sugli ambienti e sugli strumenti specifici.

source: The :generator:`Ninja` generator is available on all major platforms. ``ninja`` is a build tool similar in use-cases to ``make``, but with a focus on performance and efficiency.
it: Il generatore :generator:`Ninja` è disponibile su tutte le principali piattaforme. ``ninja`` è uno strumento di build simile nei casi d'uso a ``make``, ma con un focus su prestazioni ed efficienza.

source: On Windows, :manual:`cmake(1)` can be used to generate solutions for the Visual Studio IDE. Visual Studio versions may be specified by the product name of the IDE, which includes a four-digit year. Aliases are provided for other means by which Visual Studio versions are sometimes referred to, such as two digits which correspond to the product version of the VisualC++ compiler, or a combination of the two:
it: Su Windows, è possibile utilizzare :manual:`cmake(1)` per generare soluzioni per l'IDE di Visual Studio. Le versioni di Visual Studio possono essere specificate dal nome del prodotto dell'IDE, che include un anno a quattro cifre. Vengono forniti alias per altri significati con cui a volte si fa riferimento alle versioni di Visual Studio, ad esempio due cifre che corrispondono alla versione del prodotto del compilatore VisualC++ o una combinazione dei due:

source: Visual Studio generators can target different architectures. One can specify the target architecture using the `-A` option:
it: I generatori di Visual Studio possono avere come target architetture diverse. È possibile specificare l'architettura del target utilizzando l'opzione `-A`:

source: On Apple, the :generator:`Xcode` generator may be used to generate project files for the Xcode IDE.
it: Su Apple, il generatore :generator:`Xcode` può essere utilizzato per generare file di progetto per l'IDE Xcode.

source: Some IDEs such as KDevelop4, QtCreator and CLion have native support for CMake-based buildsystems. Those IDEs provide user interface for selecting an underlying generator to use, typically a choice between a ``Makefile`` or a ``Ninja`` based generator.
it: Alcuni IDE come KDevelop4, QtCreator e CLion hanno il supporto nativo per i sistemi di build basati su CMake. Questi IDE forniscono un'interfaccia utente per selezionare un generatore da utilizzare, tipicamente una scelta tra un generatore basato su ``Makefile`` o su ``Ninja``.

source: Note that it is not possible to change the generator with ``-G`` after the first invocation of CMake. To change the generator, the build directory must be deleted and the build must be started from scratch.
it: Notare che non è possibile modificare il generatore con ``-G`` dopo la prima invocazione di CMake. Per modificare il generatore è necessario eliminare la directory di build e avviare la build da zero.

source: When generating Visual Studio project and solutions files several other options are available to use when initially running :manual:`cmake(1)`.
it: Quando si generano file di progetto e soluzioni di Visual Studio, sono disponibili diverse altre opzioni da utilizzare durante la prima esecuzione di :manual:`cmake(1)`.

source: The Visual Studio toolset can be specified with the ``-T`` option:
it: Il set di tool di Visual Studio può essere specificato con l'opzione ``-T``:

source: Whereas the ``-A`` option specifies the _target_ architecture, the ``-T`` option can be used to specify details of the toolchain used. For example, `-Thost=x64` can be given to select the 64-bit version of the host tools. The following demonstrates how to use 64-bit tools and also build for a 64-bit target architecture:
it: Mentre l'opzione ``-A`` specifica l'architettura _target_, l'opzione ``-T`` può essere utilizzata per specificare i dettagli della toolchain utilizzata. Ad esempio, è possibile fornire `-Thost=x64` per selezionare la versione a 64 bit degli strumenti host. Di seguito viene illustrato come utilizzare i tool a 64 bit ed eseguire una build per un'architettura target a 64 bit:

source: Choosing a generator in cmake-gui
it: Scelta di un generatore in cmake-gui

source: The "Configure" button triggers a new dialog to select the CMake generator to use.
it: Il pulsante "Configure" attiva una nuova finestra di dialogo per selezionare il generatore CMake da utilizzare.

source: Configuring a generator
it: Configurare un generatore

source: All generators available on the command line are also available in :manual:`cmake-gui(1)`.
it: Tutti i generatori disponibili sulla riga di comando sono disponibili anche in :manual:`cmake-gui(1)`.

source: Choosing a generator
it: Scegliere un generatore

source: When choosing a Visual Studio generator, further options are available to set an architecture to generate for.
it: Quando si sceglie un generatore di Visual Studio, sono disponibili ulteriori opzioni per impostare un'architettura per la quale generare.

source: Choosing an architecture for Visual Studio generators
it: Scegliere un'architettura per i generatori di Visual Studio

source: Setting Build Variables
it: Impostazione delle Variabili di Build

source: Software projects often require variables to be set on the command line when invoking CMake. Some of the most commonly used CMake variables are listed in the table below:
it: I progetti software spesso richiedono l'impostazione di variabili sulla riga di comando quando si richiama CMake. Alcune delle variabili CMake più comunemente utilizzate sono elencate nella tabella seguente:

source: Variable
it: Variabile

source: Meaning
it: Significato

source: Path to search for :guide:`dependent packages <Using Dependencies Guide>`
it: Percorso per cercare :guide:`pacchetti dipendenti <Using Dependencies Guide>`

source: Path to search for additional CMake modules
it: Percorso per cercare moduli CMake aggiuntivi

source: Build configuration, such as ``Debug`` or ``Release``, determining debug/optimization flags. This is only relevant for single-configuration buildsystems such as ``Makefile`` and ``Ninja``. Multi-configuration buildsystems such as those for Visual Studio and Xcode ignore this setting.
it: Configurazione di build, come ``Debug`` o ``Release``, determinando i flag di debug/ottimizzazione. Ciò è rilevante solo per sistemi di compilazione a configurazione singola come ``Makefile`` e ``Ninja``. I sistemi di build multiconfigurazione come quelli per Visual Studio e Xcode ignorano questa impostazione.

source: Location to install the software to with the ``install`` build target
it: Locazione in cui installare il software col target della build ``install``

source: File containing cross-compiling data such as :manual:`toolchains and sysroots <cmake-toolchains(7)>`.
it: File contenente dati di cross-compilazione come :manual:`toolchains e sysroots <cmake-toolchains(7)>`.

source: Whether to build shared instead of static libraries for :command:`add_library` commands used without a type
it: Se creare librerie shared anziché statiche per i comandi :command:`add_library` utilizzati senza un tipo

source: Generate a ``compile_commands.json`` file for use with clang-based tools
it: Genera un file ``compile_commands.json`` da utilizzare con strumenti basati su clang

source: Other project-specific variables may be available to control builds, such as enabling or disabling components of the project.
it: Potrebbero essere disponibili altre variabili specifiche del progetto per controllare le build, come l'abilitazione o la disabilitazione dei componenti del progetto.

source: There is no convention provided by CMake for how such variables are named between different provided buildsystems, except that variables with the prefix ``CMAKE_`` usually refer to options provided by CMake itself and should not be used in third-party options, which should use their own prefix instead. The :manual:`cmake-gui(1)` tool can display options in groups defined by their prefix, so it makes sense for third parties to ensure that they use a self-consistent prefix.
it: Non esiste alcuna convenzione fornita da CMake su come tali variabili vengono denominate tra i diversi sistemi di build forniti, tranne che le variabili con il prefisso ``CMAKE_`` di solito si riferiscono alle opzioni fornite da CMake stesso e non dovrebbero essere utilizzate in opzioni di terze parti, che dovrebbero utilizzare invece il proprio prefisso. Il tool :manual:`cmake-gui(1)` può visualizzare le opzioni in gruppi definiti dal loro prefisso, quindi è logico che terze parti si assicurino di utilizzare un prefisso auto-coerente.

source: Setting variables on the command line
it: Impostazione delle variabili sulla riga di comando

source: CMake variables can be set on the command line either when creating the initial build:
it: Le variabili CMake possono essere impostate sulla riga di comando durante la creazione della build iniziale:

source: or later on a subsequent invocation of :manual:`cmake(1)`:
it: o successivamente in una ulteriore invocazione di :manual:`cmake(1)`:

source: The ``-U`` flag may be used to unset variables on the :manual:`cmake(1)` command line:
it: Il flag ``-U`` può essere utilizzato per annullare l'impostazione delle variabili sulla riga di comando di :manual:`cmake(1)`:

source: A CMake buildsystem which was initially created on the command line can be modified using the :manual:`cmake-gui(1)` and vice-versa.
it: Un buildsystem CMake inizialmente creato sulla riga di comando può essere modificato utilizzando :manual:`cmake-gui(1)` e viceversa.

source: The :manual:`cmake(1)` tool allows specifying a file to use to populate the initial cache using the ``-C`` option. This can be useful to simplify commands and scripts which repeatedly require the same cache entries.
it: Il tool :manual:`cmake(1)` consente di specificare un file da utilizzare per popolare la cache iniziale utilizzando l'opzione ``-C``. Ciò può essere utile per semplificare comandi e script che richiedono ripetutamente le stesse voci della cache.

source: Setting variables with cmake-gui
it: Impostazione delle variabili con cmake-gui

source: Variables may be set in the cmake-gui using the "Add Entry" button. This triggers a new dialog to set the value of the variable.
it: Le variabili possono essere impostate in cmake-gui utilizzando il pulsante "Add Entry". Ciò attiva una nuova finestra di dialogo per impostare il valore della variabile.

source: Editing a cache entry
it: Modifica di una voce della cache

source: The main view of the :manual:`cmake-gui(1)` user interface can be used to edit existing variables.
it: La vista principale dell'interfaccia utente di :manual:`cmake-gui(1)` può essere utilizzata per modificare le variabili esistenti.

source: The CMake Cache
it: La Cache di CMake

source: When CMake is executed, it needs to find the locations of compilers, tools and dependencies. It also needs to be able to consistently re-generate a buildsystem to use the same compile/link flags and paths to dependencies. Such parameters are also required to be configurable by the user because they are paths and options specific to the users system.
it: Quando CMake viene eseguito, è necessario trovare le posizioni di compilatori, tool e dipendenze. Deve anche essere in grado di rigenerare in modo coerente un sistema di build per utilizzare gli stessi flag di compilazione/link e percorsi per le dipendenze. Tali parametri devono inoltre essere configurabili dall'utente perché sono percorsi e opzioni specifici del sistema dell'utente.
