Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: IDE Integration Guide
it: Guida all'integrazione dell'IDE

source: Contents
it: Contenuti

source: Introduction
it: Introduzione

source: Integrated development environments (IDEs) may want to integrate with CMake to improve the development experience for CMake users. This document lays out the recommended best practices for such integration.
it: Gli ambienti di sviluppo integrati (IDE) potrebbero volersi integrare con CMake per migliorare l'esperienza di sviluppo per gli utenti di CMake. Questo documento illustra le "best practices" consigliate per tale integrazione.

source: Bundling
it: Bundling (Raggruppamento)

source: Many IDE vendors will want to bundle a copy of CMake with their IDE. IDEs that bundle CMake should present the user with the option of using an external CMake installation instead of the bundled one, in case the bundled copy becomes outdated and the user wants to use a newer version.
it: Molti fornitori di IDE vorranno eseguire il bundle di una copia di CMake con il proprio IDE. Gli IDE che raggruppano CMake dovrebbero offrire all'utente la possibilità di utilizzare un'installazione CMake esterna anziché quella in bundle, nel caso in cui tale copia diventi obsoleta e l'utente desideri utilizzare una versione più recente.

source: While IDE vendors may be tempted to bundle different versions of CMake with their application, such practice is not recommended. CMake has strong guarantees of backwards compatibility, and there is no reason not to use a newer version of CMake than what a project requires, or indeed, the very latest version. Therefore, it is recommended that IDE vendors that bundle CMake with their application always include the very latest patch version of CMake available at the time of release.
it: Sebbene i fornitori IDE possano essere tentati di raggruppare diverse versioni di CMake con la loro applicazione, tale pratica non è consigliata. CMake offre forti garanzie di compatibilità con le versioni precedenti e non c'è motivo di non utilizzare una versione di CMake più recente di quella richiesta da un progetto, o addirittura la versione più recente. Pertanto, è consigliabile che i fornitori IDE che eseguono il blundle (raggruppamento) di CMake con la propria applicazione includano sempre la versione patch più recente di CMake disponibile al momento del rilascio.

source: As a suggestion, IDEs may also ship a copy of the Ninja buildsystem alongside CMake. Ninja is highly performant and well-supported on all platforms that support CMake. IDEs that bundle Ninja should use Ninja 1.10 or later, which contains features needed to support Fortran builds.
it: Come suggerimento, gli IDE potrebbero anche fornire una copia del sistema di build Ninja insieme a CMake. Ninja è altamente performante e ben supportato su tutte le piattaforme che supportano CMake. Gli IDE che raggruppano Ninja dovrebbero utilizzare Ninja 1.10 o versione successiva, che contiene le funzionalità necessarie per supportare le build Fortran.

source: Presets
it: Preimpostazioni

source: CMake supports a file format called ``CMakePresets.json``, and its user-specific counterpart, ``CMakeUserPresets.json``. This file contains information on the various configure presets that a user may want. Each preset may have a different compiler, build flags, etc. The details of this format are explained in the :manual:`cmake(1)` manual.
it: CMake supporta un formato di file chiamato ``CMakePresets.json`` e la sua controparte specifica dell'utente, ``CMakeUserPresets.json``. Questo file contiene informazioni sulle varie preimpostazioni della configurazione che un utente potrebbe desiderare. Ogni preimpostazione può avere un compilatore diverso, build flag, ecc. I dettagli di questo formato sono spiegati nel manuale :manual:`cmake(1)`.

source: IDE vendors are encouraged to read and evaluate this file the same way CMake does, and present the user with the presets listed in the file. Users should be able to see (and possibly edit) the CMake cache variables, environment variables, and command line options that are defined for a given preset. The IDE should then construct the list of appropriate :manual:`cmake(1)` command line arguments based on these settings, rather than using the ``--preset=`` option directly. The ``--preset=`` option is intended only as a convenient frontend for command line users, and should not be used by the IDE.
it: I fornitori di IDE sono incoraggiati a leggere e valutare questo file allo stesso modo di CMake e a presentare all'utente le preimpostazioni elencate nel file. Gli utenti dovrebbero essere in grado di visualizzare (ed eventualmente modificare) le variabili della cache CMake, le variabili di ambiente e le opzioni della riga di comando definite per una determinata preimpostazione. L'IDE dovrebbe poi costruire l'elenco degli argomenti della riga di comando :manual:`cmake(1)` appropriati in base a queste impostazioni, anziché utilizzare direttamente l'opzione ``--preset=``. L'opzione ``--preset=`` è intesa solo come un comodo frontend per gli utenti della riga di comando e non dovrebbe essere utilizzata dall'IDE.

source: For example, if a preset named ``ninja`` specifies ``Ninja`` as the generator and ``${sourceDir}/build`` as the build directory, instead of running:
it: Ad esempio, se un preset denominato ``ninja`` specifica ``Ninja`` come generatore e ``${sourceDir}/build`` come directory di build, invece di eseguire:

source: the IDE should instead calculate the settings of the ``ninja`` preset, and then run:
it: l'IDE dovrebbe invece calcolare le impostazioni del preset ``ninja``, e poi eseguire:

source: While reading, parsing, and evaluating the contents of ``CMakePresets.json`` is straightforward, it is not trivial. In addition to the documentation, IDE vendors may also wish to refer to the CMake source code and test cases for a better understanding of how to implement the format. :download:`This file <../../manual/presets/schema.json>` provides a machine-readable JSON schema for the ``CMakePresets.json`` format that IDE vendors may find useful for validation and providing editing assistance.
it: Sebbene leggere, analizzare e valutare il contenuto di ``CMakePresets.json`` sia semplice, non è banale. Oltre alla documentazione, i fornitori IDE potrebbero anche voler fare riferimento al codice sorgente CMake e ai casi di test per una migliore comprensione di come implementare il formato. :download:`Questo file <../../manual/presets/schema.json>` fornisce uno schema JSON leggibile dalla macchina per il formato ``CMakePresets.json`` che i fornitori IDE potrebbero trovare utile per la convalida e fornire assistenza per la modifica.

source: Configuring
it: Configurazione

source: IDEs that invoke :manual:`cmake(1)` to run the configure step may wish to receive information about the artifacts that the build will produce, as well as the include directories, compile definitions, etc. used to build the artifacts. Such information can be obtained by using the :manual:`File API <cmake-file-api(7)>`. The manual page for the File API contains more information about the API and how to invoke it. :manual:`Server mode <cmake-server(7)>` was removed as of CMake 3.20 and should not be used on CMake 3.14 or later.
it: Gli IDE che invocano :manual:`cmake(1)` per eseguire il passaggio di configurazione potrebbero voler ricevere informazioni sugli artefatti che la build produrrà, nonché sulle directory di inclusione, sulle definizioni della compilazione, ecc. utilizzate per creare gli artefatti. Tali informazioni possono essere ottenute utilizzando :manual:`File API <cmake-file-api(7)>`. La pagina del manuale per l'API File contiene ulteriori informazioni sull'API e su come richiamarla. :manual:`La modalità server <cmake-server(7)>` è stata rimossa a partire da CMake 3.20 e non deve essere utilizzata su CMake 3.14 o versioni successive.

source: IDEs should avoid creating more build trees than necessary, and only create multiple build trees if the user wishes to switch to a different compiler, use different compile flags, etc. In particular, IDEs should NOT create multiple single-config build trees which all have the same properties except for a differing :variable:`CMAKE_BUILD_TYPE`, effectively creating a multi-config environment. Instead, the :generator:`Ninja Multi-Config` generator, in conjunction with the :manual:`File API <cmake-file-api(7)>` to get the list of build configurations, should be used for this purpose.
it: Gli IDE devono evitare di creare più alberi di compilazione del necessario e crearne di più solo se l'utente desidera passare a un compilatore diverso, usare flag di compilazione diversi, ecc. In particolare, gli IDE NON dovrebbero creare più alberi di build a configurazione singola che abbiano tutti le stesse proprietà ad eccezione di una :variable:`CMAKE_BUILD_TYPE` diversa, creando di fatto un ambiente multi-config. Al contrario, per ottenere l'elenco delle configurazioni di build si deve usare il generatore :generator:`Ninja Multi-Config`, insieme al :manual:`File API <cmake-file-api(7)>`.

source: IDEs should not use the "extra generators" with Makefile or Ninja generators, which generate IDE project files in addition to the Makefile or Ninja files. Instead the :manual:`File API <cmake-file-api(7)>` should be used to get the list of build artifacts.
it: Gli IDE non dovrebbero utilizzare i "generatori extra" con i generatori Makefile o Ninja, che generano file di progetto IDE oltre ai file Makefile o Ninja. Si dovrebbe invece usare :manual:`File API <cmake-file-api(7)>` per ottenere l'elenco degli artefatti della compilazione.

source: If a Makefile or Ninja generator is used to generate the build tree, it is not recommended to invoke ``make`` or ``ninja`` directly. Instead, it is recommended that the IDE invoke :manual:`cmake(1)` with the ``--build`` argument, which will in turn invoke the appropriate build tool.
it: Se per generare l'albero di compilazione viene utilizzato un generatore Makefile o Ninja, non è consigliabile invocare direttamente ``make`` o ``ninja``. Si consiglia invece che l'IDE invochi :manual:`cmake(1)` con l'argomento ``--build``, che a sua volta invocherà lo strumento di compilazione appropriato.

source: If an IDE project generator is used, such as :generator:`Xcode` or one of the Visual Studio generators, and the IDE understands the project format used, the IDE should read the project file and build it the same way it would otherwise.
it: Se viene utilizzato un generatore di progetti IDE, come :generator:`Xcode` o uno dei generatori di Visual Studio, e l'IDE comprende il formato di progetto utilizzato, l'IDE dovrebbe leggere il file di progetto e compilarlo nello stesso modo in cui lo farebbe il generatore.

source: The :manual:`File API <cmake-file-api(7)>` can be used to obtain a list of build configurations from the build tree, and the IDE should present this list to the user to select a build configuration.
it: Il :manual:`File API <cmake-file-api(7)>` può essere utilizzato per ottenere un elenco di configurazioni di build dall'albero di build e l'IDE dovrebbe presentare questo elenco all'utente per selezionare una configurazione di build.

source: Testing
it: Test

source: :manual:`ctest(1)` supports outputting a JSON format with information about the available tests and test configurations. IDEs which want to run CTest should obtain this information and use it to present the user with a list of tests.
it: :manual:`ctest(1)` supporta l'output in formato JSON con informazioni sui test disponibili e sulle configurazioni dei test. Gli IDE che desiderano eseguire CTest dovrebbero ottenere queste informazioni e utilizzarle per presentare all'utente un elenco di test.

source: IDEs should not invoke the ``test`` target of the generated buildsystem. Instead, they should invoke :manual:`ctest(1)` directly.
it: Gli IDE non dovrebbero invocare il target ``test`` del buildsystem generato. Dovrebbero invece invocare direttamente :manual:`ctest(1)`.

source: Importing and Exporting Guide
it: Guida all'Importazione e all'Esportazione

source: In this guide, we will present the concept of :prop_tgt:`IMPORTED` targets and demonstrate how to import existing executable or library files from disk into a CMake project. We will then show how CMake supports exporting targets from one CMake-based project and importing them into another. Finally, we will demonstrate how to package a project with a configuration file to allow for easy integration into other CMake projects. This guide and the complete example source code can be found in the ``Help/guide/importing-exporting`` directory of the CMake source code tree.
it: In questa guida presenteremo il concetto di target :prop_tgt:`IMPORTED` e mostreremo come importare file eseguibili o librerie esistenti dal disco in un progetto CMake. Mostreremo poi come CMake supporta l'esportazione di target da un progetto basato su CMake e l'importazione in un altro. Infine, mostreremo come creare un pacchetto di un progetto con un file di configurazione per consentire una facile integrazione in altri progetti CMake. Questa guida e il codice sorgente di esempio completo si trovano nella directory ``Help/guide/importing-exporting`` dell'albero del codice sorgente di CMake.

source: Importing Targets
it: Importazione dei Target

source: :prop_tgt:`IMPORTED` targets are used to convert files outside of a CMake project into logical targets inside of the project. :prop_tgt:`IMPORTED` targets are created using the ``IMPORTED`` option of the :command:`add_executable` and :command:`add_library` commands. No build files are generated for :prop_tgt:`IMPORTED` targets. Once imported, :prop_tgt:`IMPORTED` targets may be referenced like any other target within the project and provide a convenient, flexible reference to outside executables and libraries.
it: I target :prop_tgt:`IMPORTED` vengono utilizzati per convertire file all'esterno di un progetto CMake in target logici all'interno del progetto. I target :prop_tgt:`IMPORTED` vengono creati utilizzando l'opzione ``IMPORTED`` dei comandi :command:`add_executable` e :command:`add_library`. Nessun file di build viene generato per i target :prop_tgt:`IMPORTED` targets. Una volta importati, i target :prop_tgt:`IMPORTED` possono essere referenziati come qualsiasi altro target all'interno del progetto e forniscono un riferimento comodo e flessibile a eseguibili e librerie esterne.

source: By default, the :prop_tgt:`IMPORTED` target name has scope in the directory in which it is created and below. We can use the ``GLOBAL`` option to extended visibility so that the target is accessible globally in the build system.
it: Per default, il nome del target :prop_tgt:`IMPORTED` ha uno "scope" nella directory in cui è stato creato e al di sotto. Possiamo utilizzare l'opzione ``GLOBAL`` per estendere lo scope in modo che il target sia accessibile globalmente nel sistema di build.

source: Details about the :prop_tgt:`IMPORTED` target are specified by setting properties whose names begin in ``IMPORTED_`` and ``INTERFACE_``. For example, :prop_tgt:`IMPORTED_LOCATION` contains the full path to the target on disk.
it: I dettagli sul target :prop_tgt:`IMPORTED` vengono specificati impostando le proprietà i cui nomi iniziano con ``IMPORTED_`` e ``INTERFACE_``. Ad esempio, :prop_tgt:`IMPORTED_LOCATION` contiene il percorso completo del target su disco.

source: Importing Executables
it: Importazione di Eseguibili

source: To start, we will walk through a simple example that creates an :prop_tgt:`IMPORTED` executable target and then references it from the :command:`add_custom_command` command.
it: Per iniziare, esamineremo un semplice esempio che crea un target eseguibile :prop_tgt:`IMPORTED` e poi vi fa riferimento dal comando :command:`add_custom_command`.

source: We'll need to do some setup to get started. We want to create an executable that when run creates a basic ``main.cc`` file in the current directory. The details of this project are not important. Navigate to ``Help/guide/importing-exporting/MyExe``, create a build directory, run :manual:`cmake <cmake(1)>` and build and install the project.
it: Avremo bisogno di fare qualche configurazione per iniziare. Vogliamo creare un eseguibile che quando viene eseguito crea un file elementare ``main.cc`` nella directory corrente. I dettagli di questo progetto non sono importanti. Passare a ``Help/guide/importing-exporting/MyExe``, creare una directory di build, eseguire :manual:`cmake <cmake(1)>` e creare e installare il progetto.

source: Now we can import this executable into another CMake project. The source code for this section is available in ``Help/guide/importing-exporting/Importing``. In the CMakeLists file, use the :command:`add_executable` command to create a new target called ``myexe``. Use the ``IMPORTED`` option to tell CMake that this target references an executable file located outside of the project. No rules will be generated to build it and the :prop_tgt:`IMPORTED` target property will be set to ``true``.
it: Ora possiamo importare questo eseguibile in un altro progetto CMake. Il codice sorgente di questa sezione è disponibile in ``Help/guide/importing-exporting/Importing``. Nel file CMakeLists, si usa il comando :command:`add_executable` per creare un nuovo target chiamato ``myexe``. Usare l'opzione ``IMPORTED`` per indicare a CMake che questo target fa riferimento a un file eseguibile situato all'esterno del progetto. Non verrà generata alcuna regola per costruirlo e la proprietà del target :prop_tgt:`IMPORTED` verrà impostata su ``true``.

source: Next, set the :prop_tgt:`IMPORTED_LOCATION` property of the target using the :command:`set_property` command. This will tell CMake the location of the target on disk. The location may need to be adjusted to the ``<install location>`` specified in the previous step.
it: Successivamente, si imposta la proprietà :prop_tgt:`IMPORTED_LOCATION` del target utilizzando il comando :command:`set_property`. Questo indicherà a CMake la posizione del target sul disco. Potrebbe essere necessario modificare il percorso in ``<install location>`` specificato nel passaggio precedente.

source: We can now reference this :prop_tgt:`IMPORTED` target just like any target built within the project. In this instance, let's imagine that we want to use the generated source file in our project. Use the :prop_tgt:`IMPORTED` target in the :command:`add_custom_command` command:
it: Ora possiamo fare riferimento a questo target :prop_tgt:`IMPORTED` proprio come qualsiasi target creato all'interno del progetto. In questo caso, immaginiamo di voler utilizzare il file sorgente generato nel nostro progetto. Si usa il target :prop_tgt:`IMPORTED` nel comando :command:`add_custom_command`:

source: As ``COMMAND`` specifies an executable target name, it will automatically be replaced by the location of the executable given by the :prop_tgt:`IMPORTED_LOCATION` property above.
it: Poiché ``COMMAND`` specifica un nome di target dell'eseguibile, verrà automaticamente sostituito dalla posizione dell'eseguibile fornita dalla proprietà :prop_tgt:`IMPORTED_LOCATION` di cui sopra.

source: Finally, use the output from :command:`add_custom_command`:
it: Infine, si usa l'output di :command:`add_custom_command`:

source: Importing Libraries
it: Importazione di Librerie

source: In a similar manner, libraries from other projects may be accessed through :prop_tgt:`IMPORTED` targets.
it: In modo simile, è possibile accedere alle librerie di altri progetti tramite target :prop_tgt:`IMPORTED`.

source: Note: The full source code for the examples in this section is not provided and is left as an exercise for the reader.
it: Nota: Il codice sorgente completo per gli esempi in questa sezione non viene fornito e viene lasciato come esercizio per il lettore.

source: In the CMakeLists file, add an :prop_tgt:`IMPORTED` library and specify its location on disk:
it: Nel file CMakeLists, si aggiunge una libreria :prop_tgt:`IMPORTED` e se ne specifica la posizione sul disco:

source: Then use the :prop_tgt:`IMPORTED` library inside of our project:
it: Poi si usa la libreria :prop_tgt:`IMPORTED` all'interno del progetto:

source: On Windows, a .dll and its .lib import library may be imported together:
it: Su Windows, un file .dll e la relativa libreria di importazione .lib possono essere importati insieme:

source: A library with multiple configurations may be imported with a single target:
it: Una libreria con più configurazioni può essere importata con un unico target:

source: The generated build system will link ``myexe`` to ``m.lib`` when built in the release configuration, and ``md.lib`` when built in the debug configuration.
it: Il sistema di build generato linkerà ``myexe`` a ``m.lib`` nella build nella configurazione di release e a ``md.lib`` nella configurazione di debug.

source: Exporting Targets
it: Esportazione dei Target

source: While :prop_tgt:`IMPORTED` targets on their own are useful, they still require that the project that imports them knows the locations of the target files on disk. The real power of :prop_tgt:`IMPORTED` targets is when the project providing the target files also provides a CMake file to help import them. A project can be setup to produce the necessary information so that it can easily be used by other CMake projects be it from a build directory, a local install or when packaged.
it: Anche se i target :prop_tgt:`IMPORTED` da soli sono utili, richiedono comunque che il progetto che li importa conosca le posizioni dei loro file sul disco. Il vero potere dei target :prop_tgt:`IMPORTED` è quando il progetto che ne fornisce i file fornisce anche un file CMake per importarli. Un progetto può essere configurato per produrre le informazioni necessarie in modo che possa essere facilmente utilizzato da altri progetti CMake da una directory di build, da un'installazione locale o quando inserito in un pacchetto.

source: In the remaining sections, we will walk through a set of example projects step-by-step. The first project will create and install a library and corresponding CMake configuration and package files. The second project will use the generated package.
it: Nelle restanti sezioni, esamineremo passo dopo passo una serie di progetti di esempio. Il primo progetto creerà e installerà una libreria e la configurazione CMake corrispondente e i file del pacchetto. Il secondo progetto utilizzerà il pacchetto generato.

source: Let's start by looking at the ``MathFunctions`` project in the ``Help/guide/importing-exporting/MathFunctions`` directory. Here we have a header file ``MathFunctions.h`` that declares a ``sqrt`` function:
it: Iniziamo guardando il progetto ``MathFunctions`` nella directory ``Help/guide/importing-exporting/MathFunctions``. Qui abbiamo un file di header ``MathFunctions.h`` che dichiara una funzione ``sqrt``:

source: And a corresponding source file ``MathFunctions.cxx``:
it: E un file sorgente corrispondente ``MathFunctions.cxx``:

source: Don't worry too much about the specifics of the C++ files, they are just meant to be a simple example that will compile and run on many build systems.
it: Non ci si preoccupi troppo delle specifiche dei file C++, sono pensati solo per essere un semplice esempio che verrà compilato ed eseguito su molti sistemi di build.

source: Now we can create a ``CMakeLists.txt`` file for the ``MathFunctions`` project. Start by specifying the :command:`cmake_minimum_required` version and :command:`project` name:
it: Ora possiamo creare un file ``CMakeLists.txt`` per il progetto ``MathFunctions``. Si inizia specificando la versione di :command:`cmake_minimum_required` e il nome del :command:`project`:
