Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: When it is first executed, CMake generates a ``CMakeCache.txt`` file in the build directory containing key-value pairs for such artifacts. The cache file can be viewed or edited by the user by running the :manual:`cmake-gui(1)` or :manual:`ccmake(1)` tool. The tools provide an interactive interface for re-configuring the provided software and re-generating the buildsystem, as is needed after editing cached values. Each cache entry may have an associated short help text which is displayed in the user interface tools.
it: Quando viene eseguito per la prima volta, CMake genera un file ``CMakeCache.txt`` nella directory di build contenente coppie chiave-valore per tali artefatti. Il file della cache può essere visualizzato o modificato dall'utente eseguendo :manual:`cmake-gui(1)` o :manual:`ccmake(1)`. Gli strumenti forniscono un'interfaccia interattiva per riconfigurare il software e rigenerare il sistema di build, come necessario dopo aver modificato i valori memorizzati nella cache. A ciascuna voce della cache può essere associato un breve testo di aiuto che viene visualizzato nei tool dell'interfaccia utente.

source: The cache entries may also have a type to signify how it should be presented in the user interface. For example, a cache entry of type ``BOOL`` can be edited by a checkbox in a user interface, a ``STRING`` can be edited in a text field, and a ``FILEPATH`` while similar to a ``STRING`` should also provide a way to locate filesystem paths using a file dialog. An entry of type ``STRING`` may provide a restricted list of allowed values which are then provided in a drop-down menu in the :manual:`cmake-gui(1)` user interface (see the :prop_cache:`STRINGS` cache property).
it: Le voci della cache possono anche avere un tipo per indicare come dovrebbero essere presentate nell'interfaccia utente. Ad esempio, una voce della cache di tipo ``BOOL`` può essere modificata da una casella di controllo in un'interfaccia utente, una ``STRING`` può essere modificata in un campo di testo e un ``FILEPATH`` pur essendo simile a ``STRING`` dovrebbe anche fornire un modo per individuare i percorsi del filesystem utilizzando una finestra di dialogo per i file. Una voce di tipo ``STRING`` potrebbe consentire un elenco ristretto di valori che vengono poi forniti in un menù a discesa nell'interfaccia utente :manual:`cmake-gui(1)` (vedere la sezione della proprietà della cache :prop_cache:`STRINGS`).

source: The CMake files shipped with a software package may also define boolean toggle options using the :command:`option` command. The command creates a cache entry which has a help text and a default value. Such cache entries are typically specific to the provided software and affect the configuration of the build, such as whether tests and examples are built, whether to build with exceptions enabled etc.
it: I file CMake forniti con un pacchetto software possono anche definire opzioni di attivazione/disattivazione booleane utilizzando il comando :command:`option`. Il comando crea una voce nella cache che ha un testo di aiuto e un valore di default. Tali voci della cache sono in genere specifiche del software fornito e influiscono sulla configurazione della build, ad esempio se vengono creati test ed esempi, se compilare con le eccezioni abilitate, ecc.

source: CMake understands a file, ``CMakePresets.json``, and its user-specific counterpart, ``CMakeUserPresets.json``, for saving presets for commonly-used configure settings. These presets can set the build directory, generator, cache variables, environment variables, and other command-line options. All of these options can be overridden by the user. The full details of the ``CMakePresets.json`` format are listed in the :manual:`cmake-presets(7)` manual.
it: CMake riconosce un file, ``CMakePresets.json``, e la sua controparte specifica dell'utente, ``CMakeUserPresets.json``, per il salvataggio delle preimpostazioni per le configurazione di uso comune. Queste preimpostazioni possono impostare la directory di build, il generatore, le variabili della cache, le variabili di ambiente e altre opzioni della riga di comando. Tutte queste opzioni possono essere sovrascritte dall'utente. I dettagli completi del formato ``CMakePresets.json`` sono elencati nel manuale :manual:`cmake-presets(7)`.

source: Using presets on the command-line
it: Utilizzo delle preimpostazioni sulla riga di comando

source: When using the :manual:`cmake(1)` command line tool, a preset can be invoked by using the ``--preset`` option. If ``--preset`` is specified, the generator and build directory are not required, but can be specified to override them. For example, if you have the following ``CMakePresets.json`` file:
it: Quando si utilizza lo strumento da riga di comando :manual:`cmake(1)`, è possibile richiamare un preset utilizzando l'opzione ``--preset``. Se viene specificato ``--preset``, il generatore e la directory di build non sono necessari, ma possono essere specificati per sovrascriverli. Ad esempio, se si ha il seguente file ``CMakePresets.json``:

source: and you run the following:
it: e si esegue quanto segue:

source: This will generate a build directory in ``/path/to/source/build/ninja-release`` with the :generator:`Ninja` generator, and with :variable:`CMAKE_BUILD_TYPE` set to ``Release``.
it: Questo genererà una directory di build in ``/path/to/source/build/ninja-release`` col generatore :generator:`Ninja` generator e con :variable:`CMAKE_BUILD_TYPE` impostato su ``Release``.

source: If you want to see the list of available presets, you can run:
it: Per vedere l'elenco dei preset disponibili, si può eseguire:

source: This will list the presets available in ``/path/to/source/CMakePresets.json`` and ``/path/to/source/CMakeUsersPresets.json`` without generating a build tree.
it: Questo elencherà le preimpostazioni disponibili in ``/path/to/source/CMakePresets.json`` e in ``/path/to/source/CMakeUsersPresets.json`` senza generare un albero di build.

source: Using presets in cmake-gui
it: Utilizzo dei preset in cmake-gui

source: If a project has presets available, either through ``CMakePresets.json`` or ``CMakeUserPresets.json``, the list of presets will appear in a drop-down menu in :manual:`cmake-gui(1)` between the source directory and the binary directory. Choosing a preset sets the binary directory, generator, environment variables, and cache variables, but all of these options can be overridden after a preset is selected.
it: Se un progetto ha dei preset disponibili, tramite ``CMakePresets.json`` o ``CMakeUserPresets.json``, l'elenco dei preset apparirà in un menù a discesa in :manual:`cmake-gui(1)` tra la directory dei sorgenti e quella binaria. La scelta di una preimpostazione imposta la directory binaria, il generatore, le variabili di ambiente e le variabili della cache, ma tutte queste opzioni possono essere sovrascritte dopo aver selezionato una preimpostazione.

source: Invoking the Buildsystem
it: Invocare il Buildsystem

source: After generating the buildsystem, the software can be built by invoking the particular build tool. In the case of the IDE generators, this can involve loading the generated project file into the IDE to invoke the build.
it: Dopo aver generato il sistema di build, è possibile creare il software richiamando il particolare tool. Nel caso dei generatori IDE, ciò può comportare il caricamento del file di progetto generato nell'IDE per richiamare la build.

source: CMake is aware of the specific build tool needed to invoke a build so in general, to build a buildsystem or project from the command line after generating, the following command may be invoked in the build directory:
it: CMake è a conoscenza dello strumento specifico necessario per invocare una build quindi, in generale, per creare un sistema di build o un progetto dalla riga di comando dopo la generazione, è possibile invocare il seguente comando nella directory di build:

source: The ``--build`` flag enables a particular mode of operation for the :manual:`cmake(1)` tool. It invokes the :variable:`CMAKE_MAKE_PROGRAM` command associated with the :manual:`generator <cmake-generators(7)>`, or the build tool configured by the user.
it: Il flag ``--build`` abilita una particolare modalità operativa per :manual:`cmake(1)`. Invoca il comando :variable:`CMAKE_MAKE_PROGRAM` associato al :manual:`generatore <cmake-generators(7)>` o allo strumento di build configurato dall'utente.

source: The ``--build`` mode also accepts the parameter ``--target`` to specify a particular target to build, for example a particular library, executable or custom target, or a particular special target like ``install``:
it: La modalità ``--build`` accetta anche il parametro ``--target`` per specificare un particolare target da compilare, ad esempio una particolare libreria, un eseguibile o un target personalizzato, o un particolare target speciale come ``install``:

source: The ``--build`` mode also accepts a ``--config`` parameter in the case of multi-config generators to specify which particular configuration to build:
it: La modalità ``--build`` accetta anche un parametro ``--config`` nel caso di generatori multi-config per specificare quale particolare configurazione buildare:

source: The ``--config`` option has no effect if the generator generates a buildsystem specific to a configuration which is chosen when invoking cmake with the :variable:`CMAKE_BUILD_TYPE` variable.
it: L'opzione ``--config`` non ha effetto se il generatore genera un sistema di build specifico per una configurazione scelta quando si invoca cmake con la variabile :variable:`CMAKE_BUILD_TYPE`.

source: Some buildsystems omit details of command lines invoked during the build. The ``--verbose`` flag can be used to cause those command lines to be shown:
it: Alcuni sistemi di build omettono i dettagli delle righe di comando invocate durante la build. Il flag ``--verbose`` può essere utilizzato per visualizzare tali righe di comando:

source: The ``--build`` mode can also pass particular command line options to the underlying build tool by listing them after ``--``. This can be useful to specify options to the build tool, such as to continue the build after a failed job, where CMake does not provide a high-level user interface.
it: La modalità ``--build`` può anche passare particolari opzioni della riga di comando allo strumento di build sottostante elencandole dopo ``--``. Ciò può essere utile per specificare le opzioni per lo strumento di build, ad esempio per continuare dopo una build non riuscita, in cui CMake non fornisce un'interfaccia utente di alto livello.

source: For all generators, it is possible to run the underlying build tool after invoking CMake. For example, ``make`` may be executed after generating with the :generator:`Unix Makefiles` generator to invoke the build, or ``ninja`` after generating with the :generator:`Ninja` generator etc. The IDE buildsystems usually provide command line tooling for building a project which can also be invoked.
it: Per tutti i generatori, è possibile eseguire lo strumento di build sottostante dopo aver richiamato CMake. Ad esempio, ``make`` può essere eseguito dopo aver generato con il generatore :generator:`Unix Makefiles` per invocare la build, o ``ninja`` dopo aver generato con il generatore :generator:`Ninja` ecc. I sistemi di build IDE di solito forniscono strumenti da riga di comando per creare un progetto che può anche essere invocato.

source: Selecting a Target
it: Selezionare un Target

source: Each executable and library described in the CMake files is a build target, and the buildsystem may describe custom targets, either for internal use, or for user consumption, for example to create documentation.
it: Ogni eseguibile e libreria descritta nei file CMake è un target della build e il sistema di build può descrivere target personalizzati, sia per uso interno che per consumo da parte dell'utente, ad esempio per creare documentazione.

source: CMake provides some built-in targets for all buildsystems providing CMake files.
it: CMake fornisce alcuni target nativi per tutti i sistemi di build che forniscono file CMake.

source: The default target used by ``Makefile`` and ``Ninja`` generators. Builds all targets in the buildsystem, except those which are excluded by their :prop_tgt:`EXCLUDE_FROM_ALL` target property or :prop_dir:`EXCLUDE_FROM_ALL` directory property. The name ``ALL_BUILD`` is used for this purpose for the Xcode and Visual Studio generators.
it: Il target di default utilizzato dai generatori ``Makefile`` e ``Ninja``. Esegue la build di tutti i target nel buildsystem, eccetto quelli che sono esclusi dalla loro proprietà di target :prop_tgt:`EXCLUDE_FROM_ALL` o dalla proprietà di directory :prop_dir:`EXCLUDE_FROM_ALL`. A questo scopo viene utilizzato il nome ``ALL_BUILD`` per i generatori Xcode e Visual Studio.

source: Lists the targets available for build. This target is available when using the :generator:`Unix Makefiles` or :generator:`Ninja` generator, and the exact output is tool-specific.
it: Elenca i target disponibili per la build. Questo target è disponibile quando si usa il generatore :generator:`Unix Makefiles` o :generator:`Ninja` e l'output esatto è specifico del tool.

source: Delete built object files and other output files. The ``Makefile`` based generators create a ``clean`` target per directory, so that an individual directory can be cleaned. The ``Ninja`` tool provides its own granular ``-t clean`` system.
it: Elimina i file oggetto creati e altri file di output. I generatori basati su ``Makefile`` creano un target ``pulito`` per ogni directory, in modo che una singola directory possa essere pulita. ``Ninja`` fornisce il proprio sistema granulare ``-t clean``.

source: Runs tests. This target is only automatically available if the CMake files provide CTest-based tests. See also `Running Tests`_.
it: Esegue i test. Questo target è disponibile automaticamente solo se i file CMake forniscono test basati su CTest. Vedere anche `Running Tests`_.

source: Installs the software. This target is only automatically available if the software defines install rules with the :command:`install` command. See also `Software Installation`_.
it: Installa il software. Questo target è disponibile automaticamente solo se il software definisce le regole di installazione col comando :command:`install`. Vedere anche `Software Installation`_.

source: Creates a binary package. This target is only automatically available if the CMake files provide CPack-based packages.
it: Crea un pacchetto binario. Questo target è disponibile automaticamente solo se i file CMake forniscono pacchetti basati su CPack.

source: Creates a source package. This target is only automatically available if the CMake files provide CPack-based packages.
it: Creare un pacchetto sorgente Questo target è disponibile automaticamente solo se i file CMake forniscono pacchetti basati su CPack.

source: For ``Makefile`` based systems, ``/fast`` variants of binary build targets are provided. The ``/fast`` variants are used to build the specified target without regard for its dependencies. The dependencies are not checked and are not rebuilt if out of date. The :generator:`Ninja` generator is sufficiently fast at dependency checking that such targets are not provided for that generator.
it: Per i sistemi basati su ``Makefile``, vengono fornite varianti ``/fast`` dei target binari creati. Le varianti ``/fast`` vengono utilizzate per creare il target specificato senza riguardo per le sue dipendenze. Le dipendenze non vengono controllate e non vengono re-buildate se non aggiornate. Il generatore :generator:`Ninja` è sufficientemente veloce nel controllare che tali dipendenze dei target non siano fornite per quel generatore.

source: ``Makefile`` based systems also provide build-targets to preprocess, assemble and compile individual files in a particular directory.
it: I sistemi basati su ``Makefile`` forniscono anche target di build per pre-processare, assemblare e compilare singoli file in una particolare directory.

source: The file extension is built into the name of the target because another file with the same name but a different extension may exist. However, build-targets without the file extension are also provided.
it: L'estensione del file è inclusa nel nome del target perché potrebbe esistere un altro file con lo stesso nome ma con un'estensione diversa. Tuttavia, vengono forniti anche build-target senza estensione del file.

source: In buildsystems which contain ``foo.c`` and ``foo.cpp``, building the ``foo.i`` target will preprocess both files.
it: Nei sistemi di compilazione che contengono ``foo.c`` e ``foo.cpp``, la build del target ``foo.i`` preprocesserà entrambi i file.

source: Specifying a Build Program
it: Specificare di un Programma di Build

source: The program invoked by the ``--build`` mode is determined by the :variable:`CMAKE_MAKE_PROGRAM` variable. For most generators, the particular program does not need to be configured.
it: Il programma richiamato dalla modalità ``--build`` è determinato dalla variabile :variable:`CMAKE_MAKE_PROGRAM`. Per la maggior parte dei generatori non è necessario configurare il programma specifico.

source: Generator
it: Generatore

source: Default make program
it: Programma make di default

source: Alternatives
it: Alternative

source: The ``jom`` tool is capable of reading makefiles of the ``NMake`` flavor and building in parallel, while the ``nmake`` tool always builds serially. After generating with the :generator:`NMake Makefiles` generator a user can run ``jom`` instead of ``nmake``. The ``--build`` mode would also use ``jom`` if the :variable:`CMAKE_MAKE_PROGRAM` was set to ``jom`` while using the :generator:`NMake Makefiles` generator, and as a convenience, the :generator:`NMake Makefiles JOM` generator is provided to find ``jom`` in the normal way and use it as the :variable:`CMAKE_MAKE_PROGRAM`. For completeness, ``nmake`` is an alternative tool which can process the output of the :generator:`NMake Makefiles JOM` generator, but doing so would be a pessimisation.
it: Il tool ``jom`` è in grado di leggere makefile del tipo ``NMake`` e di compilarli in parallelo, mentre ``nmake`` compila sempre serialmente. Dopo aver generato con il generatore :generator:`NMake Makefiles` un utente può eseguire ``jom`` invece di ``nmake``. La modalità ``--build`` utilizzerebbe anche ``jom`` se la :variable:`CMAKE_MAKE_PROGRAM` fosse impostata su ``jom`` durante l'utilizzo del generatore :generator:`NMake Makefiles`, e per comodità, viene fornito il generatore :generator:`NMake Makefiles JOM` per trovare ``jom`` nel modo normale e usarlo come :variable:`CMAKE_MAKE_PROGRAM`. Per completezza, ``nmake`` è uno strumento alternativo che può elaborare l'output del generatore :generator:`NMake Makefiles JOM`, ma farlo peggiorerebbe le cose.

source: Software Installation
it: Installazione Software

source: The :variable:`CMAKE_INSTALL_PREFIX` variable can be set in the CMake cache to specify where to install the provided software. If the provided software has install rules, specified using the :command:`install` command, they will install artifacts into that prefix. On Windows, the default installation location corresponds to the ``ProgramFiles`` system directory which may be architecture specific. On Unix hosts, ``/usr/local`` is the default installation location.
it: La variabile :variable:`CMAKE_INSTALL_PREFIX` può essere impostata nella cache CMake per specificare dove installare il software. Se il software fornito dispone di regole di installazione, specificate utilizzando il comando :command:`install`, verranno installati gli artefatti in quel prefisso. Su Windows, il percorso di installazione predefinito corrisponde alla directory di sistema ``ProgramFiles`` che potrebbe essere specifica dell'architettura. Sugli host Unix, ``/usr/local`` è il percorso di installazione predefinito.

source: The :variable:`CMAKE_INSTALL_PREFIX` variable always refers to the installation prefix on the target filesystem.
it: La variabile :variable:`CMAKE_INSTALL_PREFIX` si riferisce sempre al prefisso di installazione sul filesystem target.

source: In cross-compiling or packaging scenarios where the sysroot is read-only or where the sysroot should otherwise remain pristine, the :variable:`CMAKE_STAGING_PREFIX` variable can be set to a location to actually install the files.
it: Negli scenari di cross-compilazione o di impacchettamento in cui il sysroot è di sola lettura o dove il sysroot dovrebbe comunque rimanere intatto, la variabile :variable:`CMAKE_STAGING_PREFIX` può essere impostata su una posizione per installare effettivamente i file.

source: The commands:
it: I comandi:

source: result in files being installed to paths such as ``/tmp/package/lib/libfoo.so`` on the host machine. The ``/usr/local`` location on the host machine is not affected.
it: comportano l'installazione di file in percorsi come ``/tmp/package/lib/libfoo.so`` sul computer host. La posizione ``/usr/local`` sulla macchina host non è interessata.

source: Some provided software may specify ``uninstall`` rules, but CMake does not generate such rules by default itself.
it: Alcuni software forniti potrebbero specificare regole di ``uninstall``, ma CMake non genera tali regole per default.

source: Running Tests
it: Esecuzione di Test

source: The :manual:`ctest(1)` tool is shipped with the CMake distribution to execute provided tests and report results. The ``test`` build-target is provided to run all available tests, but the :manual:`ctest(1)` tool allows granular control over which tests to run, how to run them, and how to report results. Executing :manual:`ctest(1)` in the build directory is equivalent to running the ``test`` target:
it: :manual:`ctest(1)` viene fornito con la distribuzione CMake per eseguire i test forniti e riportare i risultati. Il build-target ``test`` viene fornito per eseguire tutti i test disponibili, ma :manual:`ctest(1)` consente un controllo granulare su quali test eseguire, come eseguirli e come riportare i risultati. L'esecuzione di :manual:`ctest(1)` nella directory build equivale a eseguire il target ``test``:

source: A regular expression can be passed to run only tests which match the expression. To run only tests with ``Qt`` in their name:
it: È possibile passare un'espressione regolare per eseguire solo i test che corrispondono all'espressione. Per eseguire solo i test con ``Qt`` nel nome:

source: Tests can be excluded by regular expression too. To run only tests without ``Qt`` in their name:
it: I test possono essere esclusi anche tramite espressioni regolari. Per eseguire solo i test senza ``Qt`` nel nome:

source: Tests can be run in parallel by passing ``-j`` arguments to :manual:`ctest(1)`:
it: I test possono essere eseguiti in parallelo passando gli argomenti ``-j`` a :manual:`ctest(1)`:

source: The environment variable :envvar:`CTEST_PARALLEL_LEVEL` can alternatively be set to avoid the need to pass ``-j``.
it: In alternativa, è possibile impostare la variabile d'ambiente :envvar:`CTEST_PARALLEL_LEVEL` per evitare la necessità di passare ``-j``.
