Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: The :module:`CTest` module will automatically call ``enable_testing()``, so we can remove it from our CMake files.
it: Il modulo :module:`CTest` chiamerà automaticamente ``enable_testing()``, quindi possiamo rimuoverlo dai file CMake.

source: We will also need to create a ``CTestConfig.cmake`` file in the top-level directory where we can specify the name of the project and where to submit the dashboard.
it: Dovremo anche creare un file ``CTestConfig.cmake`` nella directory di primo livello in cui possiamo specificare il nome del progetto e dove inviare la dashboard.

source: The :manual:`ctest <ctest(1)>` executable will read in this file when it runs. To create a simple dashboard you can run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project, but do not build it yet. Instead, change directory to the binary tree, and then run:
it: :manual:`ctest <ctest(1)>` leggerà questo file quando verrà eseguito. Per creare una semplice dashboard si può lanciare l'eseguibile :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto, ma senza farne la build ancora. Cambiare invece la directory nell'albero binario ed eseguire:

source: Remember, for multi-config generators (e.g. Visual Studio), the configuration type must be specified::
it: Ricordarsi che per i generatori multi-config (es. Visual Studio), è necessario specificare il tipo di configurazione::

source: Or, from an IDE, build the ``Experimental`` target.
it: Oppure, da un IDE, si esegue la build ``Experimental`` del target.

source: The :manual:`ctest <ctest(1)>` executable will build and test the project and submit the results to Kitware's public dashboard: https://my.cdash.org/index.php?project=CMakeTutorial.
it: L'eseguibile :manual:`ctest <ctest(1)>` creerà e testerà il progetto e invierà i risultati alla dashboard pubblica di Kitware: https://my.cdash.org/index.php?project=CMakeTutorial.

source: Mixing Static and Shared (Step 9)
it: Mix di Static e Shared (Step 9)

source: In this section we will show how the :variable:`BUILD_SHARED_LIBS` variable can be used to control the default behavior of :command:`add_library`, and allow control over how libraries without an explicit type (``STATIC``, ``SHARED``, ``MODULE`` or ``OBJECT``) are built.
it: In questa sezione mostreremo come la variabile :variable:`BUILD_SHARED_LIBS` è utilizzabile per controllare il comportamento di default di :command:`add_library` e consentire il controllo su come le librerie senza un tipo esplicito (``STATIC``, ``SHARED``, ``MODULE`` o ``OBJECT``) vengono costruite.

source: To accomplish this we need to add :variable:`BUILD_SHARED_LIBS` to the top-level ``CMakeLists.txt``. We use the :command:`option` command as it allows users to optionally select if the value should be ON or OFF.
it: Per ottenere ciò dobbiamo aggiungere :variable:`BUILD_SHARED_LIBS` al ``CMakeLists.txt`` di livello superiore. Usiamo il comando :command:`option` poiché consente agli utenti di selezionare facoltativamente se il valore deve essere ON o OFF.

source: Next we are going to refactor MathFunctions to become a real library that encapsulates using ``mysqrt`` or ``sqrt``, instead of requiring the calling code to do this logic. This will also mean that ``USE_MYMATH`` will not control building MathFunctions, but instead will control the behavior of this library.
it: Successivamente effettueremo il refactoring di MathFunctions per farla diventare una vera libreria che incapsuli l'utilizzo di ``mysqrt`` o ``sqrt``, invece di richiedere al codice chiamante di eseguire questa logica. Ciò significherà anche che ``USE_MYMATH`` non controllerà la build di MathFunctions, ma controllerà invece il comportamento di questa libreria.

source: The first step is to update the starting section of the top-level ``CMakeLists.txt`` to look like:
it: Il primo passo è aggiornare la sezione iniziale del file ``CMakeLists.txt`` di livello superiore in modo che assomigli a:

source: Now that we have made MathFunctions always be used, we will need to update the logic of that library. So, in ``MathFunctions/CMakeLists.txt`` we need to create a SqrtLibrary that will conditionally be built and installed when ``USE_MYMATH`` is enabled. Now, since this is a tutorial, we are going to explicitly require that SqrtLibrary is built statically.
it: Ora che abbiamo fatto in modo che MathFunctions venga sempre utilizzata, ne dovremo aggiornare la logica. Quindi, in ``MathFunctions/CMakeLists.txt`` dobbiamo creare una SqrtLibrary che verrà creata e installata in modo condizionale quando ``USE_MYMATH`` è abilitato. Ora, poiché questo è un tutorial, richiederemo esplicitamente che SqrtLibrary venga creata staticamente.

source: The end result is that ``MathFunctions/CMakeLists.txt`` should look like:
it: Il risultato finale è che ``MathFunctions/CMakeLists.txt`` dovrebbe assomigliare a:

source: Next, update ``MathFunctions/mysqrt.cxx`` to use the ``mathfunctions`` and ``detail`` namespaces:
it: Successivamente, si aggiorna ``MathFunctions/mysqrt.cxx`` per utilizzare i namespace ``mathfunctions`` e ``detail``:

source: We also need to make some changes in ``tutorial.cxx``, so that it no longer uses ``USE_MYMATH``:
it: Dobbiamo anche apportare alcune modifiche a ``tutorial.cxx``, in modo che non utilizzi più ``USE_MYMATH``:

source: Always include ``MathFunctions.h``
it: Include sempre ``MathFunctions.h``

source: Always use ``mathfunctions::sqrt``
it: Utilizza sempre ``mathfunctions::sqrt``

source: Don't include cmath
it: Non include cmath

source: Finally, update ``MathFunctions/MathFunctions.h`` to use dll export defines:
it: Infine, si aggiorn ``MathFunctions/MathFunctions.h`` per utilizzare le definizioni di esportazione delle dll:

source: At this point, if you build everything, you may notice that linking fails as we are combining a static library without position independent code with a library that has position independent code. The solution to this is to explicitly set the :prop_tgt:`POSITION_INDEPENDENT_CODE` target property of SqrtLibrary to be True no matter the build type.
it: A questo punto, buildando il tutto, si noterà che il link fallisce poiché stiamo combinando una libreria statica senza codice indipendente dalla posizione con una libreria che ha codice indipendente dalla posizione. La soluzione a questo problema è impostare esplicitamente la proprietà del target :prop_tgt:`POSITION_INDEPENDENT_CODE` di SqrtLibrary su True, indipendentemente dal tipo di build.

source: **Exercise**: We modified ``MathFunctions.h`` to use dll export defines. Using CMake documentation can you find a helper module to simplify this?
it: **Esercizio**: Abbiamo modificato ``MathFunctions.h`` per utilizzare le definizioni di esportazione delle dll. Utilizzando la documentazione di CMake si può trovare un modulo di supporto per semplificarlo?

source: Adding Generator Expressions (Step 10)
it: Aggiungere di Espressioni del Generatore (Step 10)

source: :manual:`Generator expressions <cmake-generator-expressions(7)>` are evaluated during build system generation to produce information specific to each build configuration.
it: :manual:`Generator expressions <cmake-generator-expressions(7)>` vengono valutate durante la generazione del sistema di build per produrre informazioni specifiche per ciascuna configurazione di build.

source: :manual:`Generator expressions <cmake-generator-expressions(7)>` are allowed in the context of many target properties, such as :prop_tgt:`LINK_LIBRARIES`, :prop_tgt:`INCLUDE_DIRECTORIES`, :prop_tgt:`COMPILE_DEFINITIONS` and others. They may also be used when using commands to populate those properties, such as :command:`target_link_libraries`, :command:`target_include_directories`, :command:`target_compile_definitions` and others.
it: :manual:`Generator expressions <cmake-generator-expressions(7)>` sono consentite nel contesto di molte proprietà di target, come :prop_tgt:`LINK_LIBRARIES`, :prop_tgt:`INCLUDE_DIRECTORIES`, :prop_tgt:`COMPILE_DEFINITIONS` e altre. Sono anche utilizzabili quando si usano comandi per popolare tali proprietà, come :command:`target_link_libraries`, :command:`target_include_directories`, :command:`target_compile_definitions` e altri.

source: :manual:`Generator expressions <cmake-generator-expressions(7)>` may be used to enable conditional linking, conditional definitions used when compiling, conditional include directories and more. The conditions may be based on the build configuration, target properties, platform information or any other queryable information.
it: :manual:`Generator expressions <cmake-generator-expressions(7)>` possono essere utilizzate per abilitare il link condizionale, le definizioni condizionali utilizzate durante la compilazione, le directory di inclusione condizionale e altro ancora. Le condizioni possono essere basate sulla configurazione della build, sulle proprietà del target, sulle informazioni della piattaforma o su qualsiasi altra informazione interrogabile.

source: There are different types of :manual:`generator expressions <cmake-generator-expressions(7)>` including Logical, Informational, and Output expressions.
it: Esistono diversi tipi di :manual:`generator expressions <cmake-generator-expressions(7)>` comprese le espressioni Logiche, Informative e di Output.

source: Logical expressions are used to create conditional output. The basic expressions are the 0 and 1 expressions. A ``$<0:...>`` results in the empty string, and ``<1:...>`` results in the content of "...". They can also be nested.
it: Le espressioni logiche vengono utilizzate per creare un output condizionale. Le espressioni di base sono le espressioni 0 e 1. ``$<0:...>`` restituisce una stringa vuota e ``<1:...>`` restituisce il contenuto di "...". Possono anche essere annidate.

source: A common usage of :manual:`generator expressions <cmake-generator-expressions(7)>` is to conditionally add compiler flags, such as those for language levels or warnings. A nice pattern is to associate this information to an ``INTERFACE`` target allowing this information to propagate. Let's start by constructing an ``INTERFACE`` target and specifying the required C++ standard level of ``11`` instead of using :variable:`CMAKE_CXX_STANDARD`.
it: Un utilizzo comune delle :manual:`generator expressions <cmake-generator-expressions(7)>` è quello di aggiungere in modo condizionale flag del compilatore, come quelli per i livelli del linguaggio o i warning. Un pattern interessante è quello di associare queste informazioni a un target ``INTERFACE`` che consente a queste informazioni di propagarsi. Iniziamo costruendo un target ``INTERFACE`` e specificando il livello dello standard C++ richiesto di ``11`` invece di utilizzare :variable:`CMAKE_CXX_STANDARD`.

source: So the following code:
it: Quindi il seguente codice:

source: Would be replaced with:
it: Verrebbe sostituito con:

source: Next we add the desired compiler warning flags that we want for our project. As warning flags vary based on the compiler we use the ``COMPILE_LANG_AND_ID`` generator expression to control which flags to apply given a language and a set of compiler ids as seen below:
it: Successivamente aggiungiamo i flag di warning del compilatore desiderati che vogliamo per il progetto. Poiché i flag di warning variano in base al compilatore, utilizziamo l'espressione generatrice ``COMPILE_LANG_AND_ID`` per controllare quali flag applicare dato un linguaggio e un set di ID del compilatore come mostrato di seguito:

source: Looking at this we see that the warning flags are encapsulated inside a ``BUILD_INTERFACE`` condition. This is done so that consumers of our installed project will not inherit our warning flags.
it: Osservando questo vediamo che i flag di warning sono incapsulati all'interno di una condizione ``BUILD_INTERFACE``. Questo viene fatto in modo che i consumer (consumatori) del progetto installato non ereditino i flag di warning.

source: **Exercise**: Modify ``MathFunctions/CMakeLists.txt`` so that all targets have a :command:`target_link_libraries` call to ``tutorial_compiler_flags``.
it: **Esercizio**: Modificare ``MathFunctions/CMakeLists.txt`` in modo che tutti i target abbiano una chiamata :command:`target_link_libraries` a ``tutorial_compiler_flags``.

source: Adding Export Configuration (Step 11)
it: Aggiungere la Configurazione di Esportazione (Step 11)

source: During `Installing and Testing (Step 4)`_ of the tutorial we added the ability for CMake to install the library and headers of the project. During `Building an Installer (Step 7)`_ we added the ability to package up this information so it could be distributed to other people.
it: In `Installazione e Test (Step 4)`_ del tutorial abbiamo aggiunto la possibilità per CMake di installare la libreria e gli header del progetto. In `Creazione di un Programma di Installazione (Step 7)`_ abbiamo aggiunto la possibilità di impacchettare queste informazioni in modo che possano essere distribuite ad altri.

source: The next step is to add the necessary information so that other CMake projects can use our project, be it from a build directory, a local install or when packaged.
it: Il passaggio successivo è quello di aggiungere le informazioni necessarie in modo che altri progetti CMake possano utilizzare il nostro progetto, sia da una directory di build, da un'installazione locale o da un pacchetto.

source: The first step is to update our :command:`install(TARGETS)` commands to not only specify a ``DESTINATION`` but also an ``EXPORT``. The ``EXPORT`` keyword generates and installs a CMake file containing code to import all targets listed in the install command from the installation tree. So let's go ahead and explicitly ``EXPORT`` the MathFunctions library by updating the ``install`` command in ``MathFunctions/CMakeLists.txt`` to look like:
it: Il primo passo è aggiornare i comandi :command:`install(TARGETS)` per specificare non solo una ``DESTINATION`` ma anche una ``EXPORT``. La parola chiave ``EXPORT`` genera e installa un file CMake contenente il codice per importare tutti i target elencati nel comando install dall'albero di installazione. Quindi andiamo avanti con un ``EXPORT`` esplicito della libreria MathFunctions aggiornando il comando ``install`` in ``MathFunctions/CMakeLists.txt`` in modo che assomigli a:

source: Now that we have MathFunctions being exported, we also need to explicitly install the generated ``MathFunctionsTargets.cmake`` file. This is done by adding the following to the bottom of the top-level ``CMakeLists.txt``:
it: Ora che abbiamo esportato MathFunctions, dobbiamo anche installare esplicitamente il file ``MathFunctionsTargets.cmake`` generato. Questo viene fatto aggiungendo quanto segue in fondo al file ``CMakeLists.txt`` di livello superiore:

source: At this point you should try and run CMake. If everything is setup properly you will see that CMake will generate an error that looks like:
it: A questo punto dovrebbe provare ad eseguire CMake. Se tutto è configurato correttamente, CMake genererà un errore simile a:

source: What CMake is trying to say is that during generating the export information it will export a path that is intrinsically tied to the current machine and will not be valid on other machines. The solution to this is to update the MathFunctions :command:`target_include_directories` to understand that it needs different ``INTERFACE`` locations when being used from within the build directory and from an install / package. This means converting the :command:`target_include_directories` call for MathFunctions to look like:
it: Ciò che CMake sta cercando di dire è che nella generazione delle informazioni di esportazione ci sarà un percorso che è intrinsecamente legato alla macchina corrente e non sarà valido su altre macchine. La soluzione a questo è aggiornare :command:`target_include_directories` di MathFunctions per comprendere che necessita di posizioni ``INTERFACE`` diverse quando viene utilizzato dalla directory di build e da un pacchetto/installazione. Ciò significa convertire la chiamata :command:`target_include_directories` per MathFunctions in modo che assomigli a:

source: Once this has been updated, we can re-run CMake and verify that it doesn't warn anymore.
it: Una volta aggiornato, possiamo eseguire nuovamente CMake e verificare che non emetta più dei warning.

source: At this point, we have CMake properly packaging the target information that is required but we will still need to generate a ``MathFunctionsConfig.cmake`` so that the CMake :command:`find_package` command can find our project. So let's go ahead and add a new file to the top-level of the project called ``Config.cmake.in`` with the following contents:
it: A questo punto, abbiamo CMake che impacchetta correttamente le informazioni del target richieste, ma dovremo comunque generare un ``MathFunctionsConfig.cmake`` in modo che il comando CMake :command:`find_package` possa trovare il progetto. Andiamo quindi avanti e aggiungiamo un nuovo file al livello più alto del progetto chiamato ``Config.cmake.in`` col seguente contenuto:

source: Then, to properly configure and install that file, add the following to the bottom of the top-level ``CMakeLists.txt``:
it: Quindi, per configurare e installare correttamente il file, si aggiunge quanto segue in fondo al file ``CMakeLists.txt`` di livello superiore:

source: At this point, we have generated a relocatable CMake Configuration for our project that can be used after the project has been installed or packaged. If we want our project to also be used from a build directory we only have to add the following to the bottom of the top level ``CMakeLists.txt``:
it: A questo punto, abbiamo generato una configurazione CMake rilocabile per il progetto utilizzabile dopo che il progetto è stato installato o inserito in un pacchetto. Se vogliamo che il progetto venga utilizzato anche da una directory di build dobbiamo solo aggiungere quanto segue in fondo al ``CMakeLists.txt`` del livello superiore:

source: With this export call we now generate a ``Targets.cmake``, allowing the configured ``MathFunctionsConfig.cmake`` in the build directory to be used by other projects, without needing it to be installed.
it: Con questa chiamata di esportazione ora generiamo un ``Targets.cmake``, consentendo al ``MathFunctionsConfig.cmake`` configurato nella directory build di essere utilizzato da altri progetti, senza bisogno che sia installato.

source: Packaging Debug and Release (Step 12)
it: Packaging di Debug e Release (Step 12)

source: **Note:** This example is valid for single-configuration generators and will not work for multi-configuration generators (e.g. Visual Studio).
it: **Nota:** Questo esempio è valido per generatori a configurazione singola e non funzionerà per generatori a configurazione multipla (ad esempio Visual Studio).

source: By default, CMake's model is that a build directory only contains a single configuration, be it Debug, Release, MinSizeRel, or RelWithDebInfo. It is possible, however, to setup CPack to bundle multiple build directories and construct a package that contains multiple configurations of the same project.
it: Per default, il modello di CMake prevede che una directory di build contenga solo una singola configurazione, che si tratti di Debug, Release, MinSizeRel o RelWithDebInfo. È possibile, tuttavia, configurare CPack per raggruppare più directory di build e costruire un pacchetto che contenga più configurazioni dello stesso progetto.

source: First, we want to ensure that the debug and release builds use different names for the executables and libraries that will be installed. Let's use `d` as the postfix for the debug executable and libraries.
it: Innanzitutto, vogliamo garantire che le build di debug e di release utilizzino nomi diversi per gli eseguibili e le librerie che verranno installate. Usiamo `d` come suffisso per l'eseguibile e le librerie di debug.

source: Set :variable:`CMAKE_DEBUG_POSTFIX` near the beginning of the top-level ``CMakeLists.txt`` file:
it: Si setta :variable:`CMAKE_DEBUG_POSTFIX` vicino all'inizio del file ``CMakeLists.txt`` di livello superiore:

source: And the :prop_tgt:`DEBUG_POSTFIX` property on the tutorial executable:
it: E la proprietà :prop_tgt:`DEBUG_POSTFIX` sull'eseguibile del tutorial:

source: Let's also add version numbering to the MathFunctions library. In ``MathFunctions/CMakeLists.txt``, set the :prop_tgt:`VERSION` and :prop_tgt:`SOVERSION` properties:
it: Aggiungiamo anche la numerazione delle versioni alla libreria MathFunctions. In ``MathFunctions/CMakeLists.txt``, si impostano le proprietà :prop_tgt:`VERSION` e :prop_tgt:`SOVERSION`:

source: From the ``Step12`` directory, create ``debug`` and ``release`` subbdirectories. The layout will look like:
it: Dalla directory ``Step12``, creare le sottodirectory ``debug`` e ``release``. Il layout sarà simile a:

source: Now we need to setup debug and release builds. We can use :variable:`CMAKE_BUILD_TYPE` to set the configuration type:
it: Ora dobbiamo impostare la build di debug e quella di release. Possiamo usare :variable:`CMAKE_BUILD_TYPE` per impostare il tipo di configurazione:

source: Now that both the debug and release builds are complete, we can use a custom configuration file to package both builds into a single release. In the ``Step12`` directory, create a file called ``MultiCPackConfig.cmake``. In this file, first include the default configuration file that was created by the :manual:`cmake <cmake(1)>` executable.
it: Ora che sia la build di debug che quella di release sono complete, possiamo utilizzare un file di configurazione personalizzato per comprimere entrambe le build in un'unica versione. Nella directory ``Step12``, creare un file chiamato ``MultiCPackConfig.cmake``. In questo file, si include innanzitutto il file di configurazione di default creato dall'eseguibile :manual:`cmake <cmake(1)>`.

source: Next, use the ``CPACK_INSTALL_CMAKE_PROJECTS`` variable to specify which projects to install. In this case, we want to install both debug and release.
it: Successivamente, si utilizza la variabile ``CPACK_INSTALL_CMAKE_PROJECTS`` per specificare quali progetti installare. In questo caso, vogliamo installare sia debug che release.

source: From the ``Step12`` directory, run :manual:`cpack <cpack(1)>` specifying our custom configuration file with the ``config`` option:
it: Dalla directory ``Step12``, si esegue :manual:`cpack <cpack(1)>` specificando il file di configurazione personalizzato con l'opzione ``config``:

source: User Interaction Guide
it: Guida all'Interazione con l'Utente

source: Where a software package supplies a CMake-based buildsystem with the source of their software, the consumer of the software is required to run a CMake user interaction tool in order to build it.
it: Laddove un pacchetto software fornisce un sistema di build basato su CMake col sorgente del software, il consumatore del software è tenuto a eseguire uno strumento di interazione con l'utente CMake per buildare.
