Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: Then, in the same file, make ``USE_MYMATH`` control which square root function is used:
it: Quindi, nello stesso file, si fa in modo che ``USE_MYMATH`` controlli quale funzione di radice quadrata utilizzare:

source: Since the source code now requires ``USE_MYMATH`` we can add it to ``TutorialConfig.h.in`` with the following line:
it: Dato che il codice sorgente ora richiede ``USE_MYMATH`` possiamo aggiungerlo a ``TutorialConfig.h.in`` con la seguente riga:

source: **Exercise**: Why is it important that we configure ``TutorialConfig.h.in`` after the option for ``USE_MYMATH``? What would happen if we inverted the two?
it: **Esercizio**: Perché è importante configurare ``TutorialConfig.h.in`` dopo l'opzione per ``USE_MYMATH``? Cosa accadrebbe se invertissimo le due cose?

source: Run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool. Then run the built Tutorial executable.
it: Eseguire l'eseguibile :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto e quindi crearlo con lo strumento di build scelto. Eseguire poi il Tutorial buildato.

source: Now let's update the value of ``USE_MYMATH``. The easiest way is to use the :manual:`cmake-gui <cmake-gui(1)>` or :manual:`ccmake <ccmake(1)>` if you're in the terminal. Or, alternatively, if you want to change the option from the command-line, try:
it: Ora aggiorniamo il valore di ``USE_MYMATH``. Il modo più semplice è usare :manual:`cmake-gui <cmake-gui(1)>` o :manual:`ccmake <ccmake(1)>` se si sta nel terminale. Oppure, in alternativa, per modificare l'opzione da riga di comando, provare:

source: Rebuild and run the tutorial again.
it: Re-buildare ed eseguire nuovamente il tutorial.

source: Which function gives better results, sqrt or mysqrt?
it: Quale funzione dà risultati migliori, sqrt o mysqrt?

source: Adding Usage Requirements for Library (Step 3)
it: Aggiunta dei Requisiti di Utilizzo per la Libreria (Step 3)

source: Usage requirements allow for far better control over a library or executable's link and include line while also giving more control over the transitive property of targets inside CMake. The primary commands that leverage usage requirements are:
it: I requisiti di utilizzo consentono un controllo molto migliore sul link di una libreria o di un eseguibile e sulla riga di include, fornendo allo stesso tempo un maggiore controllo sulla proprietà transitiva dei target all'interno di CMake. I comandi principali che sfruttano i requisiti di utilizzo sono:

source: Let's refactor our code from `Adding a Library (Step 2)`_ to use the modern CMake approach of usage requirements. We first state that anybody linking to MathFunctions needs to include the current source directory, while MathFunctions itself doesn't. So this can become an ``INTERFACE`` usage requirement.
it: Effettuiamo il refactoring del codice da `Aggiunta di una libreria (Step 2)`_ per utilizzare il moderno approccio CMake dei requisiti di utilizzo. Per prima cosa affermiamo che chiunque effettui il link a MathFunctions deve includere la directory corrente dei sorgenti, mentre lo stesso MathFunctions non lo fa. Quindi questo può diventare un requisito di utilizzo dell'``INTERFACCIA``.

source: Remember ``INTERFACE`` means things that consumers require but the producer doesn't. Add the following lines to the end of ``MathFunctions/CMakeLists.txt``:
it: §Da ricordare che ``INTERFACCIA`` significa cose che i "consumer" richiedono ma il produttore no. Aggiungere le seguenti righe alla fine di ``MathFunctions/CMakeLists.txt``:

source: Now that we've specified usage requirements for MathFunctions we can safely remove our uses of the ``EXTRA_INCLUDES`` variable from the top-level ``CMakeLists.txt``, here:
it: Ora che abbiamo specificato i requisiti di utilizzo per MathFunctions possiamo rimuovere in sicurezza gli usi della variabile ``EXTRA_INCLUDES`` dal ``CMakeLists.txt`` del livello superiore, qui:

source: And here:
it: E qui:

source: Once this is done, run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool or by using ``cmake --build .`` from the build directory.
it: Fatto ciò, eseguire :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto e quindi crearlo con la build scelta o utilizzando ``cmake --build .`` dalla directory build.

source: Installing and Testing (Step 4)
it: Installazione e Test (Step 4)

source: Now we can start adding install rules and testing support to our project.
it: Ora possiamo iniziare ad aggiungere regole di installazione e testare il supporto al progetto.

source: Install Rules
it: Regole di Installazione

source: The install rules are fairly simple: for MathFunctions we want to install the library and header file and for the application we want to install the executable and configured header.
it: Le regole di installazione sono abbastanza semplici: per MathFunctions vogliamo installare la libreria e il file header e per l'applicazione vogliamo installare l'eader eseguibile e configurato.

source: So to the end of ``MathFunctions/CMakeLists.txt`` we add:
it: Quindi alla fine di ``MathFunctions/CMakeLists.txt`` aggiungiamo:

source: And to the end of the top-level ``CMakeLists.txt`` we add:
it: E alla fine del ``CMakeLists.txt`` di livello superiore aggiungiamo:

source: That is all that is needed to create a basic local install of the tutorial.
it: Questo è tutto ciò che serve per creare un'installazione locale di base del tutorial.

source: Now run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool.
it: Ora eseguire :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto e quindi crearlo col tool di build scelto.

source: Then run the install step by using the ``install`` option of the :manual:`cmake <cmake(1)>` command (introduced in 3.15, older versions of CMake must use ``make install``) from the command line. For multi-configuration tools, don't forget to use the ``--config`` argument to specify the configuration. If using an IDE, simply build the ``INSTALL`` target. This step will install the appropriate header files, libraries, and executables. For example:
it: Quindi esegui lo step di installazione utilizzando l'opzione ``install`` del comando :manual:`cmake <cmake(1)>` (introdotto nella versione 3.15, le versioni precedenti di CMake devono utilizzare ``make install``) dalla riga di comando. Per gli strumenti multi-configurazione, non dimenticare di utilizzare l'argomento ``--config`` per specificare la configurazione. Se si utilizza un IDE, creare semplicemente il target ``INSTALL``. Questo passaggio installerà i file header, le librerie e gli eseguibili appropriati. Per esempio:

source: The CMake variable :variable:`CMAKE_INSTALL_PREFIX` is used to determine the root of where the files will be installed. If using the ``cmake --install`` command, the installation prefix can be overridden via the ``--prefix`` argument. For example:
it: La variabile CMake :variable:`CMAKE_INSTALL_PREFIX` viene utilizzata per determinare la root in cui verranno installati i file. Se si usa il comando ``cmake --install``, il prefisso di installazione può essere sovrascritto tramite l'argomento ``--prefix``. Per esempio:

source: Navigate to the install directory and verify that the installed Tutorial runs.
it: Passare alla directory di installazione e verificare che il Tutorial installato venga eseguito.

source: Testing Support
it: Supporto per i Test

source: Next let's test our application. At the end of the top-level ``CMakeLists.txt`` file we can enable testing and then add a number of basic tests to verify that the application is working correctly.
it: Successivamente testiamo l'applicazione. Alla fine del file ``CMakeLists.txt`` di livello superiore possiamo abilitare il test e quindi aggiungere una serie di test di base per verificare che l'applicazione funzioni correttamente.

source: The first test simply verifies that the application runs, does not segfault or otherwise crash, and has a zero return value. This is the basic form of a CTest test.
it: Il primo test verifica semplicemente che l'applicazione venga eseguita, non subisca segfault o si blocchi in altro modo e abbia un valore di ritorno pari a zero. Questa è la forma base di un test CTest.

source: The next test makes use of the :prop_test:`PASS_REGULAR_EXPRESSION` test property to verify that the output of the test contains certain strings. In this case, verifying that the usage message is printed when an incorrect number of arguments are provided.
it: Il test successivo utilizza la proprietà di test :prop_test:`PASS_REGULAR_EXPRESSION` per verificare che l'output del test contenga determinate stringhe. In questo caso, verificare che il messaggio di utilizzo venga stampato quando viene fornito un numero errato di argomenti.

source: Lastly, we have a function called ``do_test`` that runs the application and verifies that the computed square root is correct for given input. For each invocation of ``do_test``, another test is added to the project with a name, input, and expected results based on the passed arguments.
it: Infine, abbiamo una funzione chiamata ``do_test`` che esegue l'applicazione e verifica che la radice quadrata calcolata sia corretta per un dato input. Per ogni invocazione di ``do_test``, un altro test viene aggiunto al progetto con un nome, input e risultati attesi in base agli argomenti passati.

source: Rebuild the application and then cd to the binary directory and run the :manual:`ctest <ctest(1)>` executable: ``ctest -N`` and ``ctest -VV``. For multi-config generators (e.g. Visual Studio), the configuration type must be specified. To run tests in Debug mode, for example, use ``ctest -C Debug -VV`` from the build directory (not the Debug subdirectory!). Alternatively, build the ``RUN_TESTS`` target from the IDE.
it: Ri-eseguire la build dell'applicazione e passare alla directory binaria e lanciare l'eseguibile di :manual:`ctest <ctest(1)>`: ``ctest -N`` e ``ctest -VV``. Per i generatori multi-config (ad esempio Visual Studio), è necessario specificare il tipo di configurazione. Per eseguire test in modalità Debug, ad esempio, utilizzare ``ctest -C Debug -VV`` dalla directory build (non dalla sottodirectory Debug!). In alternativa, creare il target ``RUN_TESTS`` dall'IDE.

source: Adding System Introspection (Step 5)
it: Aggiungere l'Introspezione del Sistema (Step 5)

source: Let us consider adding some code to our project that depends on features the target platform may not have. For this example, we will add some code that depends on whether or not the target platform has the ``log`` and ``exp`` functions. Of course almost every platform has these functions but for this tutorial assume that they are not common.
it: Consideriamo di aggiungere del codice al progetto che dipende dalle funzionalità che la piattaforma target potrebbe non avere. Per questo esempio, aggiungeremo del codice che dipende dal fatto che la piattaforma target abbia o meno le funzioni ``log`` e ``exp``. Naturalmente quasi tutte le piattaforme hanno queste funzioni, ma per questo tutorial supponiamo che non siano comuni.

source: If the platform has ``log`` and ``exp`` then we will use them to compute the square root in the ``mysqrt`` function. We first test for the availability of these functions using the :module:`CheckSymbolExists` module in ``MathFunctions/CMakeLists.txt``. On some platforms, we will need to link to the m library. If ``log`` and ``exp`` are not initially found, require the m library and try again.
it: Se la piattaforma ha ``log`` e ``exp`` li useremo per calcolare la radice quadrata nella funzione ``mysqrt``. Per prima cosa testiamo la disponibilità di queste funzioni utilizzando il modulo :module:`CheckSymbolExists` in ``MathFunctions/CMakeLists.txt``. Su alcune piattaforme dovremo linkare la libreria m. Se inizialmente non vengono trovati ``log`` e ``exp``, richiede la libreria m e riprova.

source: If available, use :command:`target_compile_definitions` to specify ``HAVE_LOG`` and ``HAVE_EXP`` as ``PRIVATE`` compile definitions.
it: Se disponibile, si usa :command:`target_compile_definitions` per specificare ``HAVE_LOG`` and ``HAVE_EXP`` come definizioni di compilazione ``PRIVATE``.

source: If ``log`` and ``exp`` are available on the system, then we will use them to compute the square root in the ``mysqrt`` function. Add the following code to the ``mysqrt`` function in ``MathFunctions/mysqrt.cxx`` (don't forget the ``#endif`` before returning the result!):
it: Se nel sistema sono disponibili ``log`` e ``exp``, li utilizzeremo per calcolare la radice quadrata nella funzione ``mysqrt``. Si aggiunge il seguente codice alla funzione ``mysqrt`` in ``MathFunctions/mysqrt.cxx`` (da non dimenticare ``#endif`` prima di restituire il risultato!):

source: We will also need to modify ``mysqrt.cxx`` to include ``cmath``.
it: Dovremo anche modificare ``mysqrt.cxx`` per includere ``cmath``.

source: Run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool and run the Tutorial executable.
it: Lanciare l'eseguibile :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto, poi lo si crea col strumento di creazione stool di build e si esegue il tutorial.

source: Which function gives better results now, sqrt or mysqrt?
it: Quale funzione dà risultati migliori ora, sqrt o mysqrt?

source: Adding a Custom Command and Generated File (Step 6)
it: Aggiunta di un Comando Personalizzato e di un File Generato (Step 6)

source: Suppose, for the purpose of this tutorial, we decide that we never want to use the platform ``log`` and ``exp`` functions and instead would like to generate a table of precomputed values to use in the ``mysqrt`` function. In this section, we will create the table as part of the build process, and then compile that table into our application.
it: Supponiamo, ai fini di questo tutorial, di decidere di non voler mai utilizzare le funzioni ``log`` e ``exp`` della piattaforma e di voler invece generare una tabella di valori precalcolati da utilizzare in ``mysqrt``. In questa sezione creeremo la tabella come parte del processo di build, poi compileremo la tabella nell'applicazione.

source: First, let's remove the check for the ``log`` and ``exp`` functions in ``MathFunctions/CMakeLists.txt``. Then remove the check for ``HAVE_LOG`` and ``HAVE_EXP`` from ``mysqrt.cxx``. At the same time, we can remove :code:`#include <cmath>`.
it: Innanzitutto, rimuoviamo il controllo per le funzioni ``log`` e ``exp`` in ``MathFunctions/CMakeLists.txt``. Quindi si rimuove il controllo per ``HAVE_LOG`` e ``HAVE_EXP`` da ``mysqrt.cxx``. Allo stesso tempo, possiamo rimuovere :code:`#include <cmath>`.

source: In the ``MathFunctions`` subdirectory, a new source file named ``MakeTable.cxx`` has been provided to generate the table.
it: Nella sottodirectory ``MathFunctions`` è stato fornito un nuovo file sorgente denominato ``MakeTable.cxx`` per generare la tabella.

source: After reviewing the file, we can see that the table is produced as valid C++ code and that the output filename is passed in as an argument.
it: Dall'esame del file, si vede che la tabella viene prodotta come codice C++ valido e che il nome del file di output viene passato come argomento.

source: The next step is to add the appropriate commands to the ``MathFunctions/CMakeLists.txt`` file to build the MakeTable executable and then run it as part of the build process. A few commands are needed to accomplish this.
it: Il passo successivo è quello di aggiungere i comandi appropriati al file ``MathFunctions/CMakeLists.txt`` per creare l'eseguibile MakeTable per poi eseguirlo come parte del processo di build. Per eseguire questa operazione sono necessari alcuni comandi.

source: First, at the top of ``MathFunctions/CMakeLists.txt``, the executable for ``MakeTable`` is added as any other executable would be added.
it: Innanzitutto, nella parte superiore di ``MathFunctions/CMakeLists.txt``, viene aggiunto l'eseguibile per ``MakeTable`` così come verrebbe aggiunto qualsiasi altro eseguibile.

source: Then we add a custom command that specifies how to produce ``Table.h`` by running MakeTable.
it: Quindi aggiungiamo un comando personalizzato che specifica come produrre ``Table.h`` eseguendo MakeTable.

source: Next we have to let CMake know that ``mysqrt.cxx`` depends on the generated file ``Table.h``. This is done by adding the generated ``Table.h`` to the list of sources for the library MathFunctions.
it: Successivamente dobbiamo far sapere a CMake che ``mysqrt.cxx`` dipende dal file generato ``Table.h``. Questo viene fatto aggiungendo il file ``Table.h`` generato all'elenco dei sorgenti per la libreria MathFunctions.

source: We also have to add the current binary directory to the list of include directories so that ``Table.h`` can be found and included by ``mysqrt.cxx``.
it: Dobbiamo anche aggiungere la directory binaria corrente all'elenco delle directory di inclusione in modo che ``Table.h`` sia raggiungibile da ``mysqrt.cxx``.

source: Now let's use the generated table. First, modify ``mysqrt.cxx`` to include ``Table.h``. Next, we can rewrite the mysqrt function to use the table:
it: Ora utilizziamo la tabella generata. Innanzitutto, si modifica ``mysqrt.cxx`` per includere ``Table.h``. Successivamente, possiamo riscrivere la funzione mysqrt per utilizzare la tabella:

source: Run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool.
it: Eseguire l'eseguibile :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto e quindi crearlo con lo strumento di build scelto.

source: When this project is built it will first build the ``MakeTable`` executable. It will then run ``MakeTable`` to produce ``Table.h``. Finally, it will compile ``mysqrt.cxx`` which includes ``Table.h`` to produce the MathFunctions library.
it: Con la build di questo progetto, verrà prima creato l'eseguibile ``MakeTable``. Verrà poi eseguito ``MakeTable`` per produrre ``Table.h``. Infine, si compilerà ``mysqrt.cxx`` che include ``Table.h`` per produrre la libreria MathFunctions.

source: Run the Tutorial executable and verify that it is using the table.
it: Lanciare l'eseguibile del tutorial e verificare che utilizzi la tabella.

source: Building an Installer (Step 7)
it: Creazione di un Programma di Installazione (Step 7)

source: Next suppose that we want to distribute our project to other people so that they can use it. We want to provide both binary and source distributions on a variety of platforms. This is a little different from the install we did previously in `Installing and Testing (Step 4)`_ , where we were installing the binaries that we had built from the source code. In this example we will be building installation packages that support binary installations and package management features. To accomplish this we will use CPack to create platform specific installers. Specifically we need to add a few lines to the bottom of our top-level ``CMakeLists.txt`` file.
it: Supponiamo ora di voler distribuire il nostro progetto ad altre persone in modo che possano usarlo. Vogliamo fornire distribuzioni sia binarie che sorgenti su una varietà di piattaforme. Questo è un po' diverso dall'installazione fatta in precedenza in `Installazione e Test (Step 4)`_ , dove stavamo installando i binari creati dal codice sorgente. In questo esempio creeremo pacchetti di installazione che supportano installazioni binarie e funzionalità di gestione dei pacchetti. Per raggiungere questo obiettivo utilizzeremo CPack per creare programmi di installazione specifici della piattaforma. Nello specifico dobbiamo aggiungere alcune righe alla fine del nostro file ``CMakeLists.txt`` di livello superiore.

source: That is all there is to it. We start by including :module:`InstallRequiredSystemLibraries`. This module will include any runtime libraries that are needed by the project for the current platform. Next we set some CPack variables to where we have stored the license and version information for this project. The version information was set earlier in this tutorial and the ``license.txt`` has been included in the top-level source directory for this step.
it: Questo è tutto. Iniziamo includendo :module:`InstallRequiredSystemLibraries`. Questo modulo includerà tutte le librerie runtime necessarie al progetto per la piattaforma corrente. Successivamente impostiamo alcune variabili CPack in cui abbiamo archiviato le informazioni sulla licenza e sulla versione per questo progetto. Le informazioni sulla versione sono state impostate in precedenza in questo tutorial e il file ``license.txt`` è stato incluso nella directory dei sorgenti di livello superiore per questo step.

source: Finally we include the :module:`CPack module <CPack>` which will use these variables and some other properties of the current system to setup an installer.
it: Infine includiamo :module:`CPack module <CPack>` che utilizzerà queste variabili e alcune altre proprietà del sistema corrente per impostare un programma di installazione.

source: The next step is to build the project in the usual manner and then run the :manual:`cpack <cpack(1)>` executable. To build a binary distribution, from the binary directory run:
it: Il passo successivo è creare il progetto nel solito modo e poi lanciare l'eseguibile :manual:`cpack <cpack(1)>`. Per creare una distribuzione binaria, dalla directory binaria eseguire:

source: To specify the generator, use the ``-G`` option. For multi-config builds, use ``-C`` to specify the configuration. For example:
it: Per specificare il generatore, utilizzare l'opzione ``-G``. Per build multi-configurazione, utilizzare ``-C`` per specificare la configurazione. Per esempio:

source: To create a source distribution you would type:
it: Per creare una distribuzione sorgente si deve digitare:

source: Alternatively, run ``make package`` or right click the ``Package`` target and ``Build Project`` from an IDE.
it: In alternativa, eseguire ``make package`` o click destro sul target ``Package`` e ``Build Project`` dall'IDE.

source: Run the installer found in the binary directory. Then run the installed executable and verify that it works.
it: Eseguire il programma di installazione trovato nella directory binaria. Lanciare poi l'eseguibile installato e verificare che funzioni.

source: Adding Support for a Dashboard (Step 8)
it: Aggiungere il Supporto per una Dashboard (Step 8)

source: Adding support for submitting our test results to a dashboard is simple. We already defined a number of tests for our project in `Testing Support`_. Now we just have to run those tests and submit them to a dashboard. To include support for dashboards we include the :module:`CTest` module in our top-level ``CMakeLists.txt``.
it: Aggiungere il supporto per inviare i risultati dei nostri test a una dashboard è semplice. Abbiamo già definito una serie di test per il nostro progetto in `Supporto per i Test`_. Ora non ci resta che eseguire questi test e inviarli a una dashboard. Per aggiungere il supporto per la dashboard includiamo il modulo :module:`CTest` nel ``CMakeLists.txt`` di livello superiore.

source: Replace:
it: Sostituire:

source: With:
it: Con:
