Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: Create a library called ``MathFunctions`` with the :command:`add_library` command:
it: Si crea una libreria chiamata ``MathFunctions`` col comando :command:`add_library`:

source: And then use the :command:`target_include_directories` command to specify the include directories for the target:
it: Poi si usa il comando :command:`target_include_directories` per specificare le directory di inclusione per il target:

source: We need to tell CMake that we want to use different include directories depending on if we're building the library or using it from an installed location. If we don't do this, when CMake creates the export information it will export a path that is specific to the current build directory and will not be valid for other projects. We can use :manual:`generator expressions <cmake-generator-expressions(7)>` to specify that if we're building the library include the current source directory. Otherwise, when installed, include the ``include`` directory. See the `Creating Relocatable Packages`_ section for more details.
it: Dobbiamo dire a CMake che vogliamo utilizzare directory di inclusione diverse a seconda che stiamo costruendo la libreria o utilizzandola da una posizione installata. Se non lo facciamo, quando CMake crea le informazioni di esportazione esporterà un percorso specifico per la directory di build corrente e non sarà valido per altri progetti. Possiamo usare :manual:`generator expressions <cmake-generator-expressions(7)>` per specificare che se stiamo "buildando" la libreria deve includere la directory sorgente corrente. Altrimenti, una volta installato, include la directory ``include``. Consultare la sezione `Creazione di Pacchetti Rilocabili`_ per maggiori dettagli.

source: The :command:`install(TARGETS)` and :command:`install(EXPORT)` commands work together to install both targets (a library in our case) and a CMake file designed to make it easy to import the targets into another CMake project.
it: I comandi :command:`install(TARGETS)` e :command:`install(EXPORT)` lavorano insieme per installare entrambi i target (una libreria nel nostro caso) e un file CMake progettato per semplificare l'importazione dei target in un altro progetto CMake.

source: First, in the :command:`install(TARGETS)` command we will specify the target, the ``EXPORT`` name and the destinations that tell CMake where to install the targets.
it: Innanzitutto, nel comando :command:`install(TARGETS)` specificheremo il target, il nome ``EXPORT`` e le destinazioni che indicano a CMake dove installare i target.

source: Here, the ``EXPORT`` option tells CMake to create an export called ``MathFunctionsTargets``. The generated :prop_tgt:`IMPORTED` targets have appropriate properties set to define their :ref:`usage requirements <Target Usage Requirements>`, such as :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES`, :prop_tgt:`INTERFACE_COMPILE_DEFINITIONS` and other relevant built-in ``INTERFACE_`` properties. The ``INTERFACE`` variant of user-defined properties listed in :prop_tgt:`COMPATIBLE_INTERFACE_STRING` and other :ref:`Compatible Interface Properties` are also propagated to the generated :prop_tgt:`IMPORTED` targets. For example, in this case, the :prop_tgt:`IMPORTED` target will have its :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` property populated with the directory specified by the ``INCLUDES DESTINATION`` property. As a relative path was given, it is treated as relative to the :variable:`CMAKE_INSTALL_PREFIX`.
it: Qui, l'opzione ``EXPORT`` dice a CMake di creare un'esportazione chiamata ``MathFunctionsTargets``. I target :prop_tgt:`IMPORTED` generati hanno proprietà appropriate impostate per definire i loro :ref:`requisiti di utilizzo <Target Usage Requirements>`, come :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES`, :prop_tgt:`INTERFACE_COMPILE_DEFINITIONS` e altre rilevanti proprietà native [built-in] ``INTERFACE_``. La variante ``INTERFACE`` delle proprietà definite dall'utente elencate in :prop_tgt:`COMPATIBLE_INTERFACE_STRING` e altre :ref:`Compatible Interface Properties` vengono propagate anche ai target :prop_tgt:`IMPORTED` generati. Ad esempio, in questo caso, il target :prop_tgt:`IMPORTED` avrà la sua proprietà :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` popolata con la directory specificata dalla proprietà ``INCLUDES DESTINATION``. Poiché è stato fornito un percorso relativo, viene trattato come relativo a :variable:`CMAKE_INSTALL_PREFIX`.

source: Note, we have *not* asked CMake to install the export yet.
it: Notare, *non* abbiamo ancora chiesto a CMake di installare l'export.

source: We don't want to forget to install the ``MathFunctions.h`` header file with the :command:`install(FILES)` command. The header file should be installed to the ``include`` directory, as specified by the :command:`target_include_directories` command above.
it: Non vogliamo dimenticare di installare il file header ``MathFunctions.h`` col comando :command:`install(FILES)`. Il file di intestazione dovrebbe essere installato nella directory ``include``, come specificato dal comando :command:`target_include_directories` sopra.

source: Now that the ``MathFunctions`` library and header file are installed, we also need to explicitly install the ``MathFunctionsTargets`` export details. Use the :command:`install(EXPORT)` command to export the targets in ``MathFunctionsTargets``, as defined by the :command:`install(TARGETS)` command.
it: Ora che la libreria ``MathFunctions`` e il file header sono installati, dobbiamo anche installare esplicitamente i dettagli di esportazione di ``MathFunctionsTargets``. Utilizzare il comando :command:`install(EXPORT)` per esportare i target in ``MathFunctionsTargets``, come definito dal comando :command:`install(TARGETS)`.

source: This command generates the ``MathFunctionsTargets.cmake`` file and arranges to install it to ``lib/cmake``. The file contains code suitable for use by downstreams to import all targets listed in the install command from the installation tree.
it: Questo comando genera il file ``MathFunctionsTargets.cmake`` e provvede ad installarlo in ``lib/cmake``. Il file contiene codice utilizzabile dai downstream per importare tutti i target elencati nel comando install dall'albero di installazione.

source: The ``NAMESPACE`` option will prepend ``MathFunctions::`` to the target names as they are written to the export file. This convention of double-colons gives CMake a hint that the name is an :prop_tgt:`IMPORTED` target when it is used by downstream projects. This way, CMake can issue a diagnostic message if the package providing it was not found.
it: L'opzione ``NAMESPACE`` anteporrà ``MathFunctions::`` ai nomi dei target mentre vengono scritti nel file export. Questa convenzione dei doppi due-punti fornisce a CMake un suggerimento sul fatto che il nome è un target :prop_tgt:`IMPORTED` quando viene utilizzato dai progetti downstream. In questo modo, CMake può emettere un messaggio diagnostico se il pacchetto che lo fornisce non è stato trovato.

source: The generated export file contains code that creates an :prop_tgt:`IMPORTED` library.
it: Il file di esportazione generato contiene il codice che crea una libreria :prop_tgt:`IMPORTED`.

source: This code is very similar to the example we created by hand in the `Importing Libraries`_ section. Note that ``${_IMPORT_PREFIX}`` is computed relative to the file location.
it: Questo codice è molto simile all'esempio che abbiamo creato manualmente nella sezione `Importazione di Librerie`_. Notare che ``${_IMPORT_PREFIX}`` viene calcolato in relazione alla posizione del file.

source: An outside project may load this file with the :command:`include` command and reference the ``MathFunctions`` library from the installation tree as if it were built in its own tree. For example:
it: Un progetto esterno può caricare questo file col comando :command:`include` e fare riferimento alla libreria ``MathFunctions`` dall'albero di installazione come se fosse creata nel proprio albero. Per esempio:

source: Line 1 loads the target CMake file. Although we only exported a single target, this file may import any number of targets. Their locations are computed relative to the file location so that the install tree may be easily moved. Line 3 references the imported ``MathFunctions`` library. The resulting build system will link to the library from its installed location.
it: La riga 1 carica il file CMake del target. Anche se abbiamo esportato un solo target, questo file può importare un numero qualsiasi di target. Le loro posizioni vengono calcolate rispetto a quella del file in modo che l'albero di installazione possa essere facilmente spostato. La riga 3 fa riferimento alla libreria importata ``MathFunctions``. Il sistema di build risultante linkerà la libreria dalla posizione di installazione.

source: Executables may also be exported and imported using the same process.
it: Gli eseguibili possono anche essere esportati e importati utilizzando lo stesso processo.

source: Any number of target installations may be associated with the same export name. Export names are considered global so any directory may contribute a target installation. The :command:`install(EXPORT)` command only needs to be called once to install a file that references all targets. Below is an example of how multiple exports may be combined into a single export file, even if they are in different subdirectories of the project.
it: Allo stesso nome di esportazione può essere associato un numero qualsiasi di installazioni di target. I nomi di esportazione sono considerati globali, quindi qualsiasi directory può contribuire a un'installazione di un target. Il comando :command:`install(EXPORT)` deve essere chiamato solo una volta per installare un file che fa riferimento a tutti i target. Di seguito è riportato un esempio di come è possibile combinare più esportazioni in un unico file export, anche se si trovano in sottodirectory diverse del progetto.

source: Creating Packages
it: Creazione di Pacchetti

source: At this point, the ``MathFunctions`` project is exporting the target information required to be used by other projects. We can make this project even easier for other projects to use by generating a configuration file so that the CMake :command:`find_package` command can find our project.
it: A questo punto, il progetto ``MathFunctions`` sta esportando le informazioni richieste del target per essere utilizzate da altri progetti. Possiamo rendere questo progetto ancora più semplice da utilizzare per altri progetti generando un file di configurazione in modo che il comando CMake :command:`find_package` possa trovare il nostro progetto.

source: To start, we will need to make a few additions to the ``CMakeLists.txt`` file. First, include the :module:`CMakePackageConfigHelpers` module to get access to some helper functions for creating config files.
it: Per iniziare, dovremo fare alcune aggiunte al file ``CMakeLists.txt``. Innanzitutto, si include il modulo :module:`CMakePackageConfigHelpers` per ottenere l'accesso ad alcune funzioni di supporto per la creazione dei file di configurazione.

source: Then we will create a package configuration file and a package version file.
it: Poi creeremo un file di configurazione e un file della versione del pacchetto.

source: Creating a Package Configuration File
it: Creazione di un File di Configurazione del Pacchetto

source: Use the :command:`configure_package_config_file` command provided by the :module:`CMakePackageConfigHelpers` to generate the package configuration file. Note that this command should be used instead of the plain :command:`configure_file` command. It helps to ensure that the resulting package is relocatable by avoiding hardcoded paths in the installed configuration file. The path given to ``INSTALL_DESTINATION`` must be the destination where the ``MathFunctionsConfig.cmake`` file will be installed. We will examine the contents of the package configuration file in the next section.
it: Usare il comando :command:`configure_package_config_file` fornito da :module:`CMakePackageConfigHelpers` per generare il file di configurazione del pacchetto. Notare che questo comando dovrebbe essere usato al posto del semplice comando :command:`configure_file`. Aiuta a garantire che il pacchetto risultante sia riposizionabile evitando percorsi codificati nel file di configurazione installato. Il percorso fornito a ``INSTALL_DESTINATION`` deve essere la destinazione in cui verrà installato il file ``MathFunctionsConfig.cmake``. Esamineremo il contenuto del file di configurazione del pacchetto nella prossima sezione.

source: Install the generated configuration files with the :command:`INSTALL(files)` command. Both ``MathFunctionsConfigVersion.cmake`` and ``MathFunctionsConfig.cmake`` are installed to the same location, completing the package.
it: Installare i file di configurazione generati col comando :command:`INSTALL(files)`. Sia ``MathFunctionsConfigVersion.cmake`` che ``MathFunctionsConfig.cmake`` sono installati nella stessa posizione, completando il pacchetto.

source: Now we need to create the package configuration file itself. In this case, the ``Config.cmake.in`` file is very simple but sufficient to allow downstreams to use the :prop_tgt:`IMPORTED` targets.
it: Ora dobbiamo creare il file di configurazione del pacchetto stesso. In questo caso, il file ``Config.cmake.in`` è molto semplice ma sufficiente per consentire ai downstream di utilizzare i target :prop_tgt:`IMPORTED`.

source: The first line of the file contains only the string ``@PACKAGE_INIT@``. This expands when the file is configured and allows the use of relocatable paths prefixed with ``PACKAGE_``. It also provides the ``set_and_check()`` and ``check_required_components()`` macros.
it: La prima riga del file contiene solo la stringa ``@PACKAGE_INIT@``. Questo si espande quando il file viene configurato e consente l'uso di percorsi riposizionabili col prefisso ``PACKAGE_``. Fornisce inoltre le macro ``set_and_check()`` e ``check_required_components()``.

source: The ``check_required_components`` helper macro ensures that all requested, non-optional components have been found by checking the ``<Package>_<Component>_FOUND`` variables for all required components. This macro should be called at the end of the package configuration file even if the package does not have any components. This way, CMake can make sure that the downstream project hasn't specified any non-existent components. If ``check_required_components`` fails, the ``<Package>_FOUND`` variable is set to FALSE, and the package is considered to be not found.
it: La macro helper ``check_required_components`` garantisce che tutti i componenti richiesti e non opzionali siano stati trovati controllando le variabili ``<Package>_<Component>_FOUND`` per tutti i componenti richiesti. Questa macro dovrebbe essere richiamata alla fine del file di configurazione del pacchetto anche se il pacchetto non ha alcun componente. In questo modo, CMake può assicurarsi che il progetto downstream non abbia specificato componenti inesistenti. Se ``check_required_components`` fallisce, la variabile ``<Package>_FOUND`` viene impostata su FALSE e il pacchetto viene considerato non trovato.

source: The ``set_and_check()`` macro should be used in configuration files instead of the normal ``set()`` command for setting directories and file locations. If a referenced file or directory does not exist, the macro will fail.
it: La macro ``set_and_check()`` dovrebbe essere utilizzata nei file di configurazione invece del normale comando ``set()`` per impostare directory e posizioni dei file. Se un file o una directory a cui si fa riferimento non esiste, la macro fallirà.

source: If any macros should be provided by the ``MathFunctions`` package, they should be in a separate file which is installed to the same location as the ``MathFunctionsConfig.cmake`` file, and included from there.
it: Se delle macro devono essere fornite dal pacchetto ``MathFunctions``, dovrebbero trovarsi in un file separato installato nella stessa posizione del file ``MathFunctionsConfig.cmake`` e incluse da lì.

source: **All required dependencies of a package must also be found in the package configuration file.** Let's imagine that we require the ``Stats`` library in our project. In the CMakeLists file, we would add:
it: **Tutte le dipendenze richieste di un pacchetto si devono trovare anche nel file di configurazione del pacchetto**. Immaginiamo di aver bisogno della libreria ``Stats`` nel nostro progetto. Nel file CMakeLists, aggiungeremmo:

source: As the ``Stats::Types`` target is a ``PUBLIC`` dependency of ``MathFunctions``, downstreams must also find the ``Stats`` package and link to the ``Stats::Types`` library. The ``Stats`` package should be found in the configuration file to ensure this.
it: Dato che il target ``Stats::Types`` è una dipendenza ``PUBLIC`` di ``MathFunctions``, i downstream devono anche trovare il pacchetto ``Stats`` e linkarlo alla libreria ``Stats::Types``. Per garantire ciò, nel file di configurazione dovrebbe essere presente il pacchetto ``Stats``.

source: The ``find_dependency`` macro from the :module:`CMakeFindDependencyMacro` module helps by propagating whether the package is ``REQUIRED``, or ``QUIET``, etc. The ``find_dependency`` macro also sets ``MathFunctions_FOUND`` to ``False`` if the dependency is not found, along with a diagnostic that the ``MathFunctions`` package cannot be used without the ``Stats`` package.
it: La macro ``find_dependency`` dal modulo :module:`CMakeFindDependencyMacro` aiuta a propagare se il pacchetto è ``REQUIRED`` o ``QUIET``, ecc. La macro ``find_dependency`` imposta anche ``MathFunctions_FOUND`` a ``False`` se la dipendenza non viene trovata, insieme a una diagnostica che indica che il pacchetto ``MathFunctions`` non può essere utilizzato senza il pacchetto ``Stats``.

source: **Exercise:** Add a required library to the ``MathFunctions`` project.
it: **Esercizio:** Aggiungere la libreria richiesta al progetto``MathFunctions``.

source: Creating a Package Version File
it: Creazione di un File di Versione del Pacchetto

source: The :module:`CMakePackageConfigHelpers` module provides the :command:`write_basic_package_version_file` command for creating a simple package version file. This file is read by CMake when :command:`find_package` is called to determine the compatibility with the requested version, and to set some version-specific variables such as ``<PackageName>_VERSION``, ``<PackageName>_VERSION_MAJOR``, ``<PackageName>_VERSION_MINOR``, etc. See :manual:`cmake-packages <cmake-packages(7)>` documentation for more details.
it: Il modulo :module:`CMakePackageConfigHelpers` fornisce il comando :command:`write_basic_package_version_file` per creare un semplice file di versione del pacchetto. Questo file viene letto da CMake quando viene chiamato :command:`find_package` per determinare la compatibilità con la versione richiesta e per impostare alcune variabili specifiche della versione come ``<PackageName>_VERSION``, ``<PackageName>_VERSION_MAJOR``, ``<PackageName>_VERSION_MINOR``, ecc. Consultare la documentazione :manual:`cmake-packages <cmake-packages(7)>` per maggiori dettagli.

source: In our example, ``MathFunctions_MAJOR_VERSION`` is defined as a :prop_tgt:`COMPATIBLE_INTERFACE_STRING` which means that it must be compatible among the dependencies of any depender. By setting this custom defined user property in this version and in the next version of ``MathFunctions``, :manual:`cmake <cmake(1)>` will issue a diagnostic if there is an attempt to use version 3 together with version 4. Packages can choose to employ such a pattern if different major versions of the package are designed to be incompatible.
it: Nel nostro esempio, ``MathFunctions_MAJOR_VERSION`` è definito come una :prop_tgt:`COMPATIBLE_INTERFACE_STRING`, il che significa che deve essere compatibile con qualsiasi dipendenza. Impostando questa proprietà utente personalizzata in questa versione e nella prossima di ``MathFunctions``, :manual:`cmake <cmake(1)>` emetterà una diagnostica se si tenta di utilizzare la versione 3 insieme alla versione 4. I pacchetti possono scegliere di utilizzare tale modello se diverse versioni "major" del pacchetto sono progettate per essere incompatibili.

source: Exporting Targets from the Build Tree
it: Esportare i Target dall'albero di Build

source: Typically, projects are built and installed before being used by an outside project. However, in some cases, it is desirable to export targets directly from a build tree. The targets may then be used by an outside project that references the build tree with no installation involved. The :command:`export` command is used to generate a file exporting targets from a project build tree.
it: In genere, i progetti vengono creati e installati prima di essere utilizzati da un progetto esterno. Tuttavia, in alcuni casi, è preferibile esportare i target direttamente da un albero di build. I target possono quindi essere utilizzati da un progetto esterno che fa riferimento all'albero di build senza che sia coinvolta alcuna installazione. Il comando :command:`export` viene utilizzato per generare un file di export dei target da un albero di build del progetto.

source: If we want our example project to also be used from a build directory we only have to add the following to ``CMakeLists.txt``:
it: Per usare il progetto di esempio anche da una directory di build dobbiamo solo aggiungere quanto segue a ``CMakeLists.txt``:

source: Here we use the :command:`export` command to generate the export targets for the build tree. In this case, we'll create a file called ``MathFunctionsTargets.cmake`` in the ``cmake`` subdirectory of the build directory. The generated file contains the required code to import the target and may be loaded by an outside project that is aware of the project build tree. This file is specific to the build-tree, and **is not relocatable**.
it: Qui utilizziamo il comando :command:`export` per generare gli export dei target per l'albero di build. In questo caso, creeremo un file chiamato ``MathFunctionsTargets.cmake`` nella subdirectory ``cmake`` dellla directory di build. Il file generato contiene il codice richiesto per importare il target e può essere caricato da un progetto esterno che conosce l'albero di build del progetto. Questo file è specifico dell'albero di build **non è riposizionabile**.

source: It is possible to create a suitable package configuration file and package version file to define a package for the build tree which may be used without installation. Consumers of the build tree can simply ensure that the :variable:`CMAKE_PREFIX_PATH` contains the build directory, or set the ``MathFunctions_DIR`` to ``<build_dir>/MathFunctions`` in the cache.
it: È possibile creare un file di configurazione del pacchetto e uno di versione adatti per definire un pacchetto per l'albero di build utilizzabile senza installazione. Gli utenti dell'albero di build possono semplicemente assicurarsi che :variable:`CMAKE_PREFIX_PATH` contenga la directory di build o impostare ``MathFunctions_DIR`` a ``<build_dir>/MathFunctions`` nella cache.

source: An example application of this feature is for building an executable on a host platform when cross-compiling. The project containing the executable may be built on the host platform and then the project that is being cross-compiled for another platform may load it.
it: Un esempio di applicazione di questa funzionalità è la creazione di un eseguibile su una piattaforma host durante la cross-compilazione. Il progetto contenente l'eseguibile può essere creato sulla piattaforma host e quindi il progetto cross-compilato per un'altra piattaforma può caricarlo.

source: Building and Installing a Package
it: Creazione e Installazione di un Pacchetto
