Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/*/cmake.po
Languages: it

source: At this point, we have generated a relocatable CMake configuration for our project that can be used after the project has been installed. Let's try to build the ``MathFunctions`` project:
it: A questo punto, abbiamo generato una configurazione CMake rilocabile per il progetto utilizzabile dopo l'installazione del progetto. Proviamo a "buildare" il progetto ``MathFunctions``:

source: In the build directory, notice that the file ``MathFunctionsTargets.cmake`` has been created in the ``cmake`` subdirectory.
it: Nella directory di build, notare che il file ``MathFunctionsTargets.cmake`` è stato creato nella sottodirectory ``cmake``.

source: Now install the project:
it: Ora si installa il progetto:

source: Creating Relocatable Packages
it: Creazione di Pacchetti Rilocabili

source: Packages created by :command:`install(EXPORT)` are designed to be relocatable, using paths relative to the location of the package itself. They must not reference absolute paths of files on the machine where the package is built that will not exist on the machines where the package may be installed.
it: I pacchetti creati da :command:`install(EXPORT)` sono progettati per essere riposizionabili, utilizzando percorsi relativi alla posizione del pacchetto stesso. Non devono fare riferimento a path assoluti sulla macchina su cui è creato il pacchetto che non esisteranno sulle macchine su cui il pacchetto potrebbe essere installato.

source: When defining the interface of a target for ``EXPORT``, keep in mind that the include directories should be specified as relative paths to the :variable:`CMAKE_INSTALL_PREFIX` but should not explicitly include the :variable:`CMAKE_INSTALL_PREFIX`:
it: Quando si definisce l'interfaccia di un target per ``EXPORT``, tenere presente che le directory di inclusione devono essere specificate come percorsi relativi alla :variable:`CMAKE_INSTALL_PREFIX` ma non devono includere esplicitamente la :variable:`CMAKE_INSTALL_PREFIX`:

source: The ``$<INSTALL_PREFIX>`` :manual:`generator expression <cmake-generator-expressions(7)>` may be used as a placeholder for the install prefix without resulting in a non-relocatable package. This is necessary if complex generator expressions are used:
it: L'espressione ``$<INSTALL_PREFIX>`` del :manual:`generator expression <cmake-generator-expressions(7)>` è utilizzabile come segnaposto per il prefisso di installazione senza risultare in un pacchetto non riposizionabile. Ciò è necessario se si utilizzano "generator expression" complesse:

source: This also applies to paths referencing external dependencies. It is not advisable to populate any properties which may contain paths, such as :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` or :prop_tgt:`INTERFACE_LINK_LIBRARIES`, with paths relevant to dependencies. For example, this code may not work well for a relocatable package:
it: Questo vale anche per i percorsi che fanno riferimento a dipendenze esterne. Non è consigliabile popolare le proprietà che possono contenere percorsi, come :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` e :prop_tgt:`INTERFACE_LINK_LIBRARIES`, con percorsi relativi alle dipendenze. Ad esempio, questo codice potrebbe non funzionare bene per un pacchetto rilocabile:

source: The referenced variables may contain the absolute paths to libraries and include directories **as found on the machine the package was made on**. This would create a package with hard-coded paths to dependencies not suitable for relocation.
it: Le variabili di riferimento possono contenere i percorsi assoluti delle librerie e includere directory **come si trovano sulla macchina su cui è stato creato il pacchetto**. Ciò creerebbe un pacchetto con percorsi alle dipendenze "scolpiti" non adatti al riposizionamento.

source: Ideally such dependencies should be used through their own :ref:`IMPORTED targets <Imported Targets>` that have their own :prop_tgt:`IMPORTED_LOCATION` and usage requirement properties such as :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` populated appropriately. Those imported targets may then be used with the :command:`target_link_libraries` command for ``MathFunctions``:
it: Idealmente, tali dipendenze dovrebbero essere utilizzate attraverso i propri :ref:`target IMPORTED <Imported Targets>` che hanno le proprie :prop_tgt:`IMPORTED_LOCATION` e proprietà dei requisiti di utilizzo come :prop_tgt:`INTERFACE_INCLUDE_DIRECTORIES` popolate in modo appropriato. Questi target importati possono quindi essere utilizzati col comando :command:`target_link_libraries` per ``MathFunctions``:

source: With this approach the package references its external dependencies only through the names of :ref:`IMPORTED targets <Imported Targets>`. When a consumer uses the installed package, the consumer will run the appropriate :command:`find_package` commands (via the ``find_dependency`` macro described above) to find the dependencies and populate the imported targets with appropriate paths on their own machine.
it: Con questo approccio il pacchetto fa riferimento alle sue dipendenze esterne solo attraverso i nomi di :ref:`target IMPORTED <Imported Targets>`. Quando un "consumer" utilizza il pacchetto installato, eseguirà i comandi :command:`find_package` appropriati (tramite la macro ``find_dependency`` descritta sopra) per trovare le dipendenze e popolare i target importati con percorsi appropriati sul proprio computer.

source: Using the Package Configuration File
it: Utilizzo dei File di Configurazione del Pacchetto

source: Now we're ready to create a project to use the installed ``MathFunctions`` library. In this section we will be using source code from ``Help\guide\importing-exporting\Downstream``. In this directory, there is a source file called ``main.cc`` that uses the ``MathFunctions`` library to calculate the square root of a given number and then prints the results:
it: Ora siamo pronti per creare un progetto per utilizzare la libreria ``MathFunctions`` installata. In questa sezione utilizzeremo il codice sorgente da ``Help\guide\importing-exporting\Downstream``. In questa directory c'è un file sorgente chiamato ``main.cc`` che usa la libreria ``MathFunctions`` per calcolare la radice quadrata di un dato numero e poi stampa i risultati:

source: As before, we'll start with the :command:`cmake_minimum_required` and :command:`project` commands in the ``CMakeLists.txt`` file. For this project, we'll also specify the C++ standard.
it: Come prima, inizieremo coi comandi :command:`cmake_minimum_required` e :command:`project` nel file ``CMakeLists.txt``. Per questo progetto specificheremo anche lo standard del C++.

source: We can use the :command:`find_package` command:
it: Possiamo usare il comando :command:`find_package`:

source: Create an exectuable:
it: Creare un eseguibile:

source: And link to the ``MathFunctions`` library:
it: E linkarlo alla libreria ``MathFunctions``:

source: That's it! Now let's try to build the ``Downstream`` project.
it: Questo è tutto! Ora proviamo a buildare il progetto ``Downstream``.

source: A warning may have appeared during CMake configuration:
it: Potrebbe essere apparso un warning durante la configurazione di CMake:

source: Set the ``CMAKE_PREFIX_PATH`` to where MathFunctions was installed previously and try again. Ensure that the newly created executable runs as expected.
it: Impostare ``CMAKE_PREFIX_PATH`` sul punto in cui MathFunctions è stato installato in precedenza e riprovare. Assicurarsi che l'eseguibile appena creato venga eseguito come previsto.

source: Adding Components
it: Aggiungere Componenti

source: Let's edit the ``MathFunctions`` project to use components. The source code for this section can be found in ``Help\guide\importing-exporting\MathFunctionsComponents``. The CMakeLists file for this project adds two subdirectories: ``Addition`` and ``SquareRoot``.
it: Modifichiamo il progetto ``MathFunctions`` per utilizzare i componenti. Il codice sorgente di questa sezione si trova in ``Help\guide\importing-exporting\MathFunctionsComponents``. Il file CMakeLists per questo progetto aggiunge due sottodirectory: ``Addition`` e ``SquareRoot``.

source: Generate and install the package configuration and package version files:
it: Generare e installare i file di configurazione e di versione del pacchetto:

source: If ``COMPONENTS`` are specified when the downstream uses :command:`find_package`, they are listed in the ``<PackageName>_FIND_COMPONENTS`` variable. We can use this variable to verify that all necessary component targets are included in ``Config.cmake.in``. At the same time, this function will act as a custom ``check_required_components`` macro to ensure that the downstream only attempts to use supported components.
it: Se vengono specificati ``COMPONENTS`` quando il downstream utilizza :command:`find_package`, vengono elencati nella variabile ``<PackageName>_FIND_COMPONENTS``. Possiamo usare questa variabile per verificare che tutti i componenti target necessari siano inclusi in ``Config.cmake.in``. Allo stesso tempo, questa funzione agirà come una macro custom ``check_required_components`` per garantire che il downstream tenti di utilizzare solo i componenti supportati.

source: Here, the ``MathFunctions_NOT_FOUND_MESSAGE`` is set to a diagnosis that the package could not be found because an invalid component was specified. This message variable can be set for any case where the ``_FOUND`` variable is set to ``False``, and will be displayed to the user.
it: Qui, ``MathFunctions_NOT_FOUND_MESSAGE`` è settato su una diagnosi secondo cui il pacchetto non è stato trovato perché è stato specificato un componente non valido. Questa variabile del messaggio può essere impostata per ogni caso in cui la variabile ``_FOUND`` è settata a ``False`` e verrà visualizzata all'utente.

source: The ``Addition`` and ``SquareRoot`` directories are similar. Let's look at one of the CMakeLists files:
it: Le directory ``Addition`` e ``SquareRoot`` sono simili. Diamo un'occhiata a uno dei file CMakeLists:

source: Now we can build the project as described in earlier sections. To test using this package, we can use the project in ``Help\guide\importing-exporting\DownstreamComponents``. There's two differences from the previous ``Downstream`` project. First, we need to find the package components. Change the ``find_package`` line from:
it: Ora possiamo buildare il progetto come descritto nelle sezioni precedenti. Per testare l'utilizzo di questo pacchetto, possiamo utilizzare il progetto in ``Help\guide\importing-exporting\DownstreamComponents``. Ci sono due differenze rispetto al precedente progetto ``Downstream``. Per prima cosa dobbiamo trovare i componenti del pacchetto. Cambiare la riga ``find_package`` da:

source: To:
it: A:

source: and the ``target_link_libraries`` line from:
it: e la riga ``target_link_libraries`` da:

source: In ``main.cc``, replace ``#include MathFunctions.h`` with:
it: In ``main.cc``, sostituire ``#include MathFunctions.h`` con:

source: Finally, use the ``Addition`` library:
it: Infine, utilizzare la libreria ``Addition``:

source: Build the ``Downstream`` project and confirm that it can find and use the package components.
it: Buildare il progetto ``Downstream`` e verificare che possa trovare e utilizzare i componenti del pacchetto.

source: CMake Tutorial
it: Tutorial di CMake

source: The CMake tutorial provides a step-by-step guide that covers common build system issues that CMake helps address. Seeing how various topics all work together in an example project can be very helpful. The tutorial documentation and source code for examples can be found in the ``Help/guide/tutorial`` directory of the CMake source code tree. Each step has its own subdirectory containing code that may be used as a starting point. The tutorial examples are progressive so that each step provides the complete solution for the previous step.
it: I tutorial su CMake fornisce una guida passo passo che copre i problemi comuni del sistema di build che CMake aiuta a risolvere. Vedere come i vari argomenti lavorano insieme in un progetto di esempio può essere molto utile. La documentazione del tutorial e il codice sorgente degli esempi si trovano nella directory ``Help/guide/tutorial`` dell'albero del codice sorgente di CMake. Ogni passaggio ha la propria sottodirectory contenente il codice utilizzabile come punto di partenza. Gli esempi del tutorial sono progressivi in modo che ogni passaggio fornisca la soluzione completa per il passaggio precedente.

source: A Basic Starting Point (Step 1)
it: Un Primo Punto di Partenza (Step 1)

source: The most basic project is an executable built from source code files. For simple projects, a three line ``CMakeLists.txt`` file is all that is required. This will be the starting point for our tutorial. Create a ``CMakeLists.txt`` file in the ``Step1`` directory that looks like:
it: Il progetto più elementare è un eseguibile creato da file di codice sorgente. Per progetti semplici, tutto ciò che serve è un file ``CMakeLists.txt``. Questo sarà il punto di partenza del tutorial. Creare un file ``CMakeLists.txt`` nella directory ``Step1`` che assomigli a:

source: Note that this example uses lower case commands in the ``CMakeLists.txt`` file. Upper, lower, and mixed case commands are supported by CMake. The source code for ``tutorial.cxx`` is provided in the ``Step1`` directory and can be used to compute the square root of a number.
it: Notare che questo esempio utilizza comandi in minuscolo nel file ``CMakeLists.txt``. I comandi maiuscoli, minuscoli e misti sono supportati da CMake. Il codice sorgente per ``tutorial.cxx`` è fornito nella directory ``Step1`` ed è utilizzabile per calcolare la radice quadrata di un numero.

source: Adding a Version Number and Configured Header File
it: Aggiunta di un Numero di Versione e di un File di Header di Configurazione

source: The first feature we will add is to provide our executable and project with a version number. While we could do this exclusively in the source code, using ``CMakeLists.txt`` provides more flexibility.
it: La prima funzionalità che aggiungeremo è fornire all'eseguibile e al progetto un numero di versione. Sebbene potremmo farlo esclusivamente nel codice sorgente, l'utilizzo di ``CMakeLists.txt`` offre maggiore flessibilità.

source: First, modify the ``CMakeLists.txt`` file to use the :command:`project` command to set the project name and version number.
it: Innanzitutto, si modifica il file ``CMakeLists.txt`` per utilizzare il comando :command:`project` per impostare il nome del progetto e il numero della versione.

source: Then, configure a header file to pass the version number to the source code:
it: Poi, si configura un file header per passare il numero di versione al codice sorgente:

source: Since the configured file will be written into the binary tree, we must add that directory to the list of paths to search for include files. Add the following lines to the end of the ``CMakeLists.txt`` file:
it: Poiché il file configurato verrà scritto nell'albero binario, dobbiamo aggiungere quella directory all'elenco dei percorsi in cui cercare i file include. Si aggiungono le seguenti righe alla fine del file ``CMakeLists.txt``:

source: Using your favorite editor, create ``TutorialConfig.h.in`` in the source directory with the following contents:
it: Utilizzando un editor, si crea ``TutorialConfig.h.in`` nella directory sorgente con il seguente contenuto:

source: When CMake configures this header file the values for ``@Tutorial_VERSION_MAJOR@`` and ``@Tutorial_VERSION_MINOR@`` will be replaced.
it: Quando CMake configura questo file header, i valori per ``@Tutorial_VERSION_MAJOR@`` e ``@Tutorial_VERSION_MINOR@`` verranno rimpiazzati.

source: Next modify ``tutorial.cxx`` to include the configured header file, ``TutorialConfig.h``.
it: Successivamente si modifica ``tutorial.cxx`` per includere il file header configurato , ``TutorialConfig.h``.

source: Finally, let's print out the executable name and version number by updating ``tutorial.cxx`` as follows:
it: Infine, stampiamo il nome dell'eseguibile e il numero della versione aggiornando ``tutorial.cxx`` come segue:

source: Specify the C++ Standard
it: Specificare lo standard del C++

source: Next let's add some C++11 features to our project by replacing ``atof`` with ``std::stod`` in ``tutorial.cxx``. At the same time, remove ``#include <cstdlib>``.
it: Successivamente aggiungiamo alcune funzionalità del C++11 al progetto sostituendo ``atof`` con ``std::stod`` in ``tutorial.cxx``. Contemporaneamente si rimuove ``#include <cstdlib>``.

source: We will need to explicitly state in the CMake code that it should use the correct flags. The easiest way to enable support for a specific C++ standard in CMake is by using the :variable:`CMAKE_CXX_STANDARD` variable. For this tutorial, set the :variable:`CMAKE_CXX_STANDARD` variable in the ``CMakeLists.txt`` file to 11 and :variable:`CMAKE_CXX_STANDARD_REQUIRED` to True. Make sure to add the ``CMAKE_CXX_STANDARD`` declarations above the call to ``add_executable``.
it: Dovremo dichiarare esplicitamente nel codice CMake che dovrebbe utilizzare i flag corretti. Il modo più semplice per abilitare il supporto per uno standard C++ specifico in CMake è utilizzare la variabile :variable:`CMAKE_CXX_STANDARD`. Per questo tutorial, si imposta la variabile :variable:`CMAKE_CXX_STANDARD` nel file ``CMakeLists.txt`` a 11 e :variable:`CMAKE_CXX_STANDARD_REQUIRED` a True. Si devono aggiungere le dichiarazioni ``CMAKE_CXX_STANDARD`` al di sopra della chiamata a ``add_executable``.

source: Build and Test
it: Build e Test

source: Run the :manual:`cmake <cmake(1)>` executable or the :manual:`cmake-gui <cmake-gui(1)>` to configure the project and then build it with your chosen build tool.
it: Lanciare l'eseguibile :manual:`cmake <cmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>` per configurare il progetto e quindi crearlo col tool di build scelto.

source: For example, from the command line we could navigate to the ``Help/guide/tutorial`` directory of the CMake source code tree and create a build directory:
it: Ad esempio, dalla riga di comando potremmo navigare nella directory ``Help/guide/tutorial`` dell'albero del codice sorgente di CMake e creare una directory di build:

source: Next, navigate to the build directory and run CMake to configure the project and generate a native build system:
it: Successivamente, si va nella directory di build e si esegue CMake per configurare il progetto e generare un sistema di build nativo:

source: Then call that build system to actually compile/link the project:
it: Poi si chiama quel sistema di build per compilare/linkare effettivamente il progetto:

source: Finally, try to use the newly built ``Tutorial`` with these commands:
it: Infine, provare a utilizzare il ``Tutorial`` appena creato con questi comandi:

source: Adding a Library (Step 2)
it: Aggiunta di una libreria (Step 2)

source: Now we will add a library to our project. This library will contain our own implementation for computing the square root of a number. The executable can then use this library instead of the standard square root function provided by the compiler.
it: Ora aggiungeremo una libreria al progetto Questa libreria conterrà l'implementazione per calcolare la radice quadrata di un numero. L'eseguibile può quindi utilizzare questa libreria invece della funzione radice quadrata standard fornita dal compilatore.

source: For this tutorial we will put the library into a subdirectory called ``MathFunctions``. This directory already contains a header file, ``MathFunctions.h``, and a source file ``mysqrt.cxx``. The source file has one function called ``mysqrt`` that provides similar functionality to the compiler's ``sqrt`` function.
it: Per questo tutorial inseriremo la libreria in una sottodirectory chiamata ``MathFunctions``. Questa directory contiene già un file di header, ``MathFunctions.h``, e un file sorgente ``mysqrt.cxx``. Il file sorgente ha una funzione chiamata ``mysqrt`` che fornisce funzionalità simili alla funzione ``sqrt`` del compilatore.

source: Add the following one line ``CMakeLists.txt`` file to the ``MathFunctions`` directory:
it: Si aggiunge il seguente file ``CMakeLists.txt`` alla directory ``MathFunctions``:

source: To make use of the new library we will add an :command:`add_subdirectory` call in the top-level ``CMakeLists.txt`` file so that the library will get built. We add the new library to the executable, and add ``MathFunctions`` as an include directory so that the ``mysqrt.h`` header file can be found. The last few lines of the top-level ``CMakeLists.txt`` file should now look like:
it: Per utilizzare la nuova libreria aggiungeremo una chiamata :command:`add_subdirectory` nel file di livello superiore ``CMakeLists.txt`` in modo che la libreria venga creata. Aggiungiamo la nuova libreria all'eseguibile e aggiungiamo ``MathFunctions`` come directory di inclusione in modo che sia raggiungibile il file header ``mysqrt.h``. Le ultime righe del file di livello superiore ``CMakeLists.txt`` dovrebbero ora assomigliare a:

source: Now let us make the MathFunctions library optional. While for the tutorial there really isn't any need to do so, for larger projects this is a common occurrence. The first step is to add an option to the top-level ``CMakeLists.txt`` file.
it: Rendiamo ora facoltativa la libreria MathFunctions. Mentre per il tutorial non ce n'è realmente bisogno, per progetti più grandi questo è un evento comune. Il primo passo consiste nell'aggiungere un'opzione al file ``CMakeLists.txt`` di livello superiore.

source: This option will be displayed in the :manual:`cmake-gui <cmake-gui(1)>` and :manual:`ccmake <ccmake(1)>` with a default value of ON that can be changed by the user. This setting will be stored in the cache so that the user does not need to set the value each time they run CMake on a build directory.
it: Questa opzione verrà visualizzata in :manual:`cmake-gui <cmake-gui(1)>` e :manual:`ccmake <ccmake(1)>` con un valore predefinito di ON modificabile dall'utente. Questa impostazione verrà archiviata nella cache in modo che l'utente non debba impostare il valore ogni volta che esegue CMake su una directory di build.

source: The next change is to make building and linking the MathFunctions library conditional. To do this we change the end of the top-level ``CMakeLists.txt`` file to look like the following:
it: La modifica successiva consiste nel rendere condizionale la creazione e il link della libreria MathFunctions. Per fare ciò modifichiamo la fine del file di livello superiore ``CMakeLists.txt`` in modo che assomigli al seguente:

source: Note the use of the variable ``EXTRA_LIBS`` to collect up any optional libraries to later be linked into the executable. The variable ``EXTRA_INCLUDES`` is used similarly for optional header files. This is a classic approach when dealing with many optional components, we will cover the modern approach in the next step.
it: Da notare l'uso della variabile ``EXTRA_LIBS`` per raccogliere eventuali librerie opzionali da linkare successivamente all'eseguibile. La variabile ``EXTRA_INCLUDES`` viene utilizzata in modo simile per i file header opzionali. Questo è un approccio classico quando si ha a che fare con molti componenti opzionali, tratteremo l'approccio moderno nel prossimo step.

source: The corresponding changes to the source code are fairly straightforward. First, in ``tutorial.cxx``, include the ``MathFunctions.h`` header if we need it:
it: Le modifiche corrispondenti al codice sorgente sono abbastanza semplici. Per prima cosa, in ``tutorial.cxx``, si include l'header ``MathFunctions.h`` se ne abbiamo bisogno:
