Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: CMake has many predefined modules that can be found in the Modules subdirectory of CMake. The modules can find many common software packages. See the :manual:`cmake-modules(7)` manual for a detailed list.
it: CMake ha molti moduli predefiniti che si trovano nella sottodirectory Modules di CMake. I moduli possono trovare molti pacchetti software comuni. Consultare il manuale :manual:`cmake-modules(7)` per un elenco dettagliato.

source: Each ``Find<XX>.cmake`` module defines a set of variables that will allow a project to use the software package once it is found. Those variables all start with the name of the software being found <XX>. With CMake we have tried to establish a convention for naming these variables, but you should read the comments at the top of the module for a more definitive answer. The following variables are used by convention when needed:
it: Ciascun modulo ``Find<XX>.cmake`` definisce un insieme di variabili che consentiranno a un progetto di utilizzare il pacchetto software una volta trovato. Queste variabili iniziano tutte con il nome del software trovato <XX>. Con CMake abbiamo provato a stabilire una convenzione per nominare queste variabili, ma si devono leggere i commenti all'inizio del modulo per una risposta definitiva. Le seguenti variabili sono utilizzate per convenzione quando necessario:

source: Where to find the package's header files, typically <XX>.h, etc.
it: Dove trovare i file header del pacchetto, in genere <XX>.h, ecc.

source: The libraries to link against to use <XX>. These include full paths.
it: Le librerie a cui linkare per utilizzare <XX>. Queste includono path completi.

source: Preprocessor definitions to use when compiling code that uses <XX>.
it: Definizioni del preprocessore da utilizzare durante la compilazione del codice che utilizza <XX>.

source: Where to find the <XX> tool that is part of the package.
it: Dove trovare il tool <XX> che fa parte del pacchetto.

source: Where to find the <YY> tool that comes with <XX>.
it: Dove trovare il tool <YY> fornito con <XX>.

source: Where to find the base directory of the installation of <XX>. This is useful for large packages where you want to reference many files relative to a common base (or root) directory.
it: Dove trovare la directory di base dell'installazione di <XX>. Ciò è utile per pacchetti di grandi dimensioni in cui si desidera fare riferimento a molti file relativi a una directory di base (o root) comune.

source: Version <YY> of the package was found if true. Authors of find modules should make sure at most one of these is ever true. For example TCL_VERSION_84.
it: Se true, è stata trovata la versione <YY> del pacchetto. Gli autori dei moduli find dovrebbero assicurarsi che al massimo uno di questi non sia mai vero. Per esempio TCL_VERSION_84.

source: If false, then the optional <YY> part of <XX> package is unavailable.
it: Se false, la parte facoltativa <YY> del pacchetto <XX> non è disponibile.

source: Set to false or undefined if we haven't found or don't want to use <XX>.
it: Impostato su false o indefinito se non abbiamo trovato o non vogliamo utilizzare <XX>.

source: Not all of the variables are present in each of the ``FindXX.cmake files``. However, the ``<XX>_FOUND`` should exist under most circumstances. If ``<XX>`` is a library, then ``<XX>_LIBRARIES`` should also be defined, and ``<XX>_INCLUDE_DIR`` should usually be defined.
it: Non tutte le variabili sono presenti in ciascuno dei file ``FindXX.cmake``. Tuttavia, nella maggior parte dei casi, ``<XX>_FOUND`` dovrebbe esistere. Se ``<XX>`` è una libreria, si devono definire anche ``<XX>_LIBRARIES`` e ``<XX>_INCLUDE_DIR``.

source: Modules can be included in a project either with the :command:`include` command or the :command:`find_package` command.
it: I moduli possono essere inclusi in un progetto sia col comando :command:`include` che con :command:`find_package`.

source: is equivalent to:
it: è equivalente a:

source: and
it: e

source: If the project converts over to CMake for its build system, the :command:`find_package` will still work if the package provides a ``<XX>Config.cmake`` file. How to create a CMake package is described later in this chapter.
it: Se il progetto viene convertito in CMake per il suo sistema di build, :command:`find_package` funzionerà ancora se il pacchetto fornisce un file ``<XX>Config.cmake``. Come creare un pacchetto CMake è descritto più avanti in questo capitolo.

source: Creating CMake Package Configuration Files
it: Creazione dei File di Configurazione del Pacchetto CMake

source: Projects must provide package configuration files so that outside applications can find them. Consider a simple project "Gromit" providing an executable to generate source code and a library against which the generated code must link. The ``CMakeLists.txt`` file might start with:
it: I progetti devono fornire i file di configurazione del pacchetto in modo che le applicazioni esterne possano trovarli. Si consideri un semplice progetto "Gromit" che fornisce un eseguibile per generare il codice sorgente e una libreria a cui il codice generato deve linkarsi. Il file ``CMakeLists.txt`` potrebbe iniziare con:

source: In order to install Gromit and export its targets for use by outside projects, add the code:
it: Per installare Gromit ed esportare i suoi target per l'utilizzo da parte di progetti esterni, si aggiunge il codice:

source: Finally, Gromit must provide a package configuration file in its installation tree so that outside projects can locate it with :command:`find_package`:
it: Infine, Gromit deve fornire un file di configurazione del pacchetto nel suo albero di installazione in modo che i progetti esterni possano individuarlo con :command:`find_package`:

source: This code configures and installs the package configuration file and a corresponding package version file. The package configuration input file ``gromit-config.cmake.in`` has the code:
it: Questo codice configura e installa il file di configurazione del pacchetto e un corrispondente file di versione. Il file di input della configurazione del pacchetto ``gromit-config.cmake.in`` contiene il codice:

source: After installation, the configured package configuration file ``gromit-config.cmake`` knows the locations of other installed files relative to itself. The corresponding package version file is configured from its input file ``gromit-config-version.cmake.in``, which contains code such as:
it: Dopo l'installazione, il file di configurazione del pacchetto configurato ``gromit-config.cmake`` conosce le posizioni degli altri file installati rispetto a se stesso. Il file della versione corrispondente del pacchetto è configurato dal suo file di input ``gromit-config-version.cmake.in``, che contiene codice come:

source: An application that uses the Gromit package might create a CMake file that looks like this:
it: Un'applicazione che utilizza il pacchetto Gromit potrebbe creare un file CMake simile al seguente:

source: The call to :command:`find_package` locates an installation of Gromit or terminates with an error message if none can be found (due to ``REQUIRED``). After the command succeeds, the Gromit package configuration file ``gromit-config.cmake`` has been loaded, so Gromit targets have been imported and variables like ``gromit_INCLUDE_DIRS`` have been defined.
it: La chiamata a :command:`find_package` individua un'installazione di Gromit o termina con un messaggio di errore se non viene trovato (a causa di ``REQUIRED``). Dopo che il comando ha avuto successo, il file di configurazione del pacchetto Gromit ``gromit-config.cmake`` è stato caricato, quindi i target Gromit sono stati importati e sono state definite variabili come ``gromit_INCLUDE_DIRS``.

source: The above example creates a package configuration file and places it in the ``install`` tree. One may also create a package configuration file in the ``build`` tree to allow applications to use the project without installation. In order to do this, one extends Gromit's CMake file with the code:
it: L'esempio precedente crea un file di configurazione del pacchetto e lo inserisce nell'albero ``install``. Si può anche creare un file di configurazione del pacchetto nell'albero ``build`` per consentire alle applicazioni di utilizzare il progetto senza installazione. Per fare ciò, si estende il file CMake di Gromit con il codice:

source: This :command:`configure_file` call uses a different input file, ``gromit-config.cmake.in``, containing:
it: Questa chiamata a :command:`configure_file` utilizza un file di input diverso, ``gromit-config.cmake.in``, contenente:

source: The package configuration file ``gromit-config.cmake`` placed in the build tree provides the same information to an outside project as that in the install tree, but refers to files in the source and build trees. It shares an identical package version file ``gromit-config-version.cmake`` which is placed in the install tree.
it: Il file di configurazione del pacchetto ``gromit-config.cmake`` posizionato nell'albero di build fornisce a un progetto esterno le stesse informazioni di quelle nell'albero di installazione, ma fa riferimento ai file nell'albero dei sorgenti e di compilazione. Condivide un file di versione del pacchetto identico ``gromit-config-version.cmake`` che si trova nell'albero di installazione.

source: CMake Package Registry
it: Registro CMake dei Pacchetti

source: CMake provides two central locations to register packages that have been built or installed anywhere on a system: a *User Package Registry* and a *System Package Registry*. The :command:`find_package` command searches the two package registries as two of the search steps specified in its documentation. The registries are especially useful for helping projects find packages in non-standard install locations or directly in the package build trees. A project may populate either the user or system registry (using its own means) to refer to its location. In either case, the package should store a package configuration file at the registered location and optionally a package version file earlier in this chapter.
it: CMake fornisce due posizioni centrali per registrare i pacchetti che sono stati compilati o installati ovunque su un sistema: un *User Package Registry* e un *System Package Registry*. Il comando :command:`find_package` cerca nei due registri dei pacchetti come due dei passi di ricerca specificati nella sua documentazione. I registri sono particolarmente utili per aiutare i progetti a trovare i pacchetti in percorsi di installazione non standard o direttamente negli alberi di build dei pacchetti. Un progetto può popolare il registro utente o di sistema (usando i propri mezzi) per fare riferimento alla sua posizione. In entrambi i casi, il pacchetto dovrebbe memorizzare un file di configurazione del pacchetto nella posizione registrata e facoltativamente un file di versione del pacchetto precedentemente descritto in questo capitolo.

source: The *User Package Registry* is stored in a platform-specific, per-user location. On Windows it is stored in the Windows registry under a key in ``HKEY_CURRENT_USER``. A ``<package>`` may appear under registry key
it: Lo *User Package Registry* è memorizzato in una posizione specifica della piattaforma per utente. Su Windows è memorizzato nel registro di Windows sotto una chiave in ``HKEY_CURRENT_USER``. Un ``<package>`` potrebbe apparire sotto la chiave di registro

source: as a ``REG_SZ`` value with arbitrary name that specifies the directory containing the package configuration file. On UNIX platforms, the user package registry is stored in the user home directory under ``~/.cmake/packages``. A ``<package>`` may appear under the directory
it: come valore ``REG_SZ`` con un nome arbitrario che specifica la directory contenente il file di configurazione del pacchetto. Sulle piattaforme UNIX, il registro del pacchetto utente è memorizzato nella directory home dell'utente in ``~/.cmake/packages``. Un ``<package>`` potrebbe apparire sotto la directory

source: as a file with arbitrary name whose content specifies the directory containing the package configuration file. The :command:`export(PACKAGE)` command may be used to register a project build tree in the user package registry. CMake does not currently provide an interface to add install trees to the user package registry; installers must be manually taught to register their packages if desired.
it: come file con nome arbitrario il cui contenuto specifica la directory contenente il file di configurazione del pacchetto. Il comando :command:`export(PACKAGE)` può essere utilizzato per registrare un albero di build del progetto nello "user package registry". CMake attualmente non fornisce un'interfaccia per aggiungere alberi di installazione al registro dei pacchetti utente; agli installatori deve essere insegnato manualmente a registrare i propri pacchetti, se lo si desidera.

source: The *System Package Registry* is stored in a platform-specific, system-wide location. On Windows it is stored in the Windows registry under a key in ``HKEY_LOCAL_MACHINE``. A ``<package>`` may appear under registry key
it: Il *System Package Registry* è archiviato in una posizione specifica per la piattaforma, a livello di sistema. Su Windows è memorizzato nel registro di Windows sotto una chiave in ``HKEY_LOCAL_MACHINE``. Un ``<package>`` potrebbe apparire sotto la chiave di registro

source: as a ``REG_SZ`` value with arbitrary name that specifies the directory containing the package configuration file. There is no system package registry on non-Windows platforms. CMake does not provide an interface to add to the system package registry; installers must be manually taught to register their packages if desired.
it: come valore ``REG_SZ`` con un nome arbitrario che specifica la directory contenente il file di configurazione del pacchetto. Non esiste un registro dei pacchetti di sistema su piattaforme diverse da Windows. CMake non fornisce un'interfaccia da aggiungere al registro dei pacchetti di sistema; agli installatori deve essere insegnato manualmente a registrare i propri pacchetti, se lo si desidera.

source: Package registry entries are individually owned by the project installations that they reference. A package installer is responsible for adding its own entry and the corresponding uninstaller is responsible for removing it. However, in order to keep the registries clean, the :command:`find_package` command automatically removes stale package registry entries it encounters if it has sufficient permissions. An entry is considered stale if it refers to a directory that does not exist or does not contain a matching package configuration file. This is particularly useful for user package registry entries created by the :command:`export(PACKAGE)` command for build trees which have no uninstall event and are simply deleted by developers.
it: Le voci di registro dei pacchetti sono di proprietà individuale delle installazioni del progetto a cui fanno riferimento. Un programma di installazione del pacchetto è responsabile dell'aggiunta della propria voce e il programma di disinstallazione corrispondente è responsabile della sua rimozione. Tuttavia, per mantenere puliti i registri, il comando :command:`find_package` rimuove automaticamente le voci di registro dei pacchetti obsoleti che incontra se dispone di autorizzazioni sufficienti. Una voce è considerata obsoleta se fa riferimento a una directory che non esiste o che non contiene un file di configurazione del pacchetto corrispondente. Questo è particolarmente utile per le voci di registro dei pacchetti utente create dal comando :command:`export(PACKAGE)` per costruire alberi che non hanno eventi di disinstallazione e vengono semplicemente cancellati dagli sviluppatori.

source: Package registry entries may have arbitrary name. A simple convention for naming them is to use content hashes, as they are deterministic and unlikely to collide. The :command:`export(PACKAGE)` command uses this approach. The name of an entry referencing a specific directory is simply the content hash of the directory path itself. For example, a project may create package registry entries such as
it: Le voci di registro dei pacchetti possono avere un nome arbitrario. Una semplice convenzione per denominarli consiste nell'utilizzare gli hash di contenuto, poiché sono deterministici ed è improbabile che collidano. Il comando :command:`export(PACKAGE)` utilizza questo approccio. Il nome di una voce che fa riferimento a una directory specifica è semplicemente l'hash del contenuto del path della directory stessa. Ad esempio, un progetto può creare voci di registro del pacchetto come

source: on Windows, or
it: su Windows, oppure

source: on UNIX. The command :command:`find_package(MyPackage)` will search the registered locations for package configuration files. The search order among package registry entries for a single package is unspecified. Registered locations may contain package version files to tell :command:`find_package` whether a specific location is suitable for the version requested.
it: su UNIX. Il comando :command:`find_package(MyPackage)` cercherà i path registrati per i file di configurazione del pacchetto. L'ordine di ricerca tra le voci di registro dei pacchetti per un singolo pacchetto non è specificato. Le posizioni registrate possono contenere file di versione del pacchetto per indicare a :command:`find_package` se una posizione specifica è adatta per la versione richiesta.

source: Getting Started
it: Per Iniziare

source: Getting and Installing CMake on Your Computer
it: Ottenere e Installare CMake sul Computer

source: Before using CMake, you will need to install or build the CMake binaries on your system. On many systems, you may find that CMake is already installed or is available for installation with the standard package manager tool for the system. Cygwin, Debian, FreeBSD, OS X MacPorts, Mac OS X Fink, and many others all have CMake distributions.
it: Prima di utilizzare CMake, si dovranno installare o creare i binari di CMake. Su molti sistemi, CMake è già installato o è disponibile per l'installazione col tool di gestione pacchetti standard. Cygwin, Debian, FreeBSD, OS X MacPorts, Mac OS X Fink e molti altri hanno tutti distribuzioni di CMake.

source: If your system does not have a CMake package, you can find CMake precompiled for many common architectures on the CMake `Download <www.cmake.org/download>`_ page. Select the desired release and follow the download instructions. CMake may be installed to any directory, so root privileges are not required for installation.
it: Se il sistema non ha un pacchetto CMake, lo si può trovare precompilato per molte architetture nella pagina di `Download <www.cmake.org/download>`_. Selezionare la versione desiderata e seguire le istruzioni per il download. CMake può essere installato in qualsiasi directory, quindi i privilegi di root non sono richiesti.

source: If you do not find precompiled binaries for your system, then you can build CMake from source. To build CMake, you will need a modern C++ compiler and the source distribution from the `CMake Download <http://www.cmake.org/download>`_ page or `Kitware’s GitLab instance <https://gitlab.kitware.com/cmake/cmake>`_. To build CMake, follow the instructions in ``Readme.txt`` at the top of the source tree.
it: Se non si trovano i binari precompilati per il proprio sistema, si può creare CMake dal sorgente. Per creare CMake, c'è bisogno di un compilatore C++ moderno e dei sorgenti dalla pagina di `Download di CMake <http://www.cmake.org/download>`_ o dall'istanza GitLab di `Kitware <https://gitlab.kitware.com/cmake/cmake>`_. Per creare CMake, seguire le istruzioni nel ``Readme.txt`` nella root dell'albero dei sorgenti.

source: Directory Structure
it: Struttura della Directory

source: There are two main directories CMake uses when building a project: the source directory and the binary directory. The source directory is where the source code for the project is located. This is also where the CMakeLists files will be found. The binary directory is sometimes referred to as the build directory and is where CMake will put the resulting object files, libraries, and executables. CMake will not write any files to the source directory, only to the binary directory.
it: Esistono due directory principali utilizzate da CMake durante la creazione di un progetto: la directory dei sorgenti e la directory dei binari. La directory dei sorgenti è dove si trova il codice sorgente per il progetto. Questo è anche il punto in cui verranno si troveranno i file CMakeLists. La directory dei binari è talvolta indicata come directory di build ed è dove CMake inserirà i file oggetto, le librerie e gli eseguibili risultanti. CMake non scriverà alcun file nella directory dei sorgenti, solo in quella dei binari.

source: Out-of-source builds, where the source and binary directories are different, are strongly encouraged. In-source builds where the source and binary directories are the same are supported but should be avoided if possible. Out-of-source builds make it very easy to maintain a clean source tree and allow quick removal of all of the files generated by a build. Having the build tree differ from the source tree also makes it easy to support having multiple builds of a single source tree. This is useful when you want to have multiple builds with different options but just one copy of the source code.
it: Le build "out-of-source", in cui le directory dei sorgenti e dei binarie sono diverse, sono fortemente volute. Le build "in-source" in cui le directory dei sorgenti e dei binari sono le stesse sono supportate, ma dovrebbero essere evitate se possibile. Le build "out-of-source" facilitano molto la manutenzione di un albero dei sorgenti pulito e consentono una rapida rimozione di tutti i file generati da una build. Il fatto che l'albero di compilazione sia diverso da quello dei sorgenti semplifica anche il supporto di più build di un singolo albero di sorgenti. Questo è utile quando si vogliono avere più build con diverse opzioni ma solo una copia del codice sorgente.

source: Basic CMake Usage
it: Utilizzo di Base di CMake

source: CMake takes one or more CMakeLists files as input and produces project files or Makefiles for use with a wide variety of native development tools.
it: CMake accetta uno o più file CMakeLists come input e produce file di progetto o Makefile da utilizzare con un'ampia varietà di strumenti di sviluppo nativi.

source: The typical CMake process is as follows:
it: Il processo tipico di CMake è il seguente:

source: The project is defined in one or more CMakeLists files
it: Il progetto è definito in uno o più file CMakeLists

source: CMake configures and generates the project
it: CMake configura e genera il progetto

source: Users build project with their favorite native development tool
it: Gli utenti creano progetti con il loro strumento di sviluppo nativo preferito

source: Each step of the process is described in detail in the following sections.
it: Ogni fase del processo è descritta in dettaglio nelle sezioni seguenti.

source: CMakeLists Files
it: I File CMakeLists
