Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Building a complex project is a multi-step process. Complex in this case means that the project uses tests that run executables, and that it builds executables which are used later in the build to generate code (or something similar). One such project is VTK, which uses several :command:`try_run` tests and creates several code generators. When running CMake on the project, every :command:`try_run` command will produce an error message; at the end there will be a ``TryRunResults.cmake`` file in the build directory. You need to go through all of the entries of this file and fill in the appropriate values. If you are uncertain about the correct result, you can also try to execute the test binaries on the real target platform, where they are saved in the binary directory.
it: La Build di un progetto complesso è un processo in più fasi. Complesso in questo caso significa che il progetto utilizza test che eseguono eseguibili e che crea eseguibili utilizzati successivamente nella build per generare codice (o qualcosa di simile). Uno di questi progetti è VTK, che utilizza diversi test :command:`try_run` e crea diversi generatori di codice. Quando si esegue CMake sul progetto, ogni comando :command:`try_run` produrrà un messaggio di errore; alla fine ci sarà un file ``TryRunResults.cmake`` nella directory di build. È necessario esaminare tutte le voci di questo file e inserire i valori appropriati. Se non si è certi della correttezza del risultato, si può anche provare a eseguire i binari di test sulla piattaforma target reale, dove vengono salvati nella directory binaria.

source: VTK contains several code generators, one of which is ProcessShader. These code generators are added using :command:`add_executable`; :command:`get_target_property(LOCATION)` is used to get the locations of the resulting binaries, which are then used in :command:`add_custom_command` or :command:`add_custom_target` commands. Since the cross-compiled executables cannot be executed during the build, the :command:`add_executable` calls are surrounded by ``if (NOT CMAKE_CROSSCOMPILING)`` commands and the executable targets are imported into the project using the :command:`add_executable` command with the ``IMPORTED`` option. These import statements are in the file ``VTKCompileToolsConfig.cmake``, which does not have to be created manually, but it is created by a native build of VTK.
it: VTK contiene diversi generatori di codice, uno dei quali è ProcessShader. Questi generatori di codice vengono aggiunti utilizzando :command:`add_executable`; :command:`get_target_property(LOCATION)` viene utilizzato per ottenere le posizioni dei file binari risultanti, che vengono poi utilizzati nei comandi :command:`add_custom_command` o :command:`add_custom_target` commands. Poiché gli eseguibili cross-compilati non possono essere eseguiti durante la compilazione, le chiamate :command:`add_executable` sono circondate dai comandi ``if (NOT CMAKE_CROSSCOMPILING)`` e gli eseguibili target vengono importati nel progetto col comando :command:`add_executable` con l'opzione ``IMPORTED``. Queste istruzioni di importazione si trovano nel file ``VTKCompileToolsConfig.cmake``, che non deve essere creato manualmente, ma viene creato da una build nativa di VTK.

source: In order to cross-compile VTK, you need to:
it: Per eseguire la cross-compilazione di VTK, è necessario:

source: Install a toolchain and create a toolchain file for CMake.
it: Installare una toolchain e creare un file toolchain per CMake.

source: Build VTK natively for the build host.
it: Eseguire una build di VTK nativamente per l'host di build.

source: Run CMake for the target platform.
it: Eseguire CMake per la piattaforma target.

source: Complete ``TryRunResults.cmake``.
it: Completare ``TryRunResults.cmake``.

source: Use the ``VTKCompileToolsConfig.cmake`` file from the native build.
it: Usa il file ``VTKCompileToolsConfig.cmake`` dalla build nativa.

source: Build.
it: Eseguire la build.

source: So first, build a native VTK for the build host using the standard procedure.
it: Quindi, per prima cosa, si crea un VTK nativo per l'host di build utilizzando la procedura standard.

source: Ensure that all required options are enabled using ccmake; e.g. if you need Python wrapping for the target platform, you must enable Python wrapping in ``build-native/``. Once this build has finished, there will be a ``VTKCompileToolsConfig.cmake`` file in ``build-native/``. If this succeeded, we can continue to cross compiling the project, in this example for an IBM BlueGene supercomputer.
it: Tutte le opzioni richieste devono essere abilitate usando ccmake; per esempio. se c'è bisogno del wrapping di Python per la piattaforma target, si deve abilitare il wrapping Python in ``build-native/``. Una volta terminata questa build, ci sarà un file ``VTKCompileToolsConfig.cmake`` in ``build-native/``. Se ciò ha avuto successo, possiamo continuare a cross-compilare il progetto, in questo esempio per un supercomputer IBM BlueGene.

source: This will finish with an error message for each :command:`try_run` and a ``TryRunResults.cmake file``, that you have to complete as described above. You should save the file to a safe location, or it will be overwritten on the next CMake run.
it: Questo finirà con un messaggio di errore per ogni :command:`try_run` e un file ``TryRunResults.cmake``, da completare come descritto precedentemente. Si dovrebbe salvare il file in una posizione sicura, altrimenti verrà sovrascritto alla prossima esecuzione di CMake.

source: On the second run of ccmake, all the other arguments can be skipped as they are now in the cache. It is possible to point CMake to the build directory that contains a CMakeCache.txt, so CMake will figure out that this is the build directory.
it: Alla seconda esecuzione di ccmake, tutti gli altri argomenti possono essere saltati perché ora sono nella cache. È possibile indirizzare CMake alla directory di build che contiene un CMakeCache.txt, poi CMake capirà che questa è la directory di build.

source: Some Tips and Tricks
it: Alcuni Suggerimenti e Trucchi

source: Dealing with try_run tests
it: Gestione dei test try_run

source: In order to make cross compiling your project easier, try to avoid :command:`try_run` tests and use other methods to test something instead. If you cannot avoid :command:`try_run` tests, try to use only the exit code from the run and not the output of the process. That way it will not be necessary to set both the exit code and the stdout and stderr variables for the :command:`try_run` test when cross-compiling. This allows the ``OUTPUT_VARIABLE`` or the ``RUN_OUTPUT_VARIABLE`` options for :command:`try_run` to be omitted.
it: Per semplificare la cross-compilazione del progetto, si cercano di evitare i test :command:`try_run` usando invece altri metodi per testare qualcosa. Se non si possono evitare i test :command:`try_run`, provare a utilizzare solo il codice di uscita dall'esecuzione e non l'output del processo. In questo modo non sarà necessario impostare sia il codice output che le variabili stdout e stderr per il test :command:`try_run` durante la cross-compilazione. Ciò consente di omettere le opzioni ``OUTPUT_VARIABLE`` o ``RUN_OUTPUT_VARIABLE`` per :command:`try_run`.

source: If you have done that, created and completed a correct ``TryRunResults.cmake`` file for the target platform, you might consider adding this file to the sources of the project, so that it can be reused by others. These files are per-target, per-toolchain.
it: Facendolo, si crea e si completa un file ``TryRunResults.cmake`` corretto per la piattaforma target, si potrebbe considerare di aggiungere questo file ai sorgenti del progetto, in modo che possa essere riutilizzato da altri. Questi file sono per target, per toolchain.

source: Target platform and toolchain issues
it: Problemi relativi alla piattaforma e alla toolchain target

source: If your toolchain is unable to build a simple program without special arguments, like e.g. a linker script file or a memory layout file, the tests CMake does initially will fail. To make it work the CMake module CMakeForceCompiler offers the following macros:
it: Se la toolchain non è in grado di creare un semplice programma senza argomenti speciali, come ad es. un file di script del linker o un file di layout di memoria, i test inizialmente eseguiti da CMake falliranno. Per farlo funzionare, il modulo CMake CMakeForceCompiler offre le seguenti macro:

source: These macros can be used in a toolchain file so that the required variables will be preset and the CMake tests avoided.
it: Queste macro possono essere utilizzate in un file di toolchain in modo che le variabili richieste vengano preimpostate e i test CMake evitati.

source: RPATH handling under UNIX
it: Gestione di RPATH sotto UNIX

source: For native builds, CMake builds executables and libraries by default with RPATH. In the build tree, the RPATH is set so that the executables can be run from the build tree; i.e. the RPATH points into the build tree. When installing the project, CMake links the executables again, this time with the RPATH for the install tree, which is empty by default.
it: Per le build native, CMake crea eseguibili e librerie per default con RPATH. Nell'albero di build, RPATH è impostato in modo che gli eseguibili possano essere eseguiti dall'albero di build; cioè i punti RPATH nell'albero di build. Durante l'installazione del progetto, CMake linka nuovamente gli eseguibili, questa volta con l'RPATH per l'albero di installazione, che è vuoto per default.

source: When cross-compiling you probably want to set up RPATH handling differently. As the executable cannot run on the build host, it makes more sense to build it with the install RPATH right from the start. There are several CMake variables and target properties for adjusting RPATH handling.
it: Durante la cross-compilazione probabilmente si vorrà impostare la gestione di RPATH in modo diverso. Poiché l'eseguibile non può essere lanciato sull'host di build, ha più senso compilarlo con l'installazione RPATH fin dall'inizio. Esistono diverse variabili CMake e proprietà del target per regolare la gestione di RPATH.

source: With these two settings, the targets will be built with the install RPATH instead of the build RPATH, which avoids the need to link them again when installing. If you don't need RPATH support in your project, you don't need to set :variable:`CMAKE_INSTALL_RPATH`; it is empty by default.
it: Con queste due impostazioni, i target verranno compilati con l'RPATH di installazione anziché con l'RPATH di build, il che evita la necessità di linkarli nuovamente durante l'installazione. Se non c'è bisogno del supporto RPATH nel progetto, non c'è bisogno di impostare :variable:`CMAKE_INSTALL_RPATH`; è vuota per default.

source: Setting :variable:`CMAKE_INSTALL_RPATH_USE_LINK_PATH` to ``TRUE`` is useful for native builds, since it automatically collects the RPATH from all libraries against which a targets links. For cross-compiling it should be left at the default setting of ``FALSE``, because on the target the automatically generated RPATH will be wrong in most cases; it will probably have a different file system layout than the build host.
it: L'impostazione di :variable:`CMAKE_INSTALL_RPATH_USE_LINK_PATH` a ``TRUE`` è utile per le build native, poiché raccoglie automaticamente l'RPATH da tutte le librerie a cui si linka un target. Per la cross-compilazione dovrebbe essere lasciato all'impostazione di default ``FALSE``, perché sul target l'RPATH generato automaticamente sarà errato nella maggior parte dei casi; probabilmente avrà un layout di file system diverso rispetto all'host di build.

source: Custom Commands
it: Comandi Custom

source: Frequently the build process for a software project goes beyond simply compiling libraries and executables. In many cases, additional tasks may be required during or after the build process. Common examples include: compiling documentation using a documentation package; generating source files by running another executable; generating files using tools for which CMake doesn't have rules (such as lex and yacc); moving the resulting executables; post processing the executable, etc. CMake supports these additional tasks using the :command:`add_custom_command` and :command:`add_custom_target` commands. This chapter will describe how to use custom commands and targets to perform complex tasks that CMake does not inherently support.
it: Spesso il processo di build di un progetto software va oltre la semplice compilazione di librerie e di eseguibili. In molti casi, potrebbero essere necessarie attività aggiuntive durante o dopo il processo di build. Esempi comuni includono: compilazione della documentazione utilizzando un pacchetto di documentazione; generare un file sorgente eseguendo un altro eseguibile; generare file utilizzando strumenti per i quali CMake non ha regole (come lex e yacc); spostare gli eseguibili risultanti; post-elaborazione dell'eseguibile, ecc. CMake supporta queste attività aggiuntive utilizzando i comandi :command:`add_custom_command` e :command:`add_custom_target` commands. Questo capitolo descriverà come utilizzare comandi e obiettivi personalizzati per eseguire attività complesse che CMake non supporta nativamente.

source: Portable Custom Commands
it: Comandi Custom Portatili

source: Before going into detail on how to use custom commands, we will discuss how to deal with some of their portability issues. Custom commands typically involve running programs with files as inputs or outputs. Even a simple command, such as copying a file, can be tricky to do in a cross-platform way. For example, copying a file on UNIX is done with the ``cp`` command, while on Windows it is done with the ``copy`` command. To make matters worse, frequently the names of files will change on different platforms. Executables on Windows end with .exe, while on UNIX they do not. Even between UNIX implementations there are differences, such as which extensions are used for shared libraries; .so, .sl, .dylib, etc.
it: Prima di entrare nei dettagli su come utilizzare i comandi personalizzati, discuteremo come affrontare alcuni dei loro problemi di portabilità. I comandi personalizzati in genere comportano l'esecuzione di programmi con file come input o output. Anche un semplice comando, come la copia di un file, può essere complicato da eseguire in modo multipiattaforma. Ad esempio, la copia di un file su UNIX viene eseguita con il comando ``cp``, mentre su Windows viene eseguita con il comando ``copy``. A peggiorare le cose, spesso i nomi dei file cambieranno su piattaforme diverse. Gli eseguibili su Windows terminano con .exe, mentre su UNIX no. Anche tra le implementazioni UNIX ci sono differenze, ad esempio le estensioni utilizzate per le librerie condivise; .so, .sl, .dylib, ecc.

source: CMake provides three main tools for handling these differences. The first is the ``-E`` option (short for execute) to :manual:`cmake <cmake(1)>`. When the :manual:`cmake <cmake(1)>` executable is passed the ``-E`` option, it acts as a general purpose, cross-platform utility command. The arguments following the ``-E`` option indicate what :manual:`cmake <cmake(1)>` should do. These options provide a platform-independent way to perform a few common tasks including copy or remove files, compare and conditionally copy, time, create symlinks and others. The :manual:`cmake <cmake(1)>` executable can be referenced by using the :variable:`CMAKE_COMMAND` variable in your CMakeLists files, as later examples will show.
it: CMake fornisce tre strumenti principali per gestire queste differenze. La prima è l'opzione ``-E`` (abbreviazione di execute) per :manual:`cmake <cmake(1)>`. Quando all'eseguibile :manual:`cmake <cmake(1)>` viene passata l'opzione ``-E``, agisce come un comando di utilità generico multipiattaforma. Gli argomenti che seguono l'opzione ``-E`` indicano cosa dovrebbe fare :manual:`cmake <cmake(1)>`. Queste opzioni forniscono un modo indipendente dalla piattaforma per eseguire alcune attività comuni tra cui copiare o rimuovere file, confrontare e copiare in modo condizionale, cronometrare, creare collegamenti simbolici e altro. È possibile fare riferimento all'eseguibile :manual:`cmake <cmake(1)>` utilizzando la variabile :variable:`CMAKE_COMMAND` nei file CMakeLists, come mostreranno i prossimi esempi.

source: Of course, CMake doesn't limit you to using ``cmake -E`` in all your custom commands. You can use any command that you like, though it's important to consider portability issues when doing it. A common practice is to use :command:`find_program` to find an executable (Perl, for example), and then use that executable in your custom commands.
it: Naturalmente, CMake non limita l'uso di ``cmake -E`` in tutti i comandi personalizzati. Si può usare qualsiasi comando, anche se è importante considerare i problemi di portabilità. Una pratica comune è quella di usare :command:`find_program` per trovare un eseguibile (Perl, per esempio), e poi usare quell'eseguibile nei comandi personalizzati.

source: The second tool that CMake provides to address portability issues is a number of variables describing the characteristics of the platform. The :manual:`cmake-variables(7)` manual lists many variables that are useful for custom commands that need to reference files with platform-dependent names. These include :variable:`CMAKE_EXECUTABLE_SUFFIX`, :variable:`CMAKE_SHARED_LIBRARY_PREFIX`, etc. which describe file naming conventions.
it: Il secondo strumento fornito da CMake per affrontare i problemi di portabilità è una serie di variabili che descrivono le caratteristiche della piattaforma. Il manuale :manual:`cmake-variables(7)` elenca molte variabili utili per i comandi personalizzati che devono fare riferimento a file con nomi dipendenti dalla piattaforma. Questi includono :variable:`CMAKE_EXECUTABLE_SUFFIX`, :variable:`CMAKE_SHARED_LIBRARY_PREFIX`, ecc. che descrivono le convenzioni di denominazione dei file.

source: Finally, CMake supports :manual:`generator expressions <cmake-generator-expressions(7)>` in custom commands. These are expressions that use the special syntax ``$<...>`` and are not evaluated while processing CMake input files, but are instead delayed until generation of the final build system. Therefore, the values substituted for them know all the details of their evaluation context, including the current build configuration and all build properties associated with a target.
it: Infine, CMake supporta :manual:`generator expressions <cmake-generator-expressions(7)>` nei comandi custom. Si tratta di espressioni che utilizzano la sintassi speciale ``$<...>`` e non vengono valutate durante l'elaborazione dei file di input CMake, ma vengono invece posticipate fino alla generazione del sistema di build finale. Pertanto, i valori che li sostituiscono conoscono tutti i dettagli del loro contesto di valutazione, inclusa la configurazione di build corrente e tutte le proprietà di build associate a un target.

source: Add Custom Command
it: Aggiungere Comandi Custom

source: Now we will consider the signature for :command:`add_custom_command`. In Makefile terminology, :command:`add_custom_command` adds a rule to a Makefile. For those more familiar with Visual Studio, it adds a custom build step to a file. :command:`add_custom_command` has two main signatures: one for adding a custom command to a target and one for adding a custom command to build a file.
it: Ora considereremo la firma per :command:`add_custom_command`. Nella terminologia Makefile, :command:`add_custom_command` aggiunge una regola a un Makefile. Per chi ha più familiarità con Visual Studio, aggiunge un passaggio di compilazione personalizzato a un file. :command:`add_custom_command` ha due firme principali: una per aggiungere un comando personalizzato a un target e una per aggiungere un comando personalizzato per la build di un file.

source: The target is the name of a CMake target (executable, library, or custom) to which you want to add the custom command. There is a choice of when the custom command should be executed. You can specify as many commands as you want for a custom command. They will be executed in the order specified.
it: Il target è il nome di una target CMake (eseguibile, libreria, o custom) a cui si desidera aggiungere il comando custom. È possibile scegliere quando eseguire il comando custom. Si possono specificare tutti i comandi desiderati per un comando personalizzato. Verranno eseguiti nell'ordine specificato.

source: Now let us consider a simple custom command for copying an executable once it has been built.
it: Consideriamo ora un semplice comando personalizzato per copiare un eseguibile una volta compilato.

source: The first command in this example is the standard command for creating an executable from a list of source files. In this case, an executable named ``Foo`` is created from the source file ``bar.c``. Next is the :command:`add_custom_command` invocation. Here the target is simply ``Foo`` and we are adding a post build command. The command to execute is :manual:`cmake <cmake(1)>` which has its full path specified in the :variable:`CMAKE_COMMAND` variable. Its arguments are ``-E copy`` and the source and destination locations. In this case, it will copy the ``Foo`` executable from where it was built into the ``/testing_department/files`` directory. Note that the ``TARGET`` parameter accepts a CMake target (``Foo`` in this example), but arguments specified to the ``COMMAND`` parameter normally require full paths. In this case, we pass to ``cmake -E copy``, the full path to the executable referenced via the ``$<TARGET_FILE:...>`` generator expression.
it: Il primo comando in questo esempio è quello standard per la creazione di un eseguibile da un elenco di sorgenti. In questo caso, viene creato un eseguibile chiamato ``Foo`` dal file sorgente ``bar.c``. Poi c'è l'invocazione di :command:`add_custom_command`. Qui l'obiettivo è semplicemente ``Foo`` e stiamo aggiungendo un comando post build. Il comando da eseguire è :manual:`cmake <cmake(1)>` il cui path completo è specificato nella variabile :variable:`CMAKE_COMMAND`. I suoi argomenti sono ``-E copy`` e le posizioni di origine e destinazione. In questo caso, copierà l'eseguibile ``Foo`` da dove è stato compilato nella directory ``/testing_department/files``. Notare che il parametro ``TARGET`` accetta un target CMake (``Foo`` in questo esempio), ma gli argomenti specificati nel parametro ``COMMAND`` normalmente richiedono path completi. In questo caso, passiamo a ``cmake -E copy``, il path completo dell'eseguibile referenziato tramite l'espressione del generatore ``$<TARGET_FILE:...>``.

source: Generate a File
it: Generare un File

source: The second use for :command:`add_custom_command` is to add a rule for how to build an output file. Here the rule provided will replace any current rules for building that file. Keep in mind that :command:`add_custom_command` output must be consumed by a target in the same scope. As discussed later, the :command:`add_custom_target` command can be used for this.
it: Il secondo uso di :command:`add_custom_command` è quello di aggiungere una regola su come creare un file di output. Qui la regola fornita sostituirà qualsiasi regola corrente per la creazione di quel file. Si tenga presente che l'output di :command:`add_custom_command` deve essere utilizzato da un target nello stesso scope. Come discusso in seguito, il comando :command:`add_custom_target` può essere utilizzato per questo.

source: Using an Executable to Build a Source File
it: Utilizzo di un Eseguibile per Creare un File Sorgente
