Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: installs the file ``my-api.h`` from the source tree, and the file ``my-config.h`` from the build tree into the include directory under the installation prefix. By default installed files are given the permissions ``OWNER_WRITE``, ``OWNER_READ``, ``GROUP_READ``, and ``WORLD_READ``, but this may be overridden by specifying the ``PERMISSIONS`` option. Consider cases in which users would want to install a global configuration file on a UNIX system that is readable only by its owner (such as root). We accomplish this with the command
it: installa il file ``my-api.h`` dall'albero dei sorgenti e il file ``my-config.h`` dall'albero di build nella directory include sotto il prefisso di installazione. Per default, ai file installati vengono assegnate le autorizzazioni ``OWNER_WRITE``, ``OWNER_READ``, ``GROUP_READ`` e ``WORLD_READ``, ma questo potrebbe essere sovrascritto specificando l'opzione ``PERMISSIONS``. Si considerino i casi in cui gli utenti vorrebbero installare un file di configurazione globale su un sistema UNIX leggibile solo dal suo proprietario (come root). Lo si fa con questo comando

source: which installs the file ``my-rc`` with owner read/write permission into the absolute path ``/etc``.
it: che installa il file ``my-rc`` con i permessi di lettura/scrittura del proprietario nel path assoluto ``/etc``.

source: The ``RENAME`` argument specifies a name for an installed file that may be different from the original file. Renaming is allowed only when a single file is installed by the command. For example, the command
it: L'argomento ``RENAME`` specifica un nome per un file installato che potrebbe essere diverso dal file originale. La ridenominazione è consentita solo quando un singolo file viene installato dal comando. Ad esempio, il comando

source: will install the file ``version.h`` from the source directory to ``include/my-version.h`` under the installation prefix.
it: installerà il file ``version.h`` dalla directory dei sorgenti in ``include/my-version.h`` sotto il prefisso di installazione.

source: Installing Programs
it: Installazione dei Programmi

source: Projects may also install helper programs, such as shell scripts or Python scripts that are not actually compiled as targets. These may be installed with the ``FILES`` signature using the ``PERMISSIONS`` option to add execute permission. However, this case is common enough to justify a simpler interface. CMake provides the ``PROGRAMS`` signature for this purpose.
it: I progetti possono anche installare programmi di supporto, come script di shell o script Python che non sono effettivamente compilati come target. Questi possono essere installati con la firma ``FILES`` utilizzando l'opzione ``PERMISSIONS`` per aggiungere il permesso di esecuzione. Tuttavia, questo caso è abbastanza comune da giustificare un'interfaccia più semplice. CMake fornisce la firma ``PROGRAMS`` per questo scopo.

source: The ``PROGRAMS`` keyword is immediately followed by a list of scripts to be installed. This command is identical to the ``FILES`` signature, except that the default permissions additionally include ``OWNER_EXECUTE``, ``GROUP_EXECUTE``, and ``WORLD_EXECUTE``. For example, we may install a Python utility script with the command
it: La parola chiave ``PROGRAMS`` è immediatamente seguita da un elenco di script da installare. Questo comando è identico alla firma ``FILES``, tranne per il fatto che le autorizzazioni di default includono anche ``OWNER_EXECUTE``, ``GROUP_EXECUTE`` e ``WORLD_EXECUTE``. Ad esempio, possiamo installare uno script di utilità Python col comando

source: which installs ``my-util.py`` to the ``bin`` directory under the installation prefix and gives it owner, group, world read and execute permissions, plus owner write.
it: che installa ``my-util.py`` nella directory ``bin`` sotto il prefisso di installazione e gli fornisce i permessi di proprietario, gruppo, lettura ed esecuzione universali, più i permessi di scrittura per il proprietario.

source: Installing Directories
it: Installazione di Directory

source: Projects may also provide an entire directory full of resource files, such as icons or html documentation. An entire directory may be installed using the ``DIRECTORY`` signature.
it: I progetti possono anche fornire un'intera directory piena di file di risorse, come icone o documentazione html. È possibile installare un'intera directory utilizzando la firma ``DIRECTORY``.

source: The ``DIRECTORY`` keyword is immediately followed by a list of directories to be installed. Relative paths are evaluated with respect to the current source directory. Each named directory is installed to the destination directory. The last component of each input directory name is appended to the destination directory as that directory is copied. For example, the command
it: La parola chiave ``DIRECTORY`` è immediatamente seguita da un elenco di directory da installare. I path relativi vengono valutati rispetto alla directory dei sorgenti corrente. Ogni directory denominata viene installata nella directory di destinazione. L'ultimo componente di ogni nome di directory di input viene aggiunto alla directory di destinazione quando tale directory viene copiata. Ad esempio, il comando

source: will install the ``data/icons`` directory from the source tree into ``share/myproject/icons`` under the installation prefix. A trailing slash will leave the last component empty and install the contents of the input directory to the destination. The command
it: installerà la directory ``data/icons`` dall'albero dei sorgenti in ``share/myproject/icons`` sotto il prefisso di installazione. Una barra finale lascerà vuoto l'ultimo componente e installerà il contenuto della directory di input nella destinazione. Il comando

source: installs the contents of ``doc/html`` from the source directory into ``doc/myproject`` under the installation prefix. If no input directory names are given, as in
it: installa il contenuto di ``doc/html`` dalla directory di origine in ``doc/myproject`` sotto il prefisso di installazione. Se non vengono forniti nomi di directory di input, come in

source: the destination directory will be created but nothing will be installed into it.
it: la directory di destinazione verrà creata ma non verrà installato nulla al suo interno.

source: Files installed by the ``DIRECTORY`` signature are given the same default permissions as the ``FILES`` signature. Directories installed by the ``DIRECTORY`` signature are given the same default permissions as the ``PROGRAMS`` signature. The ``FILE_PERMISSIONS`` and ``DIRECTORY_PERMISSIONS`` options may be used to override these defaults. Consider a case in which a directory full of example shell scripts is to be installed into a directory that is both owner and group writable. We may use the command
it: I file installati dalla firma ``DIRECTORY`` hanno le stesse autorizzazioni di default della firma ``FILES``. Le directory installate dalla firma ``DIRECTORY`` hanno le stesse autorizzazioni di default della firma ``PROGRAMS``. Le opzioni ``FILE_PERMISSIONS`` e ``DIRECTORY_PERMISSIONS`` possono essere utilizzate per sovrascrivere queste impostazioni di default. Si consideri un caso in cui una directory piena di script di shell di esempio deve essere installata in una directory che sia scrivibile sia dal proprietario che dal gruppo. Possiamo usare il comando

source: which installs the directory ``data/scripts`` into ``share/myproject/scripts`` and sets the desired permissions. In some cases, a fully-prepared input directory created by the project may have the desired permissions already set. The ``USE_SOURCE_PERMISSIONS`` option tells CMake to use the file and directory permissions from the input directory during installation. If in the previous example the input directory were to have already been prepared with correct permissions, the following command may have been used instead:
it: che installa la directory ``data/scripts`` in ``share/myproject/scripts`` e imposta i permessi desiderati. In alcuni casi, una directory di input completamente preparata creata dal progetto potrebbe avere già impostate le autorizzazioni desiderate. L'opzione ``USE_SOURCE_PERMISSIONS`` indica a CMake di utilizzare i permessi di file e directory dalla directory di input durante l'installazione. Se nell'esempio precedente la directory di input fosse già stata predisposta con i permessi corretti, potrebbe essere stato utilizzato invece il seguente comando:

source: If the input directory to be installed is under source management, there may be extra subdirectories in the input that you do not wish to install. There may also be specific files that should not be installed or be installed with different permissions, while most files get the defaults. The ``PATTERN`` and ``REGEX`` options may be used for this purpose. A ``PATTERN`` option is followed first by a globbing pattern and then by an ``EXCLUDE`` or ``PERMISSIONS`` option. A ``REGEX`` option is followed first by a regular expression and then by ``EXCLUDE`` or ``PERMISSIONS``. The ``EXCLUDE`` option skips installation of those files or directories matching the preceding pattern or expression, while the ``PERMISSIONS`` option assigns specific permissions to them.
it: Se la directory di input da installare è sotto la gestione dei sorgenti, potrebbero esserci sottodirectory aggiuntive nell'input che non si desiderano installare. Potrebbero esserci anche file specifici che non devono essere installati o che devono essere installati con autorizzazioni diverse, mentre la maggior parte dei file ottiene i valori di default. Le opzioni ``PATTERN`` e ``REGEX`` possono essere utilizzate per questo scopo. Un'opzione ``PATTERN`` è seguita prima da un "glob pattern" e poi da un'opzione ``EXCLUDE`` o ``PERMISSIONS``. Un'opzione ``REGEX`` è seguita prima da un'espressione regolare e poi da ``EXCLUDE`` o ``PERMISSIONS``. L'opzione ``EXCLUDE`` salta l'installazione di quei file o directory che corrispondono al modello o all'espressione precedente, mentre l'opzione ``PERMISSIONS`` assegna loro autorizzazioni specifiche.

source: Each input file and directory is tested against the pattern or regular expression as a full path with forward slashes. A pattern will match only complete file or directory names occurring at the end of the full path, while a regular expression may match any portion. For example, the pattern ``foo*`` will match ``.../foo.txt`` but not ``.../myfoo.txt`` or ``.../foo/bar.txt;`` however, the regular expression ``foo`` will match all of them.
it: Ogni file e directory di input viene testato rispetto al modello o all'espressione regolare come path completo con barre. Un pattern corrisponderà solo ai nomi completi di file o directory che si trovano alla fine del path completo, mentre un'espressione regolare può corrispondere a qualsiasi parte. Ad esempio, il pattern ``foo*`` corrisponderà a ``.../foo.txt`` ma non a ``.../myfoo.txt`` né a ``.../foo/bar.txt;``; tuttavia, l'espressione regolare ``foo`` corrisponderà a tutti.

source: Returning to the above example of installing an icons directory, consider the case in which the input directory is managed by git and also contains some extra text files that we do not want to install. The command
it: Tornando all'esempio precedente di installazione di una directory di icone, si consideri il caso in cui la directory di input è gestita da git e contiene anche alcuni file di testo extra che non vogliamo installare. Il comando

source: installs the icons directory while ignoring any .git directory or text file contained. The equivalent command using the ``REGEX`` option is
it: installa la directory delle icone ignorando qualsiasi directory .git o file di testo contenuto. Il comando equivalente che utilizza l'opzione ``REGEX`` è

source: which uses '/' and '$' to constrain the match in the same way as the patterns. Consider a similar case in which the input directory contains shell scripts and text files that we wish to install with different permissions than the other files. The command
it: che utilizza '/' e '$' per vincolare la corrispondenza allo stesso modo dei pattern. Si consideri un caso simile in cui la directory di input contiene script di shell e file di testo che desideriamo installare con autorizzazioni diverse rispetto agli altri file. Il comando

source: will install the contents of ``data/other`` from the source directory to ``share/myproject`` while ignoring .git directories and giving specific permissions to ``.txt`` and ``.sh`` files.
it: installerà il contenuto di ``data/other`` dalla directory dei sorgenti a ``share/myproject`` ignorando le directory .git e fornendo autorizzazioni specifiche ai file ``.txt`` e ``.sh``.

source: Installing Scripts
it: Installazione di Script

source: Project installations may need to perform tasks other than just placing files in the installation tree. Third-party packages may provide their own mechanisms for registering new plugins that must be invoked during project installation. The ``SCRIPT`` signature is provided for this purpose.
it: Potrebbe essere necessario che le installazioni del progetto eseguano attività diverse dal semplice inserimento di file nell'albero di installazione. I pacchetti di terze parti possono fornire i propri meccanismi per la registrazione di nuovi plug-in che devono essere richiamati durante l'installazione del progetto. La firma ``SCRIPT`` viene fornita a questo scopo.

source: The ``SCRIPT`` keyword is immediately followed by the name of a CMake script. CMake will execute the script during installation. If the file name given is a relative path, it will be evaluated with respect to the current source directory. A simple use case is printing a message during installation. We first write a ``message.cmake`` file containing the code
it: La parola chiave ``SCRIPT`` è immediatamente seguita dal nome di uno script CMake. CMake eseguirà lo script durante l'installazione. Se il nome del file fornito è un path relativo, verrà valutato rispetto alla directory dei sorgenti corrente. Un semplice caso d'uso è la stampa di un messaggio durante l'installazione. Per prima cosa scriviamo un file ``message.cmake`` contenente il codice

source: and then reference this script using the command:
it: e poi fare riferimento a questo script col comando:

source: Custom installation scripts are not executed during the main CMakeLists file processing; they are executed during the installation process itself. Variables and macros defined in the code containing the ``install (SCRIPT)`` call will not be accessible from the script. However, there are a few variables defined during the script execution that may be used to get information about the installation. The variable :variable:`CMAKE_INSTALL_PREFIX` is set to the actual installation prefix. This may be different from the corresponding cache variable value, because the installation scripts may be executed by a packaging tool that uses a different prefix. An environment variable ``ENV{DESTDIR}`` may be set by the user or packaging tool. Its value is prepended to the installation prefix and to absolute installation paths to determine the location where files are installed. In order to reference an install location on disk, custom script may use ``$ENV{DESTDIR}${CMAKE_INSTALL_PREFIX}`` as the top portion of the path. The variable ``CMAKE_INSTALL_CONFIG_NAME`` is set to the name of the build configuration currently being installed (Debug, Release, etc.). During component-specific installation, the variable ``CMAKE_INSTALL_COMPONENT`` is set to the name of the current component.
it: Gli script di installazione personalizzati non vengono eseguiti durante l'elaborazione del file CMakeLists principale; vengono eseguiti durante il processo di installazione stesso. Le variabili e le macro definite nel codice contenente la chiamata ``install (SCRIPT)`` non saranno accessibili dallo script. Tuttavia, ci sono alcune variabili definite durante l'esecuzione dello script utilizzabili per ottenere informazioni sull'installazione. La variabile :variable:`CMAKE_INSTALL_PREFIX` è impostata sul prefisso di installazione effettivo. Questa può essere diversa dal valore della variabile di cache corrispondente, poiché gli script di installazione possono essere eseguiti da uno strumento di pacchettizzazione che utilizza un prefisso diverso. Una variabile di ambiente ``ENV{DESTDIR}`` può essere impostata dall'utente o dal tool di pacchettizzazione. Il suo valore viene anteposto al prefisso di installazione e ai percorsi di installazione assoluti per determinare la posizione in cui sono installati i file. Per fare riferimento a un path di installazione su disco, lo script custom può utilizzare ``$ENV{DESTDIR}${CMAKE_INSTALL_PREFIX}`` come parte superiore del path. La variabile ``CMAKE_INSTALL_CONFIG_NAME`` è impostata sul nome della configurazione di build attualmente installata (Debug, Release, ecc.). Durante l'installazione specifica del componente, la variabile ``CMAKE_INSTALL_COMPONENT`` è impostata sul nome del componente corrente.

source: Installing Code
it: Installazione del Codice

source: Custom installation scripts, as simple as the message above, are more easily created with the script code placed inline in the call to the :command:`install` command. The ``CODE`` signature is provided for this purpose.
it: Gli script di installazione personalizzati, semplici come il messaggio precedente, vengono creati più facilmente con il codice dello script inserito in linea nella chiamata al comando :command:`install`. La firma ``CODE`` viene fornita a questo scopo.

source: The ``CODE`` keyword is immediately followed by a string containing the code to place in the installation script. An install-time message may be created using the command
it: La parola chiave ``CODE`` è immediatamente seguita da una stringa contenente il codice da inserire nello script di installazione. È possibile creare un messaggio al momento dell'installazione utilizzando il comando

source: which has the same effect as the ``message.cmake`` script but contains the code inline.
it: che ha lo stesso effetto dello script ``message.cmake`` ma contiene il codice in linea.

source: Installing Prerequisite Shared Libraries
it: Installazione di Librerie Shared Prerequisite

source: Executables are frequently built using shared libraries as building blocks. When you install such an executable, you must also install its prerequisite shared libraries, called "prerequisites" because the executable requires their presence in order to load and run properly. The three main sources of shared libraries are the operating system itself, the build products of your own project, and third party libraries belonging to an external project. The ones from the operating system may be relied upon to be present without installing anything: they are on the base platform where your executable runs. The build products in your own project presumably have :command:`add_library` build rules in the CMakeLists files, and so it should be straightforward to create CMake install rules for them. It is the third party libraries that frequently become a high maintenance item when there are more than a handful of them, or when the set of them fluctuates from version-to-version of the third party project. Libraries may be added, code may be reorganized, and the third party shared libraries themselves may actually have additional prerequisites that are not obvious at first glance.
it: Gli eseguibili vengono spesso creati utilizzando librerie shared come elementi costitutivi. Quando si installa un eseguibile di questo tipo, è necessario installare anche le sue librerie shared prerequisite, chiamate "prerequisiti" perché l'eseguibile richiede la loro presenza per essere caricato ed eseguito correttamente. Le tre principali sorgenti delle librerie shared sono il sistema operativo stesso, i prodotti della build del proprio progetto e le librerie di terze parti appartenenti a un progetto esterno. Si può fare affidamento su quelli del sistema operativo per essere presenti senza installare nulla: sono sulla piattaforma di base in cui viene eseguito l'eseguibile. I prodotti della build nel progetto presumibilmente hanno la regola di build :command:`add_library` nei file CMakeLists, quindi dovrebbe essere semplice creare regole di installazione di CMake per loro. Sono le librerie di terze parti che spesso diventano un elemento di manutenzione elevata quando ce ne sono parecchie o quando si passa da una versione all'altra del progetto di terze parti. Le librerie si possono aggiungere, il codice può essere riorganizzato e le stesse librerie shared di terze parti potrebbero effettivamente avere prerequisiti aggiuntivi che non sono ovvi a prima vista.

source: CMake provides a module, :module:`BundleUtilities` to make it easier to deal with required shared libraries. This module provides the ``fixup_bundle`` function to copy and fix prerequisite shared libraries using well-defined locations relative to the executable. For Mac bundle applications, it embeds the libraries inside the bundle, fixing them with ``install_name_tool`` to make a self-contained unit. On Windows, it copies the libraries into the same directory with the executable since executables will search in their own directories for their required DLLs.
it: CMake fornisce un modulo, :module:`BundleUtilities` per semplificare la gestione delle librerie shared richieste. Questo modulo fornisce la funzione ``fixup_bundle`` per copiare e correggere librerie shared prerequisite utilizzando posizioni ben definite relative all'eseguibile. Per le applicazioni bundle Mac, si racchiudono le librerie all'interno del bundle, correggendole con ``install_name_tool`` per creare un'unità autonoma. Su Windows, si copiano le librerie nella stessa directory con l'eseguibile poiché gli eseguibili cercheranno nelle proprie directory le DLL richieste.

source: The ``fixup_bundle`` function helps you create relocatable install trees. Mac users appreciate self-contained bundle applications: you can drag them anywhere, double click them, and they still work. They do not rely on anything being installed in a certain location other than the operating system itself. Similarly, Windows users without administrative privileges appreciate a relocatable install tree where an executable and all required DLLs are installed in the same directory, so that it works no matter where you install it. You can even move things around after installing them and it will still work.
it: La funzione ``fixup_bundle`` aiuta a creare alberi di installazione rilocabili. Gli utenti Mac apprezzano le applicazioni bundle autonome: si possono trascinare ovunque, fare doppio clic su di esse e funzionano ancora. Non si basano su nulla di installato in una determinata posizione diversa dal sistema operativo stesso. Allo stesso modo, gli utenti Windows senza privilegi amministrativi apprezzano un albero di installazione rilocabile in cui un eseguibile e tutte le DLL richieste sono installate nella stessa directory, in modo che funzioni indipendentemente da dove lo si installa. Si possono persino spostare le cose dopo averle installate e funzionerà comunque.
