Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: A flag indicating whether the group should start out "expanded", showing its components. Otherwise only the group name itself will be shown until the user clicks on the group. Only available with NSIS.
it: Un flag che indica se il gruppo deve iniziare "espanso", mostrandone i componenti. Altrimenti verrà mostrato solo il nome del gruppo stesso finché l'utente non fa clic sul gruppo. Disponibile solo con NSIS.

source: The displayed name of the installation type. This value can be any string.
it: Il nome visualizzato del tipo di installazione. Questo valore può essere qualsiasi stringa.

source: CPack for Cygwin Setup
it: CPack per l'installazione di Cygwin

source: Cygwin (http://www.cygwin.com/) is a Linux-like environment for Windows that consists of a run time DLL and a collection of tools. To add tools to the official cygwin, the cygwin setup program is used. The setup tool has very specific layouts for the source and binary trees that are to be included. CPack can create the source and binary tar files and correctly bzip them so that they can be uploaded to the cygwin mirror sites. You must of course have your package accepted by the cygwin community before that is done. Since the layout of the package is more restrictive than other packaging tools, you may have to change some of the install options for your project.
it: Cygwin (http://www.cygwin.com/) è un ambiente simile a Linux per Windows che consiste in una DLL di runtime e una raccolta di tool. Per aggiungere tool al cygwin ufficiale, viene utilizzato il programma di installazione di cygwin. Lo strumento di installazione ha layout molto specifici per gli alberi sorgenti e binari che devono essere inclusi. CPack può creare i file tar sorgenti e binari e comprimerli correttamente in modo che possano essere caricati sui siti mirror di cygwin. Ovviamente si deve far accettare il pacchetto dalla comunità cygwin prima che ciò avvenga. Poiché il layout del pacchetto è più restrittivo rispetto ad altri strumenti di creazione di pacchetti, potrebbe essere necessario modificare alcune delle opzioni di installazione per il progetto.

source: The cygwin setup program requires that all files be installed into ``/usr/bin``, ``/usr/share/package-version``, ``/usr/share/man`` and ``/usr/share/doc/package-version``. The cygwin CPack generator will automatically add the ``/usr`` to the install directory for the project. The project must install things into ``share`` and ``bin``, and CPack will add the ``/usr`` prefix automatically.
it: Il programma di installazione di Cygwin richiede che tutti i file siano installati in ``/usr/bin``, ``/usr/share/package-version``, ``/usr/share/man`` e ``/usr/share/doc/package-version``. Il generatore cygwin CPack aggiungerà automaticamente ``/usr`` alla directory di installazione per il progetto. Il progetto deve installare cose in ``share`` e ``bin``, e CPack aggiungerà automaticamente il prefisso ``/usr``.

source: Cygwin also requires that you provide a shell script that can be used to create the package from the sources. Any cygwin specific patches that are required for the package must also be provided in a diff file. CMake's configure_file command can be used to create both of these files for a project. Since CMake is a cygwin package, the CMake code used to configure CMake for the cygwin CPack generators is as follows
it: Cygwin richiede inoltre di fornire uno script di shell che utilizzabile per creare il pacchetto dai sorgenti. Eventuali patch specifiche di cygwin necessarie per il pacchetto devono essere fornite in un ulteriore file diff. Il comando configure_file di CMake può essere utilizzato per creare entrambi questi file per un progetto. Poiché CMake è un pacchetto cygwin, il codice CMake utilizzato per configurare CMake per i generatori cygwin CPack è il seguente

source: The file ``Utilities/Release/Cygwin/cygwin-package.sh.in`` can be found in the CMake source tree. It is a shell script that can be used to re-create the cygwin package from source. For other projects, there is a template install script that can be found in ``Templates/cygwin-package.sh.in``. This script should be able to configure and package any cygwin based CPack project, and it is required for all official cygwin packages.
it: Il file ``Utilities/Release/Cygwin/cygwin-package.sh.in`` si trova nell'albero dei sorgenti di CMake. È uno script di shell utilizzabile per ricreare il pacchetto cygwin dal sorgente. Per altri progetti, esiste uno script template di installazione che si trova in ``Templates/cygwin-package.sh.in``. Questo script dovrebbe essere in grado di configurare e impacchettare qualsiasi progetto CPack basato su Cygwin ed è richiesto per tutti i pacchetti Cygwin ufficiali.

source: Another important file for cygwin binaries is ``share/doc/Cygwin/package-version.README``. This file should contain the information required by cygwin about the project. In the case of CMake, the file is configured so that it can contain the correct version information. For example, part of that file for CMake looks like this::
it: Un altro file importante per i binari di Cygwin è ``share/doc/Cygwin/package-version.README``. Questo file dovrebbe contenere le informazioni richieste da cygwin sul progetto. Nel caso di CMake, il file è configurato in modo da poter contenere le informazioni sulla versione corretta. Ad esempio, parte di quel file per CMake ha questo aspetto::

source: CPack for Mac OS X PackageMaker
it: CPack per Mac OS X PackageMaker

source: On the Apple Mac OS X operating system, CPack provides the ability to use the system PackageMaker tool. This section will show the CMake application install screens users will see when installing the CMake package on OS X. The CPack variables set to change the text in the installer will be given for each screen of the installer.
it: Sul sistema operativo Apple Mac OS X, CPack offre la possibilità di utilizzare il tool di sistema PackageMaker. Questa sezione mostrerà le schermate di installazione dell'applicazione CMake che gli utenti vedranno durante l'installazione del pacchetto CMake su OS X. Le variabili CPack impostate per modificare il testo nel programma di installazione verranno fornite per ciascuna schermata del programma di installazione.

source: Mac Package inside .dmg
it: Pacchetto Mac all'interno di .dmg

source: In Figure :num:`figure-MacPackageinsidedmg`, the ``.pkg`` file found inside the ``.dmg`` disk image created by the CPack package maker for Mac OS X is seen. The name of this file is controlled by the ``CPACK_PACKAGE_FILE_NAME`` variable. If this is not set, CPack will use a default name based on the package name and version settings.
it: La Figura :num:`figure-MacPackageinsidedmg` mostra il file ``.pkg`` che si trova nell'immagine del disco ``.dmg`` creata dal creatore di pacchetti CPack per Mac OS X. Il nome di questo file è controllato dalla variabile ``CPACK_PACKAGE_FILE_NAME``. Se questo non è impostato, CPack utilizzerà un nome di default basato sul nome del pacchetto e sulle impostazioni della versione.

source: Introduction Screen Mac PackageMaker
it: Schermata introduttiva Mac PackageMaker

source: When the ``.pkg`` file is run, the package wizard starts with the screen seen in Figure :num:`figure-IntroductionScreenMacPackageMaker`. The text in this window is controlled by the file pointed to by the ``CPACK_RESOURCE_FILE_WELCOME`` variable.
it: Quando viene eseguito il file ``.pkg``, la procedura guidata del pacchetto si avvia con la schermata visualizzata in Figura :num:`figure-IntroductionScreenMacPackageMaker`. Il testo in questa finestra è controllato dal file indicato dalla variabile ``CPACK_RESOURCE_FILE_WELCOME``.

source: Readme section of Mac package wizard
it: La sezione Readme della procedura guidata per i pacchetti Mac

source: The figure above shows the read me section of the package wizard. The text for this window is customized by using the ``CPACK_RESOURCE_FILE_README`` variable. It should contain a path to the file containing the text that should be displayed on this screen.
it: La figura sopra mostra la sezione Readme della procedura guidata del pacchetto. Il testo di questa finestra è personalizzato utilizzando la variabile ``CPACK_RESOURCE_FILE_README``. Dovrebbe contenere un path al file contenente il testo che dovrebbe essere visualizzato su questa schermata.

source: License screen Mac packager
it: Schermata della licenza Mac packager

source: This figure contains the license text for the package. Users must accept the license for the installation process to continue. The text for the license comes from the file pointed to by the ``CPACK_RESOURCE_FILE_LICENSE`` variable.
it: Questa figura contiene il testo della licenza per il pacchetto. Gli utenti devono accettare la licenza affinché il processo di installazione continui. Il testo della licenza proviene dal file indicato dalla variabile ``CPACK_RESOURCE_FILE_LICENSE``.

source: The other screens in the installation process are not customizable from CPack. To change more advanced features of this installer, there are two CPack templates that you can modify, ``Modules/CPack.Info.plist.in`` and ``Modules/CPack.Description.plist.in``. These files can be replaced by using the ``CMAKE_MODULE_PATH`` variable to point to a directory in your project containing a modified copy of either or both.
it: Le altre schermate nel processo di installazione non sono personalizzabili da CPack. Per modificare le funzionalità più avanzate di questo programma di installazione, ci sono due modelli CPack modificabili, ``Modules/CPack.Info.plist.in`` e ``Modules/CPack.Description.plist.in``. Questi file possono essere sostituiti utilizzando la variabile ``CMAKE_MODULE_PATH`` per puntare a una directory nel progetto contenente una copia modificata di uno o entrambi.

source: CPack for Mac OS X Drag and Drop
it: CPack per Mac OS X "Drag and Drop"

source: CPack also supports the creation of a Drag and Drop installer for the Mac. In this case a .dmg disk image is created. The image contains both a symbolic link to the /Applications directory and a copy of the project's install tree. In this case it is best to use a Mac application bundle or a single folder containing your relocatable installation as the only install target for the project. The variable ``CPACK_PACKAGE_EXECUTABLES`` is used to point to the application bundle for the project.
it: CPack supporta anche la creazione di un programma di installazione Drag and Drop per Mac. In questo caso viene creata un'immagine .dmg. L'immagine contiene sia un link simbolico alla directory /Applications sia una copia dell'albero di installazione del progetto. In questo caso è meglio utilizzare un pacchetto di applicazioni Mac o una singola cartella contenente l'installazione rilocabile come unica destinazione di installazione per il progetto. La variabile ``CPACK_PACKAGE_EXECUTABLES`` viene utilizzata per puntare al bundle dell'applicazione per il progetto.

source: Drag and Drop License dialog
it: Finestra di dialogo della licenza Drag and Drop

source: Resulting Drag and Drop folders
it: Cartelle Drag and Drop risultanti

source: CPack for Mac OS X X11 Applications
it: CPack per applicazioni Mac OS X X11

source: CPack also includes an OS X X11 package maker generator. This can be used to package X11 based applications, as well as make them act more like native OS X applications by wrapping them with a script that will allow users to run them as they would any native OS X application. Much like the OS X PackageMaker generator, the OS X X11 generator creates a disk image ``.dmg`` file. In this example, an X11 application called KWPolygonalObjectViewerExample is packaged with the OS X X11 CPack generator.
it: CPack include anche un generatore di creatori di pacchetti OS X X11. Questo può essere utilizzato per impacchettare applicazioni basate su X11, oltre a farle agire più come applicazioni OS X native racchiudendole con uno script che consentirà agli utenti di eseguirle come farebbero con qualsiasi applicazione OS X nativa. Proprio come il generatore OS X PackageMaker, il generatore OS X X11 crea un file immagine ``.dmg``. In questo esempio, un'applicazione X11 chiamata KWPolygonalObjectViewerExample è inclusa nel pacchetto con il generatore OS X X11 CPack.

source: Mac OS X X11 package disk image
it: Immagine del disco del pacchetto Mac OS X X11

source: This figure shows the disk image created. In this case the ``CPACK_PACKAGE_NAME`` was set to KWPolygonalObjectViewerExample, and the version information was left with the CPack default of 0.1.1. The variable ``CPACK_PACKAGE_EXECUTABLES`` was set to the pair KWPolygonalObjectViewerExample and KWPolygonalObjectViewerExample, the installed X11 application is called KWPolygonalObjectViewerExample.
it: Questa figura mostra l'immagine del disco creata. In questo caso ``CPACK_PACKAGE_NAME`` è stato impostato su KWPolygonalObjectViewerExample e le informazioni sulla versione sono state lasciate con il default di CPack di 0.1.1. La variabile ``CPACK_PACKAGE_EXECUTABLES`` è stata impostata sulla coppia KWPolygonalObjectViewerExample e KWPolygonalObjectViewerExample, l'applicazione X11 installata si chiama KWPolygonalObjectViewerExample.

source: Opening OS X X11 disk image
it: Apertura dell'immagine disco OS X X11

source: The above figure shows what a user would see after clicking on the ``.dmg`` file created by CPack. Mac OS X is mounting this disk image as a disk
it: La figura sopra mostra ciò che un utente vedrebbe dopo aver fatto clic sul file ``.dmg`` creato da CPack. Mac OS X sta montando questa immagine come disco

source: Mounted .dmg disk image
it: L'immagine .dmg montata

source: This figure shows the mounted disk image. It will contain a symbolic link to the /Applications directory for the system, and it will contain an application bundle for each executable found in ``CPACK_PACKAGE_EXECUTABLES``. The users can then drag and drop the applications into the Applications folder as seen in the figure below.
it: Questa figura mostra l'immagine del disco montata. Conterrà un link simbolico alla directory /Applications per il sistema e conterrà un pacchetto di applicazioni per ogni eseguibile trovato in ``CPACK_PACKAGE_EXECUTABLES``. Gli utenti possono quindi trascinare e rilasciare le applicazioni nella cartella Applications come mostrato nella figura seguente.

source: Drag and drop application to Applications
it: Drag and drop dell'applicazione in Applications

source: CPack actually provides a C++ based executable that can run an X11 application via the Apple scripting language. The application bundle installed will run that forwarding application when the user double clicks on KWPolygonalObjectViewerExample. This script will make sure that the X11 server is started. The script that is run can be found in ``CMake/Modules/CPack.RuntimeScript.in``. The source for the script launcher C++ program can be found in ``Source/CPack/OSXScriptLauncher.cxx``.
it: CPack fornisce effettivamente un eseguibile basato su C++ che può eseguire un'applicazione X11 tramite il linguaggio di scripting Apple. Il bundle dell'applicazione installato eseguirà l'applicazione di inoltro quando l'utente fa doppio clic su KWPolygonalObjectViewerExample. Questo script farà in modo che il server X11 sia avviato. Lo script che viene eseguito si trova in ``CMake/Modules/CPack.RuntimeScript.in``. Il sorgente per il programma C++ di avvio degli script si trova in ``Source/CPack/OSXScriptLauncher.cxx``.

source: CPack for Debian Packages
it: CPack per i pacchetti Debian

source: A Debian package ``.deb`` is simply an "ar" archive. CPack includes the code for the BSD style ar that is required by Debian packages. The Debian packager uses the standard set of CPack variables to initialize a set of Debian specific variables. These can be overridden in the ``CPACK_PROJECT_CONFIG_FILE``; the name of the generator is "DEB". The variables used by the DEB generator are as follows:
it: Un pacchetto Debian ``.deb`` è semplicemente un archivio "ar". CPack include il codice per l'ar in stile BSD richiesto dai pacchetti Debian. Il packager Debian usa l'insieme standard di variabili CPack per inizializzare un insieme di variabili specifiche di Debian. Questi possono essere sovrascritte in ``CPACK_PROJECT_CONFIG_FILE``; il nome del generatore è "DEB". Le variabili utilizzate dal generatore DEB sono le seguenti:

source: defaults to lower case of ``CPACK_PACKAGE_NAME``.
it: il default è il minuscolo di ``CPACK_PACKAGE_NAME``.

source: defaults to ``i386``.
it: il default è ``i386``.

source: This must be set to other packages that this package depends on, and if empty a warning is emitted.
it: Questo deve essere impostato su altri pacchetti da cui dipende questo pacchetto e, se vuoto, viene emesso un warning.

source: defaults to value of ``CPACK_PACKAGE_CONTACT``
it: il default è il valore di ``CPACK_PACKAGE_CONTACT``

source: defaults to value of ``CPACK_PACKAGE_DESCRIPTION_SUMMARY``
it: il default è il valore di ``CPACK_PACKAGE_DESCRIPTION_SUMMARY``

source: defaults to ``devl``
it: il default è ``devl``

source: defaults to ``optional``
it: il default è ``optional``

source: CPack for RPM
it: CPack per RPM

source: CPack has support for creating Linux RPM files. The name of the generator as set in ``CPACK_GENERATOR`` is "RPM". The RPM package capability requires that rpmbuild is installed on the machine and is in PATH. The RPM packager uses the standard set of CPack variables to initialize RPM specific variables. The RPM specific variables are as follows:
it: CPack ha il supporto per la creazione di file RPM Linux. Il nome del generatore come impostato in ``CPACK_GENERATOR`` è "RPM". La funzionalità del pacchetto RPM richiede che rpmbuild sia installato sulla macchina e si trovi in PATH. Il packager RPM utilizza il set standard di variabili CPack per inizializzare variabili specifiche di RPM. Le variabili specifiche RPM sono le seguenti:

source: defaults to lower case of ``CPACK_PACKAGE_NAME``
it: il default è il minuscolo di ``CPACK_PACKAGE_NAME``

source: defaults to value of ``CPACK_PACKAGE_VERSION``.
it: il default è il valore di ``CPACK_PACKAGE_VERSION``.

source: defaults to ``i386``
it: il default è ``i386``.

source: defaults to ``1``. This is the version of the RPM file, not the version of the software being packaged.
it: il default è ``1``. Questa è la versione del file RPM, non quella del software che impacchettato.

source: defaults to ``none``.
it: il default è ``none``.

source: defaults to value of ``CPACK_PACKAGE_VENDOR``
it: il default è il valore di ``CPACK_PACKAGE_VENDOR``

source: CPack Files
it: I File CPack

source: There are a number of files that are used by CPack that can be useful for learning more about how CPack works and what options you can set. These files can also be used as the starting point for other generators for CPack. These files can mostly be found in the Modules and Templates directories of CMake and typically start with the prefix CPack. As of version 2.8.8, you may also refer to ``cpack --help-variable-list`` and ``cpack --help-variable`` for the full set of documented ``CPACK_*`` variables.
it: Esistono numerosi file utilizzati da CPack che possono essere utili per saperne di più su come funziona CPack e quali opzioni è possibile impostare. Questi file possono essere utilizzati anche come punto di partenza per altri generatori per CPack. Questi file si trovano principalmente nelle directory Modules e Templates di CMake e in genere iniziano con il prefisso CPack. A partire dalla versione 2.8.8, si può anche fare riferimento a ``cpack --help-variable-list`` e a ``cpack --help-variable`` per il set completo di variabili ``CPACK_*`` documentate.

source: Policies
it: Policy

source: Occasionally a new feature or change is made to CMake that is not fully backwards compatible with older versions. This can create problems when someone tries to use an old CMakeLists file with a new version of CMake. To help both end users and developers through such issues, we have introduced :manual:`cmake-policies <cmake-policies(7)>`. Policies are a mechanism for helping improve backwards compatibility and tracking compatibility issues between different versions of CMake.
it: Occasionalmente viene apportata una nuova funzionalità o modifica a CMake che non è completamente compatibile con le versioni precedenti. Ciò può creare problemi quando qualcuno tenta di utilizzare un vecchio file CMakeLists con una nuova versione di CMake. Per aiutare sia gli utenti finali che gli sviluppatori a risolvere questi problemi, abbiamo introdotto :manual:`cmake-policies <cmake-policies(7)>`. Le Policy sono un meccanismo per aiutare a migliorare la compatibilità con le versioni precedenti e tenere traccia dei problemi di compatibilità tra le diverse versioni di CMake.

source: Design Goals
it: Obiettivi del Progetto

source: There were four main design goals for the CMake policy mechanism:
it: C'erano quattro obiettivi di progettazione principali per il meccanismo delle Policy CMake:

source: Existing projects should build with newer versions of CMake than that used by the project authors.
it: I progetti esistenti devono essere compilati con versioni più recenti di CMake rispetto a quella utilizzata dagli autori del progetto.

source: Users should not need to edit code to get the projects to build.
it: Gli utenti non dovrebbero aver bisogno di modificare il codice per ottenere la compilazione dei progetti.

source: Warnings may be issued but the projects should build.
it: Possono essere emessi avvertimenti ma i progetti dovrebbero essere buildati.

source: Correctness of new interfaces or bug fixes in old interfaces should not be inhibited by compatibility requirements. Any reduction in correctness of the latest interface is not fair on new projects.
it: La correttezza delle nuove interfacce o la correzione dei bug nelle vecchie interfacce non dovrebbe essere inibita dai requisiti di compatibilità. Qualsiasi riduzione della correttezza dell'ultima interfaccia non è giusta per i nuovi progetti.

source: Every change made to CMake that may require changes to a project's CMakeLists files should be documented.
it: Ogni modifica apportata a CMake che potrebbe richiedere modifiche ai file CMakeLists di un progetto deve essere documentata.

source: Each change should also have a unique identifier that can be referenced with warning and error messages.
it: Ogni modifica deve inoltre avere un identificatore univoco a cui è possibile fare riferimento con warning e messaggi di errore.

source: The new behavior is enabled only when the project has somehow indicated it is supported.
it: Il nuovo comportamento è abilitato solo quando il progetto ha in qualche modo indicato di essere supportato.

source: We must be able to eventually remove code that implements compatibility with ancient CMake versions.
it: Dobbiamo essere in grado di rimuovere eventualmente il codice che implementa la compatibilità con le versioni vecchie di CMake.

source: Such removal is necessary to keep the code clean and to allow for internal refactoring.
it: Tale rimozione è necessaria per mantenere il codice pulito e per consentire il refactoring interno.

source: After such removal, attempts at building projects written for ancient versions must fail with an informative message.
it: Dopo tale rimozione, i tentativi di build dei progetti scritti per versioni vecchie devono fallire con un messaggio.
