Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: If your project is currently based on standard UNIX Makefiles then their conversion to CMake should be fairly straightforward. Essentially, for every directory in your project that has a Makefile, you will create a matching CMakeLists file. How you handle multiple Makefiles in a directory depends on their function. If the additional Makefiles (or Makefile type files) are simply included in the main Makefile, you can create matching CMake input (.cmake) files and include them into your main CMakeLists file in a similar manner. If the different Makefiles are meant to be invoked on the command line for different situations, consider creating a main CMakeLists file that uses some logic to choose which one to :command:`include` based on a CMake option.
it: Se il progetto è attualmente basato su Makefile UNIX standard, la loro conversione in CMake dovrebbe essere abbastanza semplice. In sostanza, per ogni directory nel progetto che ha un Makefile, si creerà un file CMakeLists corrispondente. Il modo in cui si gestiscono più Makefile in una directory dipende dalla loro funzione. Se i Makefile aggiuntivi (o i file di tipo Makefile) sono semplicemente inclusi nel Makefile principale, è possibile creare file di input CMake corrispondenti (.cmake) e includerli nel file CMakeLists principale allo stesso modo. Se i diversi Makefile devono essere richiamati sulla riga di comando per situazioni diverse, si prenda in considerazione la creazione di un file CMakeLists principale che utilizzi una logica per scegliere quale :command:`include` in base a un'opzione CMake.

source: Frequently Makefiles have a list of object files to compile. These can be converted to CMake variables as follows::
it: Spesso i Makefile hanno un elenco di file oggetto da compilare. Questi possono essere convertiti in variabili CMake come segue::

source: becomes
it: diventa

source: While the object files are typically listed in a Makefile, in CMake the focus is on the source files. If you used conditional statements in your Makefiles, they can be converted over to CMake :command:`if` commands. Since CMake handles generating dependencies, most dependencies or rules to generate dependencies can be eliminated. Where you have rules to build libraries or executables, replace them with :command:`add_library` or :command:`add_executable` commands.
it: Mentre i file oggetto sono in genere elencati in un Makefile, in CMake l'attenzione è sui sorgenti. Se sono usate istruzioni condizionali nei Makefile, possono essere convertite in comandi :command:`if` CMake. Poiché CMake gestisce la generazione delle dipendenze, è possibile eliminare la maggior parte delle dipendenze o delle regole per generarle. Se si hanno regole per creare librerie o eseguibili, si sostituiscono coi comandi :command:`add_library` o :command:`add_executable`.

source: Some UNIX build systems (and source code) make heavy use of the system architecture to determine which files to compile or what flags to use. Typically this information is stored in a Makefile variable called ``ARCH`` or ``UNAME``. The first choice in these cases is to replace the architecture-specific code with a more generic test. With some software packages, there is too much architecture specific code for such a change to be reasonable, or you may want to make decisions based on architecture for other reasons. In those cases, you can use the variables :variable:`CMAKE_SYSTEM_NAME` and :variable:`CMAKE_SYSTEM_VERSION`. They provide fairly detailed information on the operating system and version of the host computer.
it: Alcuni sistemi di build UNIX (e codice sorgente) fanno un uso massiccio dell'architettura di sistema per determinare quali file compilare o quali flag utilizzare. Tipicamente queste informazioni sono memorizzate in una variabile Makefile chiamata ``ARCH`` o ``UNAME``. La prima scelta in questi casi è sostituire il codice specifico dell'architettura con un test più generico. Con alcuni pacchetti software, c'è troppo codice specifico dell'architettura perché tale modifica sia ragionevole, oppure si potrebbe voler prendere decisioni basate sull'architettura per altri motivi. In questi casi, si possono utilizzare le variabili :variable:`CMAKE_SYSTEM_NAME` e :variable:`CMAKE_SYSTEM_VERSION`. Forniscono informazioni abbastanza dettagliate sul sistema operativo e sulla versione del computer host.

source: Converting Autoconf Based Projects
it: Conversione di Progetti Basati su Autoconf

source: Autoconf-based projects primarily consist of three key pieces. The first is the configure.in file which drives the process. The second is Makefile.in which will become the resulting Makefile, and the third piece is the remaining configured files that result from running configure. In converting an autoconf based project to CMake, start with the configure.in and Makefile.in files.
it: I progetti basati su Autoconf consistono principalmente di tre parti chiave. La prima è il file configure.in che guida il processo. La seconda è Makefile.in che diventerà il Makefile risultante, e il terzo pezzo sono i restanti file configurati che risultano dall'esecuzione di configure. Nella conversione di un progetto basato su autoconf in CMake, si inizia con i file configure.in e Makefile.in.

source: The Makefile.in file can be converted to CMake syntax as explained in the preceding section on converting UNIX Makefiles. Once this has been done, convert the configure.in file into CMake syntax. Most functions (macros) in autoconf have corresponding commands in CMake. A short table of some of the basic conversions is listed below:
it: Il file Makefile.in può essere convertito nella sintassi CMake come spiegato nella sezione precedente sulla conversione dei Makefile UNIX. Fatto ciò, si converte il file configure.in nella sintassi CMake. La maggior parte delle funzioni (macro) in autoconf hanno comandi corrispondenti in CMake. Di seguito è riportata una breve tabella di alcune delle conversioni di base:

source: Use the :command:`option` command.
it: Usa il comando :command:`option`.

source: Use the ``check_include_file`` macro from the :module:`CheckIncludeFile` module.
it: Usa la macro ``check_include_file`` dal modulo :module:`CheckIncludeFile`.

source: Use the :command:`message` command with the ``STATUS`` argument.
it: Usa il comando :command:`message` con l'argomento ``STATUS``.

source: Done automatically when using the :command:`configure_file` command.
it: Fatto automaticamente quando si utilizza il comando :command:`configure_file`.

source: Use the ``check_libary_exists`` macro from the :module:`CheckLibraryExists` module.
it: Usa la macro ``check_libary_exists`` dal modulo :module:`CheckLibraryExists`.

source: Use the :command:`add_subdirectory` command.
it: Usa il comando :command:`add_subdirectory`.

source: Use the :command:`configure_file` command.
it: Usa il comando :command:`configure_file`.

source: Use the :command:`try_compile` command.
it: Usa il comando :command:`try_compile`.

source: If your configure script performs test compilations using ``AC_TRY_COMPILE``, you can use the same code for CMake. Either put it directly into your CMakeLists file if it is short, or preferably put it into a source code file for your project. We typically put such files into a CMake subdirectory for large projects that require such testing.
it: Se lo script di configurazione esegue compilazioni di test utilizzando ``AC_TRY_COMPILE``, si può utilizzare lo stesso codice per CMake. O lo si inserisce direttamente nel file CMakeLists se è breve, o preferibilmente lo si mette in un file di codice sorgente per il progetto. In genere inseriamo tali file in una sottodirectory CMake per progetti di grandi dimensioni che richiedono tali test.

source: Where you are relying on autoconf to configure files, you can use CMake's :command:`configure_file` command. The basic approach is the same and we typically name input files to be configured with a ``.in`` extension just as autoconf does. This command replaces any variables in the input file referenced as ``${VAR}`` or ``@VAR@`` with their values as determined by CMake. If a variable is not defined, it will be replaced with nothing. Optionally, only variables of the form ``@VAR@`` will be replaced and ``${VAR}`` will be ignored. This is useful for configuring files for languages that use ``${VAR}`` as a syntax for evaluating variables. You can also conditionally define variables using the C pre processor by using ``#cmakedefine VAR``. If the variable is defined then :command:`configure_file` will convert the ``#cmakedefine`` into a ``#define``; if it is not defined, it will become a commented out ``#undef``. For example:
it: Dove ci si affida ad autoconf per configurare i file, si può usare il comando :command:`configure_file` di CMake. L'approccio di base è lo stesso e in genere chiamiamo i file di input da configurare con un'estensione ``.in`` proprio come fa autoconf. Questo comando sostituisce qualsiasi variabile nel file di input indicato come ``${VAR}`` o ``@VAR@`` con i relativi valori determinati da CMake. Se una variabile non è definita, verrà sostituita con niente. Facoltativamente, solo le variabili nella forma ``@VAR@`` verranno sostituite e quelle ``${VAR}`` verranno ignorate. Questo è utile per configurare i file per i linguaggi che usano ``${VAR}`` come sintassi per valutare le variabili. Si possono anche definire condizionalmente le variabili usando il preprocessore C usando ``#cmakedefine VAR``. Se la variabile è definita allora :command:`configure_file` convertirà ``#cmakedefine`` in un ``#define``; se non è definito, diventerà un ``#undef`` commentato. Per esempio:

source: Converting Windows Based Workspaces
it: Conversione di Workspace Basati su Windows

source: To convert a Visual Studio solution to CMake involves a few steps. First you will need to create a CMakeLists file at the top of your source code directory. As always, this file should start with :command:`cmake_minimum_required` and :command:`project` command that defines the name of the CMake project. This will become the name of the resulting Visual Studio solution. Next, add all of your source files into CMake variables. For large projects that have multiple directories, create a CMakeLists file in each directory as described in the section on source directory structures at the beginning of this chapter. You will then add your libraries and executables using :command:`add_library` and :command:`add_executable`. By default, :command:`add_executable` assumes that your executable is a console application. Adding the ``WIN32`` argument to :command:`add_executable` indicates that it is a Windows application (using WinMain instead of main).
it: Per convertire una solution di Visual Studio in CMake sono necessari alcuni passaggi. Per prima cosa si dovrà creare un file CMakeLists nella parte superiore della directory del codice sorgente. Come sempre, questo file dovrebbe iniziare col comando :command:`cmake_minimum_required` e :command:`project` che definisce il nome del progetto CMake. Questo diventerà il nome della solution di Visual Studio risultante. Quindi, si aggiungono tutti i file sorgente nelle variabili CMake. Per progetti di grandi dimensioni che dispongono di più directory, creare un file CMakeLists in ciascuna directory come descritto nella sezione sulle strutture delle directory dei sorgenti all'inizio di questo capitolo. Si aggiungeranno poi le librerie e gli eseguibili usando :command:`add_library` e :command:`add_executable`. Per default, :command:`add_executable` presuppone che l'eseguibile sia un'applicazione console. L'aggiunta dell'argomento ``WIN32`` a :command:`add_executable` indica che si tratta di un'applicazione Windows (che utilizza WinMain invece di main).

source: There are a few nice features that Visual Studio supports and CMake can take advantage of. One is support for class browsing. Typically in CMake, only source files are added to a target, not header files. If you add header files to a target, they will show up in the workspace and then you will be able to browse them as usual. Visual Studio also supports the notion of groups of files. By default, CMake creates groups for source files and header files. Using the :command:`source_group` command, you can create your own groups and assign files to them. If you have any custom build steps in your workspace, these can be added to your CMakeLists files using the :command:`add_custom_command` command. Custom targets (Utility Targets) in Visual Studio can be added with the :command:`add_custom_target` command.
it: Ci sono alcune caratteristiche interessanti che Visual Studio supporta e di cui CMake può trarre vantaggio. Uno è il supporto per la navigazione tra le classi. In genere in CMake, solo i file sorgenti vengono aggiunti a un target, non i file header. Se si aggiungono i file header a un target, questi verranno visualizzati nel workspace e si potranno sfogliare come al solito. Visual Studio supporta anche la nozione di gruppi di file. Per default, CMake crea gruppi per file sorgenti e file header. Usando il comando :command:`source_group`, si possono creare i propri gruppi e assegnare loro dei file. Se si hanno passaggi di build personalizzati nel workspace, questi possono essere aggiunti ai file CMakeLists utilizzando il comando :command:`add_custom_command`. I target custom (Utility Target) in Visual Studio possono essere aggiunti con il comando :command:`add_custom_target`.

source: Cross Compiling With CMake
it: Cross Compilazione Con CMake

source: Cross-compiling a piece of software means that the software is built on one system, but is intended to run on a different system. The system used to build the software will be called the "build host," and the system for which the software is built will be called the "target system" or "target platform." The target system usually runs a different operating system (or none at all) and/or runs on different hardware. A typical use case is in software development for embedded devices like network switches, mobile phones, or engine control units. In these cases, the target platform doesn't have or is not able to run the required software development environment.
it: Cross-compilare un software significa che questo viene compilato su un sistema, ma è destinato a funzionare su un sistema diverso. Il sistema utilizzato per buildare il software sarà chiamato "build host" e il sistema per il quale il software è costruito sarà chiamato "sistema target" o "piattaforma target". Il sistema target di solito esegue un sistema operativo diverso (o nessuno) e/o viene eseguito su hardware diverso. Un caso d'uso tipico è nello sviluppo di software per dispositivi embedded come switch di rete, telefoni cellulari o unità di controllo per motori. In questi casi, la piattaforma target non dispone o non è in grado di eseguire l'ambiente di sviluppo software richiesto.

source: Cross-compiling is fully supported by CMake, ranging from cross-compiling from Linux to Windows; cross-compiling for supercomputers, through to cross-compiling for small embedded devices without an operating system (OS).
it: La Cross-compilazione è completamente supportata da CMake, dalla quella da Linux a Windows; cross-compilazione per supercomputer, fino alla cross-compilazione per piccoli dispositivi embedded senza sistema operativo (OS).

source: Cross-compiling has several consequences for CMake:
it: La cross-compilazione ha diverse conseguenze per CMake:

source: CMake cannot automatically detect the target platform.
it: CMake non è in grado di rilevare automaticamente la piattaforma target.

source: CMake cannot find libraries and headers in the default system directories.
it: CMake non riesce a trovare librerie e header nelle directory di sistema di default.

source: Executables built during cross compiling cannot be executed.
it: Gli eseguibili creati durante la cross-compilazione non possono essere eseguiti.

source: Cross-compiling support doesn't mean that all CMake-based projects can be magically cross-compiled out-of-the-box (some are), but that CMake separates between information about the build platform and target platform and gives the user mechanisms to solve cross-compiling issues without additional requirements such as running virtual machines, etc.
it: Il supporto cross-compilazione non significa che tutti i progetti basati su CMake possono essere compilati magicamente in modo incrociato (alcuni lo sono), ma che CMake separa le informazioni sulla piattaforma di build e sulla piattaforma target e fornisce all'utente meccanismi per risolvere problemi di cross-compilazione senza requisiti aggiuntivi come l'esecuzione di macchine virtuali, ecc.

source: To support cross-compiling for a specific software project, CMake must to be told about the target platform via a toolchain file. The CMakeLists.txt may have to be adjusted it is are aware that the build platform may have different properties than the target platform, and it has to deal with the instances where a compiled executable tries to execute on the build host.
it: Per supportare la cross-compilazione per un progetto specifico, è necessario comunicare a CMake la piattaforma target tramite un file toolchain. Potrebbe essere necessario modificare CMakeLists.txt, è consapevole che la piattaforma di build potrebbe avere proprietà diverse rispetto a quella target e deve gestire le istanze in cui un eseguibile compilato tenta di essere eseguito sull'host di build.

source: Toolchain Files
it: I File Toolchain

source: In order to use CMake for cross-compiling, a CMake file that describes the target platform has to be created, called the "toolchain file," This file tells CMake everything it needs to know about the target platform. Here is an example that uses the MinGW cross-compiler for Windows under Linux; the contents will be explained line-by-line afterwards.
it: Per utilizzare CMake per la cross-compilazione, è necessario creare un file CMake che descriva la piattaforma target, chiamato "file di toolchain", questo file dice a CMake tutto ciò che deve sapere sulla piattaforma target. Ecco un esempio che utilizza il cross-compilatore MinGW per Windows sotto Linux; i contenuti verranno spiegati riga per riga in seguito.

source: Assuming that this file is saved with the name TC-mingw.cmake in your home directory, you instruct CMake to use this file by setting the :variable:`CMAKE_TOOLCHAIN_FILE` variable::
it: Supponendo che questo file sia salvato con il nome TC-mingw.cmake nella home directory, si istruisce CMake a utilizzare questo file impostando la variabile :variable:`CMAKE_TOOLCHAIN_FILE`::

source: :variable:`CMAKE_TOOLCHAIN_FILE` has to be specified only on the initial CMake run; after that, the results are reused from the CMake cache. You don't need to write a separate toolchain file for every piece of software you want to build. The toolchain files are per target platform; i.e. if you are building several software packages for the same target platform, you only have to write one toolchain file that can be used for all packages.
it: :variable:`CMAKE_TOOLCHAIN_FILE` deve essere specificato solo durante l'esecuzione iniziale di CMake; successivamente, i risultati vengono riutilizzati dalla cache di CMake. Non è necessario scrivere un file di toolchain separato per ogni software che si desidera creare. I file toolchain sono per piattaforma target; cioè se si stanno creando diversi pacchetti software per la stessa piattaforma target, si deve solo scrivere un file toolchain che possa essere utilizzato per tutti i pacchetti.

source: What do the settings in the toolchain file mean? We will examine them one-by-one. Since CMake cannot guess the target operating system or hardware, you have to set the following CMake variables:
it: Cosa significano le impostazioni nel file toolchain? Li esamineremo una per una. Poiché CMake non è in grado di indovinare il sistema operativo o l'hardware target, è necessario impostare le seguenti variabili CMake:

source: This variable is mandatory; it sets the name of the target system, i.e. to the same value as ``CMAKE_SYSTEM_NAME`` would have if CMake were run on the target system. Typical examples are "Linux" and "Windows." It is used for constructing the file names of the platform files like Linux.cmake or Windows-gcc.cmake. If your target is an embedded system without an OS, set ``CMAKE_SYSTEM_NAME`` to "Generic." Presetting ``CMAKE_SYSTEM_NAME`` this way instead of being detected, automatically causes CMake to consider the build a cross-compiling build and the CMake variable :variable:`CMAKE_CROSSCOMPILING` will be set to TRUE. ``CMAKE_CROSSCOMPILING`` is the variable that should be tested in CMake files to determine whether the current build is a cross-compiled build or not.
it: Questa variabile è obbligatoria; imposta il nome del sistema target, ovvero allo stesso valore che ``CMAKE_SYSTEM_NAME`` avrebbe se CMake fosse eseguito sul sistema target. Esempi tipici sono "Linux" e "Windows". Viene utilizzato per costruire i nomi dei file della piattaforma come Linux.cmake o Windows-gcc.cmake. Se il target è un sistema embedded senza sistema operativo, si imposta ``CMAKE_SYSTEM_NAME`` su "Generic". La preimpostazione di ``CMAKE_SYSTEM_NAME`` in questo modo, invece di essere rilevata, fa sì che CMake consideri automaticamente la build una cross-compilazione e la variabile CMake :variable:`CMAKE_CROSSCOMPILING` verrà impostata su TRUE. ``CMAKE_CROSSCOMPILING`` è la variabile che dovrebbe essere testata nei file CMake per determinare se la build corrente è una build cross-compilata o meno.

source: Sets the version of your target system.
it: Imposta la versione del sistema target.

source: This variable is optional; it sets the processor or hardware name of the target system. It is used in CMake for one purpose, to load the ``${CMAKE_SYSTEM_NAME}-COMPILER_ID-${CMAKE_SYSTEM_PROCESSOR}.cmake`` file. This file can be used to modify settings such as compiler flags for the target. You should only have to set this variable if you are using a cross-compiler where each target needs special build settings. The value can be chosen freely, so it could be, for example, i386, IntelPXA255, or MyControlBoardRev42.
it: Questa variabile è facoltativa; imposta il nome del processore o dell'hardware del sistema target. Viene utilizzato in CMake per uno scopo, per caricare il file ``${CMAKE_SYSTEM_NAME}-COMPILER_ID-${CMAKE_SYSTEM_PROCESSOR}.cmake``. Questo file può essere utilizzato per modificare impostazioni come i flag del compilatore per il target. Si deve impostare questa variabile solo se si sta usando un cross-compilatore in cui ogni target necessita di impostazioni di build speciali. Il valore può essere scelto liberamente, quindi potrebbe essere, ad esempio, i386, IntelPXA255 o MyControlBoardRev42.
