Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: As your project's testing needs grow, keeping track of the test results can become overwhelming. This is especially true for projects that are tested nightly on a number of different platforms. In these cases, we recommend using a test dashboard to summarize the test results.
it: Man mano che le esigenze dei test del progetto crescono, la gestione dei risultati può diventare travolgente. Ciò è particolarmente vero per i progetti che vengono testati ogni notte su diverse piattaforme. In questi casi, si consiglia di utilizzare una dashboard di test per riepilogare i risultati del test.

source: A test dashboard summarizes the results for many tests on many platforms, and its hyperlinks allow people to drill down into additional levels of detail quickly. The CTest executable includes support for producing test dashboards. When run with the correct options, CTest will produce XML-based output recording the build and test results, and post them to a dashboard server. The dashboard server runs an open source software package called CDash. CDash collects the XML results and produces HTML web pages from them.
it: Un dashboard di test riassume i risultati di molti test su molte piattaforme e i suoi collegamenti ipertestuali consentono di approfondire rapidamente ulteriori livelli di dettaglio. L'eseguibile CTest include il supporto per la produzione di dashboard di test. Se eseguito con le opzioni corrette, CTest produrrà un output basato su XML registrando i risultati della build e del test e inviandoli a un server dashboard. Il server dashboard esegue un pacchetto software open source chiamato CDash. CDash raccoglie i risultati XML e da essi produce pagine Web HTML.

source: Before discussing how to use CTest to produce a dashboard, let us consider the main parts of a testing dashboard. Each night at a specified time, the dashboard server will open up a new dashboard so each day there is a new web page showing the results of tests for that twenty-four hour period. There are links on the main page that allow you to quickly navigate through different days. Looking at the main page for a project (such as CMake's dashboard off of www.cmake.org), you will see that it is divided into a few main components. Near the top you will find a set of links that allow you to step to previous dashboards, as well as links to project pages such as the bug tracker, documentation, etc.
it: Prima di discutere su come utilizzare CTest per produrre una dashboard, consideriamo le parti principali di una dashboard di test. Ogni notte a un'ora specificata, il server della dashboard aprirà una nuova dashboard, quindi ogni giorno c'è una nuova pagina web che mostra i risultati dei test per quel periodo di ventiquattro ore. Ci sono link nella pagina principale che consentono di navigare rapidamente in giorni diversi. Guardando la pagina principale di un progetto (come la dashboard di CMake su www.cmake.org), si vedrà che è divisa in alcuni componenti principali. Nella parte superiore ci sono una serie di collegamenti che consentono di passare a dashboard precedenti, nonché link a pagine di progetto come bug tracker, documentazione, ecc.

source: Below that, you will find groups of results. Typically groups that you will find include Nightly, Experimental, Continuous, Coverage, and Dynamic Analysis. The category into which a dashboard entry will be placed depends on how it was generated. The simplest are Experimental entries which represent dashboard results for someone's current copy of the project's source code. With an experimental dashboard, the source code is not guaranteed to be up to date. In contrast a Nightly dashboard entry is one where CTest tries to update the source code to a specific date and time. The expectation is that all nightly dashboard entries for a given day should be based on the same source code.
it: Sotto, si trovano gruppi di risultati. In genere i gruppi includono Nightly, Experimental, Continuous, Coverage e Dynamic Analysis. La categoria in cui verrà inserita una voce della dashboard dipende da come è stata generata. Le più semplici sono voci Experimental che rappresentano i risultati della dashboard per la copia corrente di qualcuno del codice sorgente del progetto. Con una dashboard sperimentale, non è garantito che il codice sorgente sia aggiornato. Al contrario, una voce della dashboard Nightly è quella in cui CTest tenta di aggiornare il codice sorgente a una data e un'ora specifiche. L'aspettativa è che tutte le voci del dashboard nightly per un determinato giorno siano basate sullo stesso codice sorgente.

source: A continuous dashboard entry is one that is designed to run every time new files are checked in. Depending on how frequently new files are checked in a single day's dashboard could have many continuous entries. Continuous dashboards are particularly helpful for cross platform projects where a problem may only show up on some platforms. In those cases a developer can commit a change that works for them on their platform and then another platform running a continuous build could catch the error, allowing the developer to correct the problem promptly.
it: Una voce nelle dashboard Continuous viene eseguita ogni volta che vengono archiviati nuovi file. A seconda della frequenza con cui i nuovi file vengono controllati, la dashboard di un singolo giorno potrebbe avere molte voci. Le dashboard Continuous sono particolarmente utili per i progetti multipiattaforma in cui un problema può presentarsi solo su alcune piattaforme. In questi casi uno sviluppatore può eseguire il commit di una modifica che funziona per loro sulla propria piattaforma e poi un'altra piattaforma che esegue una build continua potrebbe rilevare l'errore, consentendo allo sviluppatore di correggere il problema prontamente.

source: Dynamic Analysis and Coverage dashboards are designed to test the memory safety and code coverage of a project. A Dynamic Analysis dashboard entry is one where all the tests are run with a memory access/leak checking program enabled. Any resulting errors or warnings are parsed, summarized and displayed. This is important to verify that your software is not leaking memory, or reading from uninitialized memory. Coverage dashboard entries are similar in that all the tests are run, but as they are the lines of code being executed are tracked. When all the tests have been run, a listing of how many times each line of code was executed is produced and displayed on the dashboard.
it: Le dashboard Dynamic Analysis e Coverage sono progettate per testare la sicurezza della memoria e la copertura del codice di un progetto. Una voce nella dashboard Dynamic Analysis è quella in cui tutti i test vengono eseguiti con un programma per la memoria riguardo l'accesso e il controllo dei leak abilitato. Eventuali errori o warning risultanti vengono analizzati, riepilogati e visualizzati. Questo è importante per verificare che il software non stia perdendo memoria [leak] o leggendo dalla memoria non inizializzata. Le voci della dashboard Coverage sono simili in quanto vengono eseguiti tutti i test, ma poiché sono le righe di codice in esecuzione, vengono monitorate. Quando tutti i test sono stati eseguiti, viene prodotto e visualizzato sulla dashboard un elenco di quante volte ciascuna riga di codice è stata eseguita.

source: Adding CDash Dashboard Support to a Project
it: Aggiungere il Supporto CDash Dashboard a un Progetto

source: The easiest way to start using CDash is to register an account and create a new project at https://my.cdash.org.
it: Il modo più semplice per iniziare a utilizzare CDash è registrare un account e creare un nuovo progetto su https://my.cdash.org.

source: If you'd prefer to install your own CDash server, please follow one of these guides:
it: Se si preferisce installare il proprio server CDash, seguire una di queste guide:

source: Client Setup
it: Configurazione del Client

source: To support dashboards in your project you need to include the :module:`CTest` module as follows.
it: Per supportare le dashboard nel progetto si deve includere il modulo :module:`CTest` come segue.

source: The CTest module will then read settings from the ``CTestConfig.cmake`` file you created or downloaded from CDash. If you have added :command:`add_test` command calls to your project creating a dashboard entry is as simple as running::
it: Il modulo CTest leggerà quindi le impostazioni dal file ``CTestConfig.cmake`` creato o scaricato da CDash. Se sono state aggiunte chiamate al comando :command:`add_test` al progetto, creare una voce della dashboard è semplice come eseguire::

source: The ``-D`` option tells CTest to create a dashboard entry. The next argument indicates what type of dashboard entry to create. Creating a dashboard entry involves quite a few steps that can be run independently, or as one command. In this example, the Experimental argument will cause CTest to perform a number of different steps as one command. The different steps of creating a dashboard entry are summarized below.
it: L'opzione ``-D`` indica a CTest di creare una voce della dashboard. L'argomento successivo indica il tipo di voce della dashboard da creare. La creazione di una voce della dashboard comporta alcuni passaggi che possono essere eseguiti in modo indipendente o come un unico comando. In questo esempio, l'argomento Experimental farà in modo che CTest esegua una serie di passaggi diversi come un unico comando. Di seguito sono riepilogate le diverse fasi della creazione di una voce della dashboard.

source: Prepare a new dashboard entry. This creates a ``Testing`` subdirectory in the build directory. The ``Testing`` subdirectory will contain a subdirectory for the dashboard results with a name that corresponds to the dashboard time. The ``Testing`` subdirectory will also contain a subdirectory for the temporary testing results called ``Temporary``.
it: Prepara una nuova voce della dashboard. Questo crea una sottodirectory ``Testing`` nella directory di build. La sottodirectory ``Testing`` conterrà una sottodirectory per i risultati della dashboard con un nome che corrisponde all'ora della dashboard. La sottodirectory ``Testing`` conterrà anche una sottodirectory per i risultati temporanei dei test chiamata ``Temporary``.

source: Perform a source control update of the source code (typically used for nightly or continuous runs). Currently CTest supports Concurrent Versions System (CVS), Subversion, Git, Mercurial, and Bazaar.
it: Esegue un aggiornamento del controllo del codice sorgente (in genere utilizzato per esecuzioni notturne o 'continuous'). Attualmente CTest supporta Concurrent Versions System (CVS), Subversion, Git, Mercurial e Bazaar.

source: Run CMake on the project to make sure the Makefiles or project files are up to date.
it: Esegue CMake sul progetto per assicurare che i Makefile o i file di progetto siano aggiornati.

source: Build the software using the specified generator.
it: Build del software utilizzando il generatore specificato.

source: Run all the tests and record the results.
it: Esegue tutti i test e registra i risultati.

source: Perform memory checks using Purify or valgrind.
it: Esegue i controlli della memoria usando Purify o valgrind.

source: Collect source code coverage information using gcov or Bullseye.
it: Raccoglie informazioni sulla copertura del codice sorgente utilizzando gcov o Bullseye.

source: Submit the testing results as a dashboard entry to the server.
it: Invia i risultati del test come voce della dashboard al server.

source: Each of these steps can be run independently for a Nightly or Experimental entry using the following syntax::
it: Ciascuno di questi passaggi può essere eseguito indipendentemente per una voce Nightly o Experimental utilizzando la seguente sintassi::

source: or
it: oppure

source: Alternatively, you can use shortcuts that perform the most common combinations all at once. The shortcuts that CTest has defined include:
it: In alternativa, si possono utilizzare le scorciatoie che eseguono le combinazioni più comuni tutte in una volta. Le [shortcut] che CTest ha definito includono:

source: performs the start, configure, build, test, coverage, and submit commands.
it: esegue i comandi start, configure, build, test, coverage e submit.

source: performs the start, update, configure, build, test, coverage, and submit commands.
it: esegue i comandi start, update, configure, build, test, coverage e submit.

source: performs the start, configure, build, memorycheck, coverage, and submit commands.
it: esegue i comandi start, configure, build, memorycheck, coverage e submit.

source: When first setting up a dashboard it is often useful to combine the ``-D`` option with the ``-V`` option. This will allow you to see the output of all the different stages of the dashboard process. Likewise, CTest maintains log files in the ``Testing/Temporary`` directory it creates in your binary tree. There you will find log files for the most recent dashboard run. The dashboard results (XML files) are stored in the ``Testing`` directory as well.
it: Quando si configura per la prima volta una dashboard è spesso utile combinare l'opzione ``-D`` con la ``-V``. Ciò consentirà di vedere l'output di tutte le diverse fasi del processo della dashboard. Allo stesso modo, CTest mantiene i file di log nella directory ``Testing/Temporary`` che crea nell'albero binario. Lì ci sono i file di log per l'esecuzione più recente della dashboard. Anche i risultati della dashboard (file XML) vengono archiviati nella directory ``Testing``.

source: Customizing Dashboards for a Project
it: Personalizzazione di una Dashboard per un Progetto

source: CTest has a few options that can be used to control how it processes a project. If, when CTest runs a dashboard, it finds ``CTestCustom.ctest`` files in the binary tree, it will load these files and use the settings from them to control its behavior. The syntax of a CTestCustom file is the same as regular CMake syntax. That said, only set commands are normally used in this file. These commands specify properties that CTest will consider when performing the testing.
it: CTest ha alcune opzioni che possono essere utilizzate per controllare come elabora un progetto. Se, quando CTest esegue una dashboard, trova i file ``CTestCustom.ctest`` nell'albero binario, caricherà questi file e utilizzerà le relative impostazioni per controllarne il comportamento. La sintassi di un file CTestCustom è la stessa della normale sintassi di CMake. Detto questo, in questo file vengono normalmente utilizzati solo i comandi set. Questi comandi specificano le proprietà che CTest prenderà in considerazione durante l'esecuzione del test.

source: Dashboard Submissions Settings
it: Impostazioni degli Invii della Dashboard

source: A number of the basic dashboard settings are provided in the file that you download from CDash. You can edit these initial values and provide additional values if you wish. The first value that is set is the nightly start time. This is the time that dashboards all around the world will use for checking out their copy of the nightly source code. This time also controls how dashboard submissions will be grouped together. All submissions from the nightly start time until the next nightly start time will be included on the same "day".
it: Alcune delle impostazioni di base della dashboard sono fornite nel file scaricato da CDash. È possibile modificare questi valori iniziali e fornire valori aggiuntivi, se lo si desidera. Il primo valore impostato è l'ora di inizio della nightly. Questo è il tempo che le dashboard di tutto il mondo utilizzeranno per controllare la loro copia del codice sorgente notturno. Questo tempo controlla anche il modo in cui gli invii della dashboard verranno raggruppati. Tutti gli invii dall'ora di inizio del nightly fino all'ora di inizio del nightly successivo saranno inclusi nello stesso "giorno".

source: The next group of settings control where to submit the testing results. This is the location of the CDash server.
it: Il prossimo gruppo di impostazioni controlla dove inviare i risultati del test. Questa è la posizione del server CDash.

source: The :variable:`CTEST_DROP_SITE` specifies the location of the CDash server. Build and test results generated by CDash clients are sent to this location. The :variable:`CTEST_DROP_LOCATION` is the directory or the HTTP URL on the server where CDash clients leave their build and test reports. The :variable:`CTEST_DROP_SITE_CDASH` specifies that the current server is CDash, which prevents CTest from trying to "trigger" the submission (this is still done if this variable is not set to allow for backwards compatibility with Dart and Dart 2).
it: :variable:`CTEST_DROP_SITE` specifica la posizione del server CDash. I risultati di build e test generati dai client CDash vengono inviati a questa posizione. :variable:`CTEST_DROP_LOCATION` è la directory o l'URL HTTP sul server in cui i client CDash lasciano i report di build e test. :variable:`CTEST_DROP_SITE_CDASH` specifica che il server corrente è CDash, il che impedisce a CTest di tentare di "trigger"-are l'invio (ciò viene comunque fatto se questa variabile non è impostata per consentire la retrocompatibilità con Dart e Dart 2).

source: Currently CDash supports only the HTTP drop submission method; however CTest supports other submission types. The :variable:`CTEST_DROP_METHOD` specifies the method used to submit testing results. The most common setting for this will be HTTP which uses the Hyper Text Transfer Protocol (HTTP) to transfer the test data to the server. Other drop methods are supported for special cases such as FTP and SCP. In the example below, clients that are submitting their results using the HTTP protocol use a web address as their drop site. If the submission is via FTP, this location is relative to where the :variable:`CTEST_DROP_SITE_USER` will log in by default. The :variable:`CTEST_DROP_SITE_USER` specifies the FTP username the client will use on the server. For FTP submissions this user will typically be "anonymous". However, any username that can communicate with the server can be used. For FTP servers that require a password, it can be stored in the :variable:`CTEST_DROP_SITE_PASSWORD` variable. The ``CTEST_DROP_SITE_MODE`` (not used in this example) is an optional variable that you can use to specify the FTP mode. Most FTP servers will handle the default passive mode, but you can set the mode explicitly to active if your server does not.
it: Attualmente CDash supporta solo il metodo di invio drop HTTP; tuttavia CTest supporta altri tipi di invio. :variable:`CTEST_DROP_METHOD` specifica il metodo utilizzato per inviare i risultati dei test. L'impostazione più comune per questo sarà HTTP che utilizza il protocollo HTTP (Hyper Text Transfer Protocol) per trasferire i dati del test al server. Altri metodi di rilascio sono supportati per casi speciali come FTP e SCP. Nell'esempio seguente, i client che inviano i propri risultati utilizzando il protocollo HTTP utilizzano un indirizzo Web come sito di destinazione. Se l'invio avviene tramite FTP, questa posizione è relativa a dove :variable:`CTEST_DROP_SITE_USER` effettuerà l'accesso per default. :variable:`CTEST_DROP_SITE_USER` specifica il nome utente FTP che il client utilizzerà sul server. Per gli invii FTP questo utente sarà tipicamente "anonymous". Tuttavia, è possibile utilizzare qualsiasi nome utente in grado di comunicare con il server. Per i server FTP che richiedono una password, può essere memorizzata nella variabile :variable:`CTEST_DROP_SITE_PASSWORD`. ``CTEST_DROP_SITE_MODE`` (non utilizzata in questo esempio) è una variabile facoltativa utilizzabile per specificare la modalità FTP. La maggior parte dei server FTP gestirà la modalità passiva di default, ma si può impostare esplicitamente la modalità su attiva se il server non lo fa.

source: CTest can also be run from behind a firewall. If the firewall allows FTP or HTTP traffic, then no additional settings are required. If the firewall requires an FTP/HTTP proxy or uses a SOCKS4 or SOCKS5 type proxy, some environment variables need to be set. HTTP_PROXY and FTP_PROXY specify the servers that service HTTP and FTP proxy requests. HTTP_PROXY_PORT and FTP_PROXY_PORT specify the port on which the HTTP and FTP proxies reside. HTTP_PROXY_TYPE specifies the type of the HTTP proxy used. The three different types of proxies supported are the default, which includes a generic HTTP/FTP proxy, "SOCKS4", and "SOCKS5", which specify SOCKS4 and SOCKS5 compatible proxies.
it: CTest può anche essere eseguito da dietro un firewall. Se il firewall consente il traffico FTP o HTTP, non sono necessarie impostazioni aggiuntive. Se il firewall richiede un proxy FTP/HTTP o utilizza un proxy di tipo SOCKS4 o SOCKS5, è necessario impostare alcune variabili di ambiente. HTTP_PROXY e FTP_PROXY specificano i server che gestiscono le richieste di proxy HTTP e FTP. HTTP_PROXY_PORT e FTP_PROXY_PORT specificano la porta su cui risiedono i proxy HTTP e FTP. HTTP_PROXY_TYPE specifica il tipo di proxy HTTP utilizzato. I tre diversi tipi di proxy supportati sono quelli di default, che includono un proxy HTTP/FTP generico, "SOCKS4" e "SOCKS5", che specificano i proxy compatibili con SOCKS4 e SOCKS5.

source: Filtering Errors and Warnings
it: Filtraggio di Errori e Warning

source: By default, CTest has a list of regular expressions that it matches for finding the errors and warnings from the output of the build process. You can override these settings in your ``CTestCustom.ctest`` files using several variables as shown below.
it: Per default, CTest dispone di un elenco di espressioni regolari a cui corrisponde per trovare gli errori e gli avvisi dall'output del processo di build. Queste impostazioni si possono sovrascrivere nei file ``CTestCustom.ctest`` utilizzando diverse variabili come mostrato di seguito.

source: Another useful feature of the CTestCustom files is that you can use it to limit the tests that are run for memory checking dashboards. Memory checking using purify or valgrind is a CPU intensive process that can take twenty hours for a dashboard that normally takes one hour. To help alleviate this problem, CTest allows you to exclude some of the tests from the memory checking process as follows:
it: Un'altra caratteristica utile dei file CTestCustom è che è possibile utilizzarlo per limitare i test eseguiti per le dashboard di controllo della memoria. Il controllo della memoria con purify o valgrind è un processo ad alta intensità di CPU che può richiedere venti ore per una dashboard che normalmente richiede un'ora. Per alleviare questo problema, CTest consente di escludere alcuni dei test dal processo di controllo della memoria come segue:

source: The format for excluding tests is simply a list of test names as specified when the tests were added in your CMakeLists file with :command:`add_test`.
it: Il formato per escludere i test è semplicemente un elenco di nomi di test come specificato quando i test sono stati aggiunti nel file CMakeLists con :command:`add_test`.

source: In addition to the demonstrated settings, such as ``CTEST_CUSTOM_WARNING_MATCH``, ``CTEST_CUSTOM_WARNING_EXCEPTION``, and ``CTEST_CUSTOM_MEMCHECK_IGNORE``, CTest also checks several other variables.
it: Oltre alle impostazioni mostrate, come ``CTEST_CUSTOM_WARNING_MATCH``, ``CTEST_CUSTOM_WARNING_EXCEPTION`` e ``CTEST_CUSTOM_MEMCHECK_IGNORE``, CTest controlla anche diverse altre variabili.

source: Additional regular expressions to consider a build line as an error line
it: Espressioni regolari aggiuntive per considerare una riga di build come una riga di errore
