Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: This section describes how to configure CPack to generate component-based installers that allow users to select the set of project components that they wish to install. As an example, a simple installer will be created for a library that has three components: a library binary, a sample application, and a C++ header file. When finished the resulting installers for Windows and Mac OS X look like the ones in Figure :num:`figure-MacandWindowsComponentInstallers`.
it: Questa sezione descrive come configurare CPack per generare programmi di installazione basati su componenti che consentano agli utenti di selezionare il set di componenti del progetto che desiderano installare. Ad esempio, verrà creato un semplice programma di installazione per una libreria che ha tre componenti: un binario di libreria, un'applicazione di esempio e un file header C++. Al termine, i programmi di installazione risultanti per Windows e Mac OS X sono simili a quelli in Figura :num:`figure-MacandWindowsComponentInstallers`.

source: Mac and Windows Component Installers
it: Installer di componenti per Mac e Windows

source: The simple example we will be working with is as follows; it has a library and an executable. CPack commands that have already been covered are used.
it: Il semplice esempio con cui lavoreremo è il seguente; ha una libreria e un eseguibile. Vengono utilizzati i comandi CPack già trattati.

source: Specifying Components
it: Specifica dei Componenti

source: The first step in building a component-based installation is to identify the set of installable components. In this example, three components will be created: the library binary, the application, and the header file. This decision is arbitrary and project-specific, but be sure to identify the components that correspond to units of functionality important to your user, rather than basing the components on the internal structure of your program.
it: Il primo passo nella creazione di un'installazione basata su componenti consiste nell'identificare l'insieme di componenti installabili. In questo esempio verranno creati tre componenti: il file binario della libreria, l'applicazione e il file header. Questa decisione è arbitraria e specifica del progetto, ma si devono identificare i componenti che corrispondono alle unità di funzionalità importanti per l'utente, piuttosto che basare i componenti sulla struttura interna del programma.

source: For each of these components, we need to identify which component each of the installed files belong in. For each :command:`install` command in CMakeLists.txt, add an appropriate ``COMPONENT`` argument stating which component the installed files will be associated with:
it: Per ciascuno di questi componenti, dobbiamo identificare a quale componente appartiene ciascuno dei file installati. Per ogni comando :command:`install` in CMakeLists.txt, si aggiunge un argomento ``COMPONENT`` appropriato che indichi a quale componente saranno associati i file installati:

source: Note that the ``COMPONENT`` argument to the :command:`install` command is not new; it has been a part of CMake's :command:`install` are using any of the older installation commands (:command:`install_targets`, :command:`install_files`, etc.), you will need to convert them to :command:`install` commands in order to use components.
it: Si noti che l'argomento ``COMPONENT`` del comando :command:`install` non è nuovo; ha fatto parte di CMake :command:`install` utilizza uno qualsiasi dei comandi di installazione precedenti (:command:`install_targets`, :command:`install_files`, ecc.), si dovranno convertirli in comandi :command:`install` per poter utilizzare i componenti.

source: The next step is to notify CPack of the names of all of the components in your project by calling the ``cpack_add_component`` function for each component of the package:
it: Il passo successivo consiste nel notificare a CPack i nomi di tutti i componenti del progetto chiamando la funzione ``cpack_add_component`` per ciascun componente del pacchetto:

source: At this point you can build a component-based installer with CPack that will allow one to independently install the applications, libraries, and headers of MyLib. The Windows and Mac OS X installers will look like the ones shown in Figure :num:`figure-WindowsandMacOSXComponentInstallerFirstPage`.
it: A questo punto si può creare un programma di installazione basato su componenti con CPack che consentirà di installare in modo indipendente le applicazioni, le librerie e gli header di MyLib. I programmi di installazione di Windows e Mac OS X saranno simili a quelli mostrati in Figura :num:`figure-WindowsandMacOSXComponentInstallerFirstPage`.

source: Windows and Mac OS X Component Installer First Page
it: Prima pagina del programma di installazione dei componenti di Windows e Mac OS X

source: Naming Components
it: Denominazione dei Componenti

source: At this point, you may have noted that the names of the actual components in the installer are not very descriptive: they just say "applications," "libraries," or "headers," as specified in the component names. These names can be improved by using the DISPLAY_NAME option in the ``cpack_add_component function``:
it: A questo punto, si può notare che i nomi dei componenti effettivi nel programma di installazione non sono molto descrittivi: dicono semplicemente "applicazioni", "librerie" o "header", come specificato nei nomi dei componenti. Questi nomi possono essere migliorati utilizzando l'opzione DISPLAY_NAME in ``cpack_add_component function``:

source: Any macro prefixed with ``CPACK_COMPONENT_${COMPNAME}``, where ``${COMPNAME}`` is the uppercase name of a component, is used to set a particular property of that component in the installer. Here, we set the ``DISPLAY_NAME`` property of each of our components so that we get human-readable names. These names will be listed in the selection box rather than the internal component names "applications," "libraries," "headers,"
it: Qualsiasi macro con prefisso ``CPACK_COMPONENT_${COMPNAME}``, dove ``${COMPNAME}`` è il nome maiuscolo di un componente, è utilizzato per impostare una particolare proprietà di quel componente nel programma di installazione. Qui, impostiamo la proprietà ``DISPLAY_NAME`` di ciascuno dei nostri componenti in modo da ottenere nomi leggibili. Questi nomi verranno elencati nella casella di selezione anziché i nomi dei componenti interni "applications", "libraries", "headers",

source: Windows and Mac OS X Installers with named components
it: Programmi di installazione per Windows e Mac OS X con i nomi dei componenti

source: Adding Component Descriptions
it: Aggiungere le Descrizioni dei Componenti

source: There are several other properties associated with components, including the ability to make a component hidden, required, or disabled by default, that provide additional descriptive information. Of particular note is the ``DESCRIPTION`` property, which provides some descriptive text for the component. This descriptive text will show up in a separate "description" box in the installer, and will be updated either when the user's mouse hovers over the name of the corresponding component (Windows), or when the user clicks on a component (Mac OS X). We will add a description for each of our components below:
it: Esistono diverse altre proprietà associate ai componenti, inclusa la possibilità di rendere un componente nascosto, richiesto o disabilitato per default, che forniscono ulteriori informazioni descrittive. Di particolare rilievo è la proprietà ``DESCRIPTION``, che fornisce del testo descrittivo per il componente. Questo testo descrittivo verrà visualizzato in una casella "description" separata nel programma di installazione e verrà aggiornato quando il mouse dell'utente passa sopra il nome del componente corrispondente (Windows) o quando l'utente fa clic su un componente (Mac OS X ). Di seguito aggiungeremo una descrizione per ciascuno dei nostri componenti:

source: Generally, descriptions should provide enough information for the user to make a decision on whether to install the component, but should not themselves be more than a few lines long (the "Description" box in the installers tends to be small). Figure :num:`figure-ComponentInstallerswithdescriptions` shows the description display for both the Windows and Mac OS X installers.
it: Generalmente, le descrizioni dovrebbero fornire all'utente informazioni sufficienti per decidere se installare il componente, ma non dovrebbero esse stesse essere più lunghe di qualche riga (la casella "Descrizione" nei programmi di installazione tende ad essere piccola). La Figura :num:`figure-ComponentInstallerswithdescriptions` mostra la visualizzazione della descrizione per i programmi di installazione di Windows e Mac OS X.

source: Component Installers with descriptions
it: Installer di componenti con descrizioni

source: Component Interdependencies
it: Interdipendenze dei Componenti

source: With most projects the various components are not completely independent. For example, an application component may depend on the shared libraries in another component to execute properly, such that installing the application component without the corresponding shared libraries would result in an unusable installation. CPack allows you to express the dependencies between components, so that a component will only be installed if all of the other components it depends on are also installed.
it: Nella maggior parte dei progetti i vari componenti non sono completamente indipendenti. Ad esempio, un componente dell'applicazione può dipendere dalle librerie shared in un altro componente per essere eseguito correttamente, in modo tale che l'installazione del componente dell'applicazione senza le corrispondenti librerie condivise risulterebbe in un'installazione inutilizzabile. CPack consente di esprimere le dipendenze tra i componenti, in modo che un componente venga installato solo se sono installati anche tutti gli altri componenti da cui dipende.

source: To illustrate component dependencies we will place a simple restriction on our component-based installer. Since we do not provide source code in our installer, the C++ header files we distribute can only actually be used if the user also installs the library binary to link their program against. Thus, the "headers" component depends on the availability of the "libraries" component. We can express this notion by setting the ``DEPENDS`` property for the ``HEADERS`` component as such:
it: Per illustrare le dipendenze dei componenti inseriremo una semplice restrizione sul nostro programma di installazione basato sui componenti. Poiché non forniamo il codice sorgente nel nostro programma di installazione, i file header C++ che distribuiamo possono essere effettivamente utilizzati solo se l'utente installa anche la libreria binaria per linkare il proprio programma. Pertanto, il componente "headers" dipende dalla disponibilità del componente "libraries". Possiamo esprimere questa nozione impostando la proprietà ``DEPENDS`` per il componente ``HEADERS`` come:

source: The ``DEPENDS`` property for a component is actually a list, as such a component can depend on several other components. By expressing all of the component dependencies in this manner you can ensure that users will not be able to select an incomplete set of components at installation time.
it: La proprietà ``DEPENDS`` per un componente è in realtà un elenco, in quanto tale componente può dipendere da molti altri componenti. Esprimendo tutte le dipendenze dei componenti in questo modo, è possibile garantire che gli utenti non siano in grado di selezionare un insieme incompleto di componenti al momento dell'installazione.

source: Grouping Components
it: Raggruppamento di Componenti

source: When the number of components in your project grows large, you may need to provide additional organization for the list of components. To help with this organization, CPack includes the notion of component groups. A component group is simply a way to provide a name for a group of related components. Within the user interface a component group has its own name, and underneath that group are the names of all of the components in that group. Users will have the option to (de-)select the installation of all components in the group with a single click, or expand the group to select individual components.
it: Quando il numero di componenti nel progetto aumenta, potrebbe essere necessario fornire un'organizzazione aggiuntiva per l'elenco dei componenti. Per aiutare con questa organizzazione, CPack include la nozione di gruppi di componenti. Un gruppo di componenti è semplicemente un modo per fornire un nome a un gruppo di componenti correlati. All'interno dell'interfaccia utente un gruppo di componenti ha il proprio nome e sotto quel gruppo ci sono i nomi di tutti i componenti in quel gruppo. Gli utenti avranno la possibilità di (de)selezionare l'installazione di tutti i componenti nel gruppo con un solo clic o di espandere il gruppo per selezionare singoli componenti.

source: We will expand our example by categorizing its three components, "applications," "libraries," and "headers," into "Runtime" and "Development" groups. We can place a component into a group by using the ``GROUP`` option to the ``cpack_add_component`` function as follows:
it: Amplieremo il nostro esempio categorizzando i suoi tre componenti, "applications", "libraries" e "headers", nei gruppi "Runtime" e "Development". Possiamo inserire un componente in un gruppo utilizzando l'opzione ``GROUP`` della funzione ``cpack_add_component`` come segue:

source: Like components, component groups have various properties that can be customized, including the ``DISPLAY_NAME`` and ``DESCRIPTION``. For example, the following code adds an expanded description to the "Development" group:
it: Come i componenti, i gruppi di componenti hanno varie proprietà che possono essere personalizzate, tra cui ``DISPLAY_NAME`` e ``DESCRIPTION``. Ad esempio, il codice seguente aggiunge una descrizione espansa al gruppo "Development":

source: Once you have customized the component groups to your liking, rebuild the binary installer to see the new organization: the MyLib application will show up under the new "Runtime" group, while the MyLib library and C++ header will show up under the new "Development" group. One can easily turn on/off all of the components within a group using the installer's GUI. This can be seen in Figure :num:`figure-ComponentGrouping`.
it: Dopo aver personalizzato i gruppi di componenti a proprio piacimento, ricostruire l'installer binario per vedere la nuova organizzazione: l'applicazione MyLib verrà visualizzata sotto il nuovo gruppo "Runtime", mentre la libreria MyLib e l'intestazione C++ verranno visualizzate sotto il nuovo gruppo "Development". È possibile attivare/disattivare facilmente tutti i componenti all'interno di un gruppo utilizzando la GUI dell'installatore. Questo può essere visto in Figura :num:`figure-ComponentGrouping`.

source: Component Grouping
it: Raggruppamento dei componenti

source: Installation Types (NSIS Only)
it: Tipi di Installazione (solo NSIS)

source: When a project contains a large number of components, it is common for a Windows installer to provide pre-selected sets of components based on specific user needs. For example, a user wanting to develop software against a library will want one set of components, while an end user might use an entirely different set. CPack supports this notion of pre-selected component sets via installation types. An installation type is simply a set of components. When the user selects an installation type, exactly that set of components is selected. Then the user is permitted to further customize their installation as desired. Currently this is only supported by the NSIS generator.
it: Quando un progetto contiene un numero elevato di componenti, è normale che un programma di installazione di Windows fornisca set di componenti preselezionati in base alle esigenze specifiche dell'utente. Ad esempio, un utente che desidera sviluppare software per una libreria vorrà un set di componenti, mentre un utente finale potrebbe utilizzare un set completamente diverso. CPack supporta questa nozione di set di componenti preselezionati tramite i tipi di installazione. Un tipo di installazione è semplicemente un insieme di componenti. Quando l'utente seleziona un tipo di installazione, viene selezionato esattamente quel set di componenti. Quindi l'utente può personalizzare ulteriormente la propria installazione come desiderato. Attualmente questo è supportato solo dal generatore NSIS.

source: For our simple example, we will create two installation types: a "Full" installation type that contains all of the components, and a "Developer" installation type that includes only the libraries and headers. To do this we use the function ``cpack_add_install_type`` to add the types.
it: Per il nostro semplice esempio, creeremo due tipi di installazione: un tipo di installazione "Full" che contiene tutti i componenti e un tipo di installazione "Developer" che include solo le librerie e gli header. Per fare questo usiamo la funzione ``cpack_add_install_type`` per aggiungere i tipi.

source: Next, we set the ``INSTALL_TYPES`` property of each component to state which installation types will include that component. This is done with the INSTALL_TYPES option to the ``cpack_add_component`` function.
it: Successivamente, impostiamo la proprietà ``INSTALL_TYPES`` di ogni componente per indicare quali tipi di installazione includeranno quel componente. Questo viene fatto con l'opzione INSTALL_TYPES della funzione ``cpack_add_component``.

source: Components can be listed under any number of installation types. If you rebuild the Windows installer, the components page will contain a combo box that allows you to select the installation type, and therefore its corresponding set of components as shown in Figure :num:`figure-NSISInstallationTypes`.
it: I componenti possono essere elencati in qualsiasi numero di tipi di installazione. Se si re-builda il programma di installazione di Windows, la pagina dei componenti conterrà una "combo box" che consente di selezionare il tipo di installazione, e quindi il set di componenti corrispondente, come mostrato nella Figura :num:`figure-NSISInstallationTypes`.

source: NSIS Installation Types
it: Tipi di installazioni NSIS

source: Variables that control CPack components
it: Variabili che controllano i componenti CPack

source: The functions ``cpack_add_install_type``, ``cpack_add_component_group``, and ``cpack_add_component`` just set ``CPACK_`` variables. Those variables are described in the following list:
it: Le funzioni ``cpack_add_install_type``, ``cpack_add_component_group`` e ``cpack_add_component`` impostano semplicemente le variabili ``CPACK_``. Tali variabili sono descritte nel seguente elenco:

source: This is a list containing the names of all components that should be installed by CPack. The presence of this macro indicates that CPack should build a component-based installer. Files associated with any components not listed here or any installation commands not associated with any component will not be installed.
it: Questo è un elenco contenente i nomi di tutti i componenti che dovrebbero essere installati da CPack. La presenza di questa macro indica che CPack dovrebbe creare un programma di installazione basato su componenti. I file associati a componenti non elencati qui o comandi di installazione non associati a componenti non verranno installati.

source: The displayed name of the component ${COMPNAME}, used in graphical installers to display the component name. This value can be any string.
it: Il nome visualizzato del componente ${COMPNAME}, utilizzato nei programmi di installazione grafici per visualizzare il nome del componente. Questo valore può essere qualsiasi stringa.

source: An extended description of the component ${COMPNAME}, used in graphical installers to give the user additional information about the component. Descriptions can span multiple lines using "\n" as the line separator.
it: Una descrizione estesa del componente ${COMPNAME}, utilizzata negli installer grafici per fornire all'utente ulteriori informazioni sul componente. Le descrizioni possono estendersi su più righe utilizzando "\n" come separatore di riga.

source: A flag that indicates that this component will be hidden in the graphical installer, and therefore cannot be selected or installed. Only available with NSIS.
it: Un flag che indica che questo componente sarà nascosto nel programma di installazione grafico e quindi non potrà essere selezionato o installato. Disponibile solo con NSIS.

source: A flag that indicates that this component is required, and therefore will always be installed. It will be visible in the graphical installer but it cannot be unselected.
it: Un flag che indica che questo componente è obbligatorio e quindi sarà sempre installato. Sarà visibile nell'installer grafico ma non può essere deselezionato.

source: A flag that indicates that this component should be disabled (unselected) by default. The user is free to select this component for installation.
it: Un flag che indica che questo componente deve essere disabilitato (deselezionato) per default. L'utente è libero di selezionare questo componente per l'installazione.

source: Lists the components on which this component depends. If this component is selected, then each of the components listed must also be selected.
it: Elenca i componenti da cui dipende questo componente. Se questo componente è selezionato, è necessario selezionare anche ciascuno dei componenti elencati.

source: Names a component group that this component is a part of. If not provided, the component will be a standalone component, not part of any component group.
it: Denomina un gruppo di componenti di cui fa parte questo componente. Se non fornito, il componente sarà un componente autonomo, non farà parte di alcun gruppo di componenti.

source: Lists the installation types that this component is a part of. When one of these installations types is selected, this component will automatically be selected. Only available with NSIS.
it: Elenca i tipi di installazione di cui fa parte questo componente. Quando viene selezionato uno di questi tipi di installazione, questo componente verrà selezionato automaticamente. Disponibile solo con NSIS.

source: The displayed name of the component group ${GROUPNAME}, used in graphical installers to display the component group name. This value can be any string.
it: Il nome visualizzato del gruppo di componenti ${GROUPNAME}, utilizzato nei programmi di installazione grafici per visualizzare il nome del gruppo di componenti. Questo valore può essere qualsiasi stringa.

source: An extended description of the component group ${GROUPNAME}, used in graphical installers to give the user additional information about the components contained within this group. Descriptions can span multiple lines using "\n" as the line separator.
it: Una descrizione estesa del gruppo di componenti ${GROUPNAME}, utilizzata negli installatori grafici per fornire all'utente informazioni aggiuntive sui componenti contenuti in questo gruppo. Le descrizioni possono estendersi su più righe utilizzando "\n" come separatore di riga.

source: A flag indicating whether the group title should be in bold. Only available with NSIS.
it: Un flag che indica se il titolo del gruppo deve essere in grassetto. Disponibile solo con NSIS.
