Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: When doing a non-:envvar:`DESTDIR` install for packaging, which is the default, any absolute paths are installed into absolute directories, and not into the package. Therefore, projects that do not use the :envvar:`DESTDIR` option, must not use any absolute paths in install rules. Conversely, projects that use absolute paths, must use the :envvar:`DESTDIR` option.
it: Quando si esegue un'installazione diversa da :envvar:`DESTDIR` per il pacchetto, che è il default, tutti i path assoluti vengono installati nelle directory assolute e non nel pacchetto. Pertanto, i progetti che non utilizzano l'opzione :envvar:`DESTDIR` non devono utilizzare path assoluti nelle regole di installazione. Al contrario, i progetti che utilizzano path assoluti devono utilizzare l'opzione :envvar:`DESTDIR`.

source: One other variable can be used to control the root path projects are installed into, the :variable:`CPACK_PACKAGING_INSTALL_PREFIX`. By default many of the generators install into the directory /usr. That variable can be used to change that to any directory, including just /.
it: Un'altra variabile può essere utilizzata per controllare il path di root in cui sono installati i progetti, la :variable:`CPACK_PACKAGING_INSTALL_PREFIX`. Per default molti dei generatori installano nella directory /usr. Tale variabile può essere utilizzata per cambiarla in qualsiasi directory, incluso solo /.

source: CPack and other installed directories
it: CPack e altre directory installate

source: It is possible to run other install rules if the project is not CMake based. This can be done by using the variables :variable:`CPACK_INSTALL_COMMANDS`, and :variable:`CPACK_INSTALLED_DIRECTORIES`. :variable:`CPACK_INSTALL_COMMANDS` are commands that will be run during the installation phase of the packaging. :variable:`CPACK_INSTALLED_DIRECTORIES` should contain pairs of directory and subdirectory. The subdirectory can be '.' to be installed in the top-level directory of the installation. The files in each directory will be copied to the corresponding subdirectory of the CPack staging directory and packaged with the rest of the files.
it: È possibile eseguire altre regole di installazione se il progetto non è basato su CMake. Questo può essere fatto usando le variabili :variable:`CPACK_INSTALL_COMMANDS` e :variable:`CPACK_INSTALLED_DIRECTORIES`. :variable:`CPACK_INSTALL_COMMANDS` sono comandi che verranno eseguiti durante la fase di installazione del pacchetto. :variable:`CPACK_INSTALLED_DIRECTORIES` dovrebbe contenere coppie di directory e sottodirectory. La sottodirectory può essere '.' da installare nella directory di primo livello dell'installazione. I file in ciascuna directory verranno copiati nella sottodirectory corrispondente della directory di staging di CPack e impacchettati con il resto dei file.

source: CPack for Windows Installer NSIS
it: CPack per Windows Installer NSIS

source: To create Windows style wizard based installer programs, CPack uses NSIS (NullSoft Scriptable Install System). More information about NSIS can be found at the NSIS home page: http://nsis.sourceforge.net/ NSIS is a powerful tool with a scripting language used to create professional Windows installers. To create Windows installers with CPack, you will need NSIS installed on your machine.
it: Per creare programmi di installazione basati su procedure guidate in stile Windows, CPack utilizza NSIS (NullSoft Scriptable Install System). Ulteriori informazioni su NSIS sono disponibili nella home page di NSIS: http://nsis.sourceforge.net/ NSIS è un potente strumento con un linguaggio di scripting utilizzato per creare programmi di installazione professionali di Windows. Per creare programmi di installazione di Windows con CPack, c'è bisogno che NSIS sia installato sul computer.

source: CPack uses configured template files to control NSIS. There are two files configured by CPack during the creation of a NSIS installer. Both files are found in the CMake Modules directory. ``Modules/NSIS.template.in`` is the template for the NSIS script, and ``Modules/NSIS.InstallOptions.ini.in`` is the template for the modern user interface or MUI used by NSIS. The install options file contains the information about the pages used in the install wizard. This section will describe how to configure CPack to create an NSIS install wizard.
it: CPack utilizza file template configurati per controllare NSIS. Ci sono due file configurati da CPack durante la creazione di un programma di installazione NSIS. Entrambi i file si trovano nella directory Modules di CMake. ``Modules/NSIS.template.in`` è il template per lo script NSIS e ``Modules/NSIS.InstallOptions.ini.in`` è il template per la moderna interfaccia utente o MUI utilizzata da NSIS. Il file delle opzioni di installazione contiene le informazioni sulle pagine utilizzate nella procedura guidata (wizard) di installazione. Questa sezione descriverà come configurare CPack per creare una procedura guidata di installazione NSIS.

source: CPack Variables Used by CMake for NSIS
it: Variabili CPack Usate da CMake per NSIS

source: This section contains screen captures from the CMake NSIS install wizard. For each part of the installer that can be changed or controlled from CPack, the variables and values used are given.
it: Questa sezione contiene schermate acquisite dalla procedura guidata di installazione di CMake NSIS. Per ogni parte dell'installer modificabile o controllabile da CPack, vengono fornite le variabili e i valori utilizzati.

source: The first thing that a user will see of the installer in Windows is the icon for the installer executable itself. By default the installer will have the Null Soft Installer icon, as seen in Figure :num:`figure-IconforinstallerinWindowsExplorer` for the 20071023 CMake installer. This icon can be changed by setting the variable ``CPACK_NSIS_MUI_ICON``. The installer for 20071025 in the same figure shows the CMake icon being used for the installer.
it: La prima cosa che un utente vedrà del programma di installazione in Windows è l'icona dell'eseguibile del programma di installazione stesso. Per default l'installer avrà l'icona Null Soft Installer, come mostrato nella Figura :num:`figure-IconforinstallerinWindowsExplorer` per il programma di installazione CMake 20071023. Questa icona può essere modificata impostando la variabile ``CPACK_NSIS_MUI_ICON``. L'installer per 20071025 nella stessa figura mostra l'icona CMake utilizzata per l'installer.staller.

source: Icon for installer in Windows Explorer
it: Icona per l'installer in Windows Explorer

source: The last thing a users will see of the installer in Windows is the icon for the uninstall executable, as seen in Figure :num:`figure-UninstallIconforNSISinstaller`. This option can be set with the ``CPACK_NSIS_MUI_UNIICON`` variable. Both the install and uninstall icons must be the same size and format, a valid windows .ico file usable by Windows Explorer. The icons are set like this::
it: L'ultima cosa che gli utenti vedranno del programma di installazione in Windows è l'icona dell'eseguibile di disinstallazione, come mostrato in Figura :num:`figure-UninstallIconforNSISinstaller`. Questa opzione può essere impostata con la variabile ``CPACK_NSIS_MUI_UNIICON``. Entrambe le icone di installazione e disinstallazione devono avere le stesse dimensioni e lo stesso formato, un file Windows .ico valido utilizzabile da Windows Explorer. Le icone vengono impostate in questo modo::

source: Uninstall Icon for NSIS installer
it: Icona Uninstall per l'installer NSIS

source: On Windows, programs can also be removed using the Add or Remove Programs tool from the control panel as seen in Figure :num:`figure-AddorRemoveProgramsEntry`. The icon for this should be embedded in one of the installed executables. This can be set like this:
it: Su Windows, i programmi possono anche essere rimossi utilizzando il tool "Add or Remove Programs" (Aggiungi o rimuovi programmi) dal pannello di controllo, come mostrato in Figura :num:`figure-AddorRemoveProgramsEntry`. L'icona per questo dovrebbe essere inclusa in uno degli eseguibili installati. Questo può essere impostato in questo modo:

source: Add or Remove Programs Entry
it: La Voce "Add or Remove Programs"

source: First Screen of Install Wizard
it: Prima Schermata dell'Installazione Guidata

source: When running the installer, the first screen of the wizard will look like Figure :num:`figure-FirstScreenofInstallWizard`. In this screen you can control the name of the project that shows up in two places on the screen. The name used for the project is controlled by the variable :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` or :variable:`CPACK_NSIS_PACKAGE_NAME`. In this example, it was set to "CMake 2.5" like this:
it: Quando si esegue il programma di installazione, la prima schermata della procedura guidata sarà simile alla Figura :num:`figure-FirstScreenofInstallWizard`. In questa schermata si può controllare il nome del progetto che appare in due punti sullo schermo. Il nome utilizzato per il progetto è controllato dalla variabile :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` o da :variable:`CPACK_NSIS_PACKAGE_NAME`. In questo esempio, è stato impostato su "CMake 2.5" in questo modo:

source: or this:
it: o in questo:

source: Second Screen of Install Wizard
it: Seconda Schermata dell'Installazione Guidata

source: The second page of the install wizard can be seen in Figure :num:`figure-SecondScreenofInstallWizard`. This screen contains the license agreement and there are several things that can be configured on this page. The banner bitmap to the left of the "License Agreement" label is controlled by the variable ``CPACK_PACKAGE_ICON`` like this:
it: La seconda pagina della procedura guidata di installazione può essere visualizzata in Figura :num:`figure-SecondScreenofInstallWizard`. Questa schermata contiene il contratto di licenza e ci sono diverse cose che possono essere configurate. La bitmap del banner a sinistra dell'etichetta "License Agreement" (Contratto di licenza) è controllata dalla variabile ``CPACK_PACKAGE_ICON`` in questo modo:

source: :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` is used again on this page everywhere you see the text "CMake 2.5". The text of the license agreement is set to the contents of the file specified in the :variable:`CPACK_RESOURCE_FILE_LICENSE` variable. CMake does the following:
it: :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` viene nuovamente utilizzata in questa pagina ovunque si veda il testo "CMake 2.5". Il testo del contratto di licenza è impostato sul contenuto del file specificato nella variabile :variable:`CPACK_RESOURCE_FILE_LICENSE` variable. CMake fa quanto segue:

source: Third page of installer wizard
it: Terza pagina della procedura guidata di installazione

source: The third page of the installer can be seen in Figure :num:`figure-Thirdpageofinstallerwizard`. This page will only show up if :variable:`CPACK_NSIS_MODIFY_PATH` is set to on. If you check the Create "name" Desktop Icon button, and you put executable names in the variable :variable:`CPACK_CREATE_DESKTOP_LINKS`, then a desktop icon for those executables will be created. For example, to create a desktop icon for the cmake-gui program of CMake, the following is done:
it: La terza pagina del programma di installazione è visibile nella Figura :num:`figure-Thirdpageofinstallerwizard`. Questa pagina verrà visualizzata solo se :variable:`CPACK_NSIS_MODIFY_PATH` è impostata su on. Se si seleziona il pulsante Create "name" Desktop Icon e si inseriscono i nomi degli eseguibili nella variabile :variable:`CPACK_CREATE_DESKTOP_LINKS`, verrà creata un'icona sul desktop per quegli eseguibili. Ad esempio, per creare un'icona sul desktop per il programma cmake-gui di CMake, si esegue quanto segue:

source: Multiple desktop links can be created if your application contains more than one executable. The link will be created to the Start Menu entry, so :variable:`CPACK_PACKAGE_EXECUTABLES`, which is described later in this section, must also contain the application in order for a desktop link to be created.
it: È possibile creare più collegamenti sul desktop se l'applicazione contiene più di un eseguibile. Il collegamento verrà creato alla voce del menù Start, quindi :variable:`CPACK_PACKAGE_EXECUTABLES`, descritto più avanti in questa sezione, deve contenere anche l'applicazione per poter creare un collegamento sul desktop.

source: Fourth page of installer wizard
it: Quarta pagina della procedura guidata di installazione

source: The fourth page of the installer seen in Figure :num:`figure-Fourthpageofinstallerwizard` uses the variable :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` to specify the default destination folder in Program Files. The following CMake code was used to set that default:
it: La quarta pagina del programma di installazione visualizzata in Figura :num:`figure-Fourthpageofinstallerwizard` utilizza la variabile :variable:`CPACK_PACKAGE_INSTALL_DIRECTORY` per specificare la cartella di destinazione di default in Program Files. Il seguente codice CMake è stato utilizzato per impostare tale default:

source: The remaining pages of the installer wizard do not use any additional CPack variables, and are not included in this section. Another important option that can be set by the NSIS CPack generator is the registry key used. There are several CPack variables that control the default key used. The key is defined in the NSIS.template.in file as follows::
it: Le restanti pagine della procedura guidata di installazione non utilizzano variabili CPack aggiuntive e non sono incluse in questa sezione. Un'altra opzione importante che può essere impostata dal generatore NSIS CPack è la chiave di registro utilizzata. Esistono diverse variabili CPack che controllano la chiave di default utilizzata. La chiave è definita nel file NSIS.template.in questo modo::

source: Where the ``CPACK_PACKAGE_VENDOR`` value defaults to Humanity, and ``CPACK_PACKAGE_INSTALL_REGISTRY_KEY`` defaults to ``${CPACK_PACKAGE_NAME} ${CPACK_PACKAGE_VERSION}``
it: Dove il default di ``CPACK_PACKAGE_VENDOR`` è Humanity e quello di ``CPACK_PACKAGE_INSTALL_REGISTRY_KEY`` è ``${CPACK_PACKAGE_NAME} ${CPACK_PACKAGE_VERSION}``

source: So for CMake 2.5.20071025 the registry key would look like this::
it: Quindi per CMake 2.5.20071025 la chiave di registro sarebbe simile a questa::

source: Creating Windows Short Cuts in the Start Menu
it: Creazione di scorciatoie di Windows nel Menù Start

source: There are two variables that control the short cuts that are created in the Windows Start menu by NSIS. The variables contain lists of pairs, and must have an even number of elements to work correctly. The first is ``CPACK_PACKAGE_EXECUTABLES``, it should contain the name of the executable file followed by the name of the shortcut text. For example in the case of CMake, the executable is called cmake-gui, but the shortcut is named "CMake". CMake does the following to create that shortcut:
it: Esistono due variabili che controllano le scorciatoie create nel menù Start di Windows da NSIS. Le variabili contengono elenchi di coppie e devono avere un numero pari di elementi per funzionare correttamente. Il primo è ``CPACK_PACKAGE_EXECUTABLES``, dovrebbe contenere il nome del file eseguibile seguito dal nome del testo del collegamento. Ad esempio, nel caso di CMake, l'eseguibile si chiama cmake-gui, ma il collegamento si chiama "CMake". CMake fa quanto segue per creare quel collegamento:

source: The second is ``CPACK_NSIS_MENU_LINKS``. This variable contains arbitrary links into the install tree, or to external web pages. The first of the pair is always the existing source file or location, and the second is the name that will show up in the Start menu. To add a link to the help file for cmake-gui and a link to the CMake web page add the following:
it: Il secondo è ``CPACK_NSIS_MENU_LINKS``. Questa variabile contiene collegamenti arbitrari all'albero di installazione o a pagine web esterne. Il primo della coppia è sempre il file o la posizione di origine esistente e il secondo è il nome che verrà visualizzato nel menù Start. Per aggiungere un collegamento al file della guida per cmake-gui e un collegamento alla pagina Web di CMake, aggiungere quanto segue:

source: Advanced NSIS CPack Options
it: Opzioni Avanzate di NSIS CPack

source: In addition to the variables already discussed, CPack provides a few additional variables that are directly configured into the NSIS script file. These can be used to add NSIS script fragments to the final NSIS script used to create the installer. They are as follows:
it: Oltre alle variabili già discusse, CPack fornisce alcune variabili aggiuntive configurate direttamente nel file di script NSIS. Queste sono utilizzabili per aggiungere frammenti di script NSIS allo script NSIS finale utilizzato per creare il programma di installazione. Sono le seguenti:

source: Extra commands used during install.
it: Comandi aggiuntivi utilizzati durante l'installazione.

source: Extra commands used during uninstall.
it: Comandi aggiuntivi utilizzati durante la disinstallazione.

source: Extra NSIS commands in the icon section of the script.
it: Comandi NSIS aggiuntivi nella sezione delle icone dello script.

source: Extra NSIS commands in the delete icons section of the script.
it: Comandi NSIS aggiuntivi nella sezione di cancellazione delle icone dello script.

source: When using these variables the NSIS documentation should be referenced, and the author should look at the ``NSIS.template.in`` file for the exact placement of the variables.
it: Quando si usano queste variabili si dovrebbe fare riferimento alla documentazione NSIS e l'autore dovrebbe guardare il file ``NSIS.template.in`` per l'esatto posizionamento delle variabili.

source: Setting File Extension Associations With NSIS
it: Impostazioni delle Associazioni delle Estensioni dei File Con NSIS

source: One example of a useful thing that can be done with the extra install commands is to create associations from file extensions to the installed application. For example, if you had an application CoolStuff that could open files with the extension ``.cool``, you would set the following extra install and uninstall commands:
it: Un esempio di una cosa utile che può essere fatta con i comandi di installazione extra è creare associazioni dalle estensioni di file all'applicazione installata. Ad esempio, avendo un'applicazione CoolStuff in grado di aprire file con estensione ``.cool``, si devono impostare i seguenti comandi aggiuntivi di installazione e disinstallazione:

source: This creates a Windows file association to all files ending in ``.cool``, so that when a user double clicks on a ``.cool`` file, ``coolstuff.exe`` is run with the full path to the file as an argument. This also sets up an association for editing the file from the windows right-click menu to the same ``coolstuff.exe`` program. The Windows explorer icon for the file is set to the icon found in the ``coolstuff.exe`` executable. When it is uninstalled, the registry keys are removed. Since the double quotes and Windows path separators must be escaped, it is best to put this code into the ``CPACK_PROJECT_CONFIG_FILE`` for the project.
it: Questo crea un'associazione di file Windows a tutti i file che terminano con ``.cool``, in modo che quando un utente fa doppio clic su un file ``.cool``, ``coolstuff.exe`` viene eseguito con il path completo del file come argomento. Questo imposta anche un'associazione per modificare il file dal menù di scelta rapida di Windows allo stesso programma ``coolstuff.exe``. L'icona di Windows Explorer per il file è impostata sull'icona trovata nell'eseguibile ``coolstuff.exe``. Quando viene disinstallato, le chiavi di registro vengono rimosse. Poiché le virgolette doppie e i separatori di path di Windows devono essere 'escaped', è meglio inserire questo codice in ``CPACK_PROJECT_CONFIG_FILE`` per il progetto.

source: Installing Microsoft Run Time Libraries
it: Installazione delle Microsoft Run Time Libraries

source: Although not strictly an NSIS CPack command, if you are creating applications on Windows with the Microsoft compiler you will most likely want to distribute the run time libraries from Microsoft alongside your project. In CMake, all you need to do is the following:
it: Sebbene non sia strettamente un comando NSIS CPack, se si creano applicazioni su Windows con il compilatore Microsoft, molto probabilmente si dovranno distribuire le librerie di runtime da Microsoft insieme al progetto. In CMake, tutto ciò che si deve fare è quanto segue:

source: This will add the compiler run time libraries as install files that will go into the bin directory of your application. If you do not want the libraries to go into the bin directory, you would do this:
it: Questo aggiungerà le librerie di runtime del compilatore come file di installazione che andranno nella directory bin dell'applicazione. Se non si vuole che le librerie vadano nella directory bin, si deve fare questo:

source: It is important to note that the run time libraries must be right next to the executables of your package in order for Windows to find them. With Visual Studio 2005 and 2008, side by side manifest files are also required to be installed with your application when distributing the run time libraries. If you want to package a debug version of your software you will need to set ``CMAKE_INSTALL_DEBUG_LIBRARIES`` to ON prior to the include. Be aware, however, that the license terms may prohibit you from re-distributing the debug libraries. Double check the licensing terms for the version of Visual Studio you're using before deciding to set ``CMAKE_INSTALL_DEBUG_LIBRARIES`` to ON.
it: È importante notare che le librerie di runtime devono trovarsi proprio accanto agli eseguibili del pacchetto affinché Windows possa trovarle. Con Visual Studio 2005 e 2008, è necessario installare anche i file manifest affiancati con l'applicazione durante la distribuzione delle librerie di runtime. Volendo impacchettare una versione di debug del software, si dovrà impostare ``CMAKE_INSTALL_DEBUG_LIBRARIES`` su ON prima dell'inclusione. Da tenere presente, tuttavia, che i termini della licenza potrebbero proibire di ridistribuire le librerie di debug. Ricontrollare i termini di licenza per la versione di Visual Studio utilizzata prima di decidere di impostare ``CMAKE_INSTALL_DEBUG_LIBRARIES`` su ON. ON.

source: CPack Component Install Support
it: Supporto per l'Installazione dei Componenti CPack

source: By default, CPack's installers consider all of the files installed by a project as a single, monolithic unit: either the whole set of files is installed, or none of the files are installed. However, with many projects it makes sense for the installation to be subdivided into distinct, user-selectable components. Some users may want to install only the command-line tools for a project, while other users might want the GUI or the header files.
it: Per default, i programmi di installazione di CPack considerano tutti i file installati da un progetto come una singola unità monolitica: o viene installato l'intero set di file o non viene installato alcun file. Tuttavia, con molti progetti ha senso suddividere l'installazione in componenti distinti e selezionabili dall'utente. Alcuni utenti potrebbero voler installare solo i tool a riga di comando per un progetto, mentre altri utenti potrebbero desiderare la GUI o i file header.
