Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Once a variable is in the cache, its "cache" value cannot normally be modified from a CMakeLists file. The reasoning behind this is that once CMake has put the variable into the cache with its initial value, the user may then modify that value from the GUI. If the next invocation of CMake overwrote their change back to the :command:`set` value, the user would never be able to make a change that CMake wouldn't overwrite. A ``set(FOO ON CACHE BOOL "doc")`` command will typically only do something when the cache doesn't have the variable in it. Once the variable is in the cache, that command will have no effect.
it: Una volta che una variabile è nella cache, il suo valore "cache" normalmente non può essere modificato da un file CMakeLists. Il ragionamento alla base di ciò è che una volta che CMake ha inserito la variabile nella cache con il suo valore iniziale, l'utente può poi modificare quel valore dalla GUI. Se la successiva chiamata di CMake sovrascrivesse la loro modifica al valore :command:`set`, l'utente non sarebbe mai in grado di apportare una modifica che CMake non sovrascriverebbe. Un comando ``set(FOO ON CACHE BOOL "doc")`` tipicamente farà qualcosa solo quando la cache non contiene la variabile. Una volta che la variabile è nella cache, quel comando non avrà alcun effetto.

source: In the rare event that you really want to change a cached variable's value, use the ``FORCE`` option in combination with the ``CACHE`` option to the :command:`set` command. The ``FORCE`` option will cause the :command:`set` command to override and change the cache value of a variable.
it: Nel raro caso in cui si voglia davvero modificare il valore di una variabile memorizzata nella cache, si usa l'opzione ``FORCE`` in combinazione con l'opzione ``CACHE`` nel comando :command:`set`. L'opzione ``FORCE`` farà sì che il comando :command:`set` sovrascriva e modifichi il valore della cache di una variabile.

source: A few final points should be made concerning variables and their interaction with the cache. If a variable is in the cache, it can still be overridden in a CMakeLists file using the :command:`set` command without the ``CACHE`` option. Cache values are checked when a referenced variable is not defined in the current scope. The :command:`set` command will define a variable for the current scope without changing the value in the cache.
it: Alcuni punti finali dovrebbero essere fatti riguardo alle variabili e alla loro interazione con la cache. Se una variabile è nella cache, può comunque essere sovrascritta in un file CMakeLists usando il comando :command:`set` senza l'opzione ``CACHE``. I valori della cache vengono controllati quando una variabile di riferimento non è definita nello scope corrente. Il comando :command:`set` definirà una variabile per lo scope corrente senza modificare il valore nella cache.

source: Variables that are in the cache also have a property indicating if they are advanced or not. By default, when :manual:`ccmake <ccmake(1)>` or the :manual:`cmake-gui <cmake-gui(1)>` are run, the advanced cache entries are not displayed. This is so the user can focus on the cache entries that they should consider changing. The advanced cache entries are other options that the user can modify, but typically will not. It is not unusual for a large software project to have fifty or more options, and the advanced property lets a software project divide them into key options for most users and advanced options for advanced users. Depending on the project, there may not be any non-advanced cache entries. To make a cache entry advanced, the :command:`mark_as_advanced` command is used with the name of the variable (a.k.a. cache entry).
it: Le variabili che si trovano nella cache hanno anche una proprietà che indica se sono avanzate o meno. Per default, quando vengono eseguiti :manual:`ccmake <ccmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>`, le voci della cache avanzata non vengono visualizzate. In questo modo l'utente può concentrarsi sulle voci della cache che dovrebbe considerare di modificare. Le voci avanzate della cache sono altre opzioni che l'utente può modificare, ma in genere non lo farà. Non è insolito che un progetto software di grandi dimensioni abbia cinquanta o più opzioni e la proprietà "advanced" consente a un progetto software di suddividerle in opzioni chiave per la maggior parte degli utenti e in opzioni avanzate per utenti esperti. A seconda del progetto, potrebbero non esserci voci di cache non avanzate. Per rendere avanzata una voce della cache, viene utilizzato il comando :command:`mark_as_advanced` con il nome della variabile (ovvero la voce della cache).

source: In some cases, you might want to restrict a cache entry to a limited set of predefined options. You can do this by setting the :prop_cache:`STRINGS` property on the cache entry. The following CMakeLists code illustrates this by creating a property named ``CRYPTOBACKEND`` as usual, and then setting the ``STRINGS`` property on it to a set of three options.
it: In alcuni casi, si potrebbe voler limitare una voce della cache a un insieme limitato di opzioni predefinite. Lo si può fare impostando la proprietà :prop_cache:`STRINGS` sulla voce della cache. Il seguente codice CMakeLists lo illustra creando una proprietà denominata ``CRYPTOBACKEND`` come al solito e quindi impostando la proprietà ``STRINGS`` su di essa su un insieme di tre opzioni.

source: When :manual:`cmake-gui <cmake-gui(1)>` is run and the user selects the ``CRYPTOBACKEND`` cache entry, they will be presented with a pulldown to select which option they want.
it: Quando viene eseguito :manual:`cmake-gui <cmake-gui(1)>` e l'utente seleziona la voce della cache ``CRYPTOBACKEND``, verrà visualizzato un menù a tendina per selezionare l'opzione voluta.

source: Setting Initial Values for CMake
it: Impostazione dei Valori Iniziali per CMake

source: Sometimes you may need to set up cache entries without running a GUI. This is common when setting up nightly dashboards, or if you will be creating many build trees with the same cache values. In these cases, the CMake cache can be initialized in two different ways. The first way is to pass the cache values on the CMake command line using ``-DCACHE_VAR:TYPE=VALUE`` arguments. For example, consider the following nightly dashboard script for a UNIX machine:
it: A volte potrebbe essere necessario impostare le voci della cache senza eseguire una GUI. Questo è comune quando si impostano dashboard notturne o se si creeranno molti alberi di build con gli stessi valori della cache. In questi casi, la cache di CMake può essere inizializzata in due modi diversi. Il primo modo consiste nel passare i valori della cache sulla riga di comando di CMake utilizzando gli argomenti ``-DCACHE_VAR:TYPE=VALUE``. Ad esempio, si consideri il seguente script della dashboard notturna per una macchina UNIX:

source: The same idea can be used with a batch file on Windows.
it: La stessa idea può essere utilizzata con un file batch su Windows.

source: The second way is to create a file to be loaded using :manual:`cmake <cmake(1)>`'s ``-C`` option. In this case, instead of setting up the cache with ``-D`` options, it is done through a file that is parsed by CMake. The syntax for this file is the standard CMakeLists syntax, which is typically a series of :command:`set` commands such as:
it: Il secondo modo consiste nel creare un file da caricare :manual:`cmake <cmake(1)>` con la sua opzione ``-C``. In questo caso, invece di configurare la cache con le opzioni ``-D``, viene eseguita tramite un file che viene analizzato da CMake. La sintassi per questo file è quella standard di CMakeLists, che in genere è una serie di comandi :command:`set` come:

source: In some cases there might be an existing cache, and you want to force the cache values to be set a certain way. For example, say you want to turn Hybrid on even if the user has previously run CMake and turned it off. Then you can do
it: In alcuni casi potrebbe esserci una cache esistente e si desidera forzare l'impostazione dei valori della cache in un certo modo. Ad esempio, si supponga di voler attivare Hybrid anche se l'utente abbia precedentemente eseguito CMake e lo abbia disattivato. Allora si può fare

source: Another option is that you want to set and then hide options so the user will not be tempted to adjust them later on. This can be done using type ``INTERNAL``. ``INTERNAL`` cache variables imply ``FORCE`` and are never shown in cache editors.
it: Un'altra possibilità è che si desidera impostare e quindi nascondere le opzioni in modo che l'utente non sia tentato di modificarle in seguito. Questo può essere fatto usando il tipo ``INTERNAL``. Le variabili di cache ``INTERNAL`` implicano ``FORCE`` e non vengono mai mostrate negli editor della cache.

source: Converting Existing Systems To CMake
it: Conversione di Sistemi Esistenti in CMake

source: For many people, the first thing they will do with CMake is convert an existing project from using an older build system to use CMake. This can be a fairly easy process, but there are a few issues to consider. This section will address those issues and provide some suggestions for effectively converting a project over to CMake. The first issue to consider when converting to CMake is the project's directory structure.
it: Molte persone, la prima cosa che faranno con CMake è convertire un progetto esistente dall'utilizzo di un vecchio sistema di build per utilizzare CMake. Questo può essere un processo abbastanza semplice, ma ci sono alcuni problemi da considerare. Questa sezione affronterà tali problemi e fornirà alcuni suggerimenti per convertire efficacemente un progetto in CMake. Il primo problema da considerare durante la conversione in CMake è la struttura della directory del progetto.

source: Source Code Directory Structures
it: Struttura della Directory Del Codice Sorgente

source: Most small projects will have their source code in either the top level directory or in a directory named ``src`` or ``source``. Even if all of the source code is in a subdirectory, we highly recommend creating a CMakeLists file for the top level directory. There are two reasons for this. First, it can be confusing to some people that they must run CMake on the subdirectory of the project, instead of the main directory. Second, you may want to install documentation or other support files from the other directories. By having a CMakeLists file at the top of the project, you can use the :command:`add_subdirectory` command to step down into the documentation directory where its CMakeLists file can install the documentation (you can have a CMakeLists file for a documentation directory with no targets or source code).
it: La maggior parte dei piccoli progetti avrà il proprio codice sorgente nella directory di livello superiore o in una directory chiamata ``src`` o ``source``. Anche se tutto il codice sorgente si trova in una sottodirectory, consigliamo vivamente di creare un file CMakeLists per la directory di primo livello. Ci sono due ragioni per questo. Innanzitutto, può creare confusione per alcuni dover eseguire CMake nella sottodirectory del progetto, anziché in quella principale. In secondo luogo, si potrebbe voler installare la documentazione o altri file di supporto da altre directory. Avendo un file CMakeLists al top del progetto, si può usare il comando :command:`add_subdirectory` per scendere nella directory della documentazione dove il suo file CMakeLists può installare la documentazione (si può avere un file CMakeLists per una directory di documentazione senza target o codice sorgente).

source: For projects that have source code in multiple directories, there are a few options. One option that many Makefile-based projects use is to have a single Makefile at the top-level directory that lists all the source files to compile in their subdirectories. For example::
it: Per i progetti che hanno il codice sorgente in più directory, ci sono alcune scelte. Un'opzione utilizzata da molti progetti basati su Makefile consiste nell'avere un singolo Makefile nella directory di primo livello che elenca tutti i file sorgente da compilare nelle loro sottodirectory. Per esempio::

source: This approach works just as well with CMake using a similar syntax:
it: Questo approccio funziona altrettanto bene con CMake utilizzando una sintassi simile:

source: Another option is to have each subdirectory build a library or libraries that can then be linked into the executables. In those cases, each subdirectory would define its own list of source files and add the appropriate targets. A third option is a mixture of the first two; each subdirectory can have a CMakeLists file that lists its sources, but the top-level CMakeLists file will not use the :command:`add_subdirectory` command to step into the subdirectories. Instead, the top-level CMakeLists file will use the :command:`include` command to include each of the subdirectory's CMakeLists files. For example, a top-level CMakeLists file might include the following code
it: Un'altra possibilità è fare in modo che ciascuna sottodirectory crei una libreria o librerie che possano poi essere linkate agli eseguibili. In questi casi, ciascuna sottodirectory definirà il proprio elenco di file sorgenti e aggiungerà i target appropriati. Una terza opzione è una mix delle prime due; ogni sottodirectory può avere un file CMakeLists che elenca i suoi sorgenti, ma il file CMakeLists di primo livello non utilizzerà il comando :command:`add_subdirectory` per entrare nelle sottodirectory. Ma, il file CMakeLists di primo livello utilizzerà il comando :command:`include` per includere ciascuno dei file CMakeLists della sottodirectory. Ad esempio, un file CMakeLists di primo livello potrebbe includere il codice seguente

source: While the CMakeLists files in the subdirectories might look like the following:
it: Mentre i file CMakeLists nelle sottodirectory potrebbero avere il seguente aspetto:

source: The approach you use is entirely up to you. For large projects, having multiple shared libraries can certainly improve build times when changes are made. For smaller projects, the other two approaches have their advantages. The main suggestion here is to choose a strategy and stick with it.
it: L'approccio è una scelta personale. Per progetti di grandi dimensioni, avere più librerie condivise può sicuramente migliorare i tempi di compilazione quando vengono apportate modifiche. Per i progetti più piccoli, gli altri due approcci hanno i loro vantaggi. Il suggerimento è quello di scegliere una strategia e seguirla.

source: Build Directories
it: Directory di Build

source: The next issue to consider is where to put the resulting object files, libraries, and executables. There are a few different, commonly used approaches, and some work better with CMake than others. The recommended strategy is to put the binary files into a separate tree that has the same structure as the source tree. For example, if the source tree looked like the following::
it: Il problema successivo da considerare è dove inserire i file oggetto, le librerie e gli eseguibili risultanti. Esistono alcuni approcci diversi e comunemente usati e alcuni funzionano meglio con CMake rispetto ad altri. La strategia consigliata consiste nell'inserire i file binari in un albero separato che abbia la stessa struttura dell'albero dei sorgenti. Ad esempio, se l'albero dei sorgenti fosse simile al seguente::

source: the binary tree might look like::
it: l'albero binario potrebbe essere simile a::

source: For some Windows generators, such as Visual Studio, build files are actually kept in a subdirectory matching the selected configuration; e.g. debug, release, etc.
it: Per alcuni generatori di Windows, come Visual Studio, i file di compilazione vengono effettivamente conservati in una sottodirectory corrispondente alla configurazione selezionata; per esempio. debug, release, ecc.

source: If you need to support multiple architectures from one source tree, we highly recommend a directory structure like the following::
it: Se c'è bisogno di supportare più architetture da un albero di sorgenti, consigliamo vivamente una struttura di directory come la seguente::

source: That way, each architecture has its own build directory and will not interfere with any other architecture. Remember that not only are the object files kept in the binary directories, but also any configured files that are typically written to the binary tree. Another tree structure found primarily on UNIX projects is one where the binary files for different architectures are kept in subdirectories of the source tree (see below). CMake does not work well with this structure, so we recommend switching to the separate build tree structure shown above.
it: In questo modo, ogni architettura ha la propria directory di build e non interferirà con nessun'altra architettura. Da tenere presente che non solo i file oggetto sono conservati nelle directory binarie, ma anche tutti i file configurati che vengono tipicamente scritti nell'albero binario. Un'altra struttura ad albero che si ritrova principalmente nei progetti UNIX è quella in cui i file binari per diverse architetture sono conservati in sottodirectory dell'albero dei sorgenti (vedere di seguito). CMake non funziona bene con questa struttura, quindi consigliamo di passare alla struttura ad albero di build separata mostrata sopra.

source: CMake provides three variables for controlling where binary targets are written. They are the :variable:`CMAKE_RUNTIME_OUTPUT_DIRECTORY`, :variable:`CMAKE_LIBRARY_OUTPUT_DIRECTORY`, and :variable:`CMAKE_ARCHIVE_OUTPUT_DIRECTORY` variables. These variables are used to initialize properties of libraries and executables to control where they will be written. Setting these enables a project to place all the libraries and executables into a single directory. For projects with many subdirectories, this can be a real time saver. A typical implementation is shown below:
it: CMake fornisce tre variabili per controllare dove vengono scritti i target binari. Sono le variabili :variable:`CMAKE_RUNTIME_OUTPUT_DIRECTORY`, :variable:`CMAKE_LIBRARY_OUTPUT_DIRECTORY` e :variable:`CMAKE_ARCHIVE_OUTPUT_DIRECTORY`. Queste variabili vengono utilizzate per inizializzare le proprietà delle librerie e degli eseguibili per controllare dove verranno scritte. L'impostazione di questi consente a un progetto di posizionare tutte le librerie e gli eseguibili in un'unica directory. Per i progetti con molte sottodirectory, questo può essere un vero risparmio di tempo. Un'implementazione tipica è mostrata di seguito:

source: In this example, all the "runtime" binaries will be written to the ``bin`` subdirectory of the project's binary tree, including executable files on all platforms and DLLs on Windows. Other binaries will be written to the ``lib`` directory. This approach is very useful for projects that make use of shared libraries (DLLs) because it collects all of the shared libraries into one directory. If the executables are placed in the same directory, then they can find the required shared libraries more easily when run on Windows.
it: In questo esempio, tutti i file binari di "runtime" verranno scritti nella sottodirectory ``bin`` dell'albero binario del progetto, inclusi i file eseguibili su tutte le piattaforme e le DLL su Windows. Altri binari verranno scritti nella directory ``lib``. Questo approccio è molto utile per i progetti che utilizzano librerie condivise [shared] (DLL) perché le raccoglie tutte in una directory. Se gli eseguibili vengono inseriti nella stessa directory, possono trovare più facilmente le librerie condivise richieste quando vengono eseguiti su Windows.

source: One final note on directory structures: with CMake, it is perfectly acceptable to have a project within a project. For example, within the Visualization Toolkit's source tree is a directory that contains a complete copy of the zlib compression library. In writing the CMakeLists file for that library, we use the :command:`project` command to create a project named VTKZLIB even though it is within the VTK source tree and project. This has no real impact on VTK, but it does allow us to build zlib independent of VTK without having to modify its CMakeLists file.
it: Un'ultima nota sulle strutture delle directory: con CMake, è perfettamente accettabile avere un progetto all'interno di un progetto. Ad esempio, all'interno dell'albero dei sorgenti di Visualization Toolkit c'è una directory che contiene una copia completa della libreria di compressione zlib. Nello scrivere il file CMakeLists per quella libreria, usiamo il comando :command:`project` per creare un progetto chiamato VTKZLIB anche se si trova all'interno dell'albero dei sorgenti e del progetto VTK. Ciò non ha alcun impatto reale su VTK, ma ci consente di creare zlib indipendentemente da VTK senza dover modificare il suo file CMakeLists.

source: Useful CMake Commands When Converting Projects
it: Comandi CMake Utili Durante la Conversione di Progetti

source: There are a few CMake commands that can make the job of converting an existing project easier and faster. The :command:`file` command with the ``GLOB`` argument allows you to quickly set a variable containing a list of all the files that match the glob expression. For example:
it: Esistono alcuni comandi CMake che possono semplificare e velocizzare il lavoro di conversione di un progetto esistente. Il comando :command:`file` con l'argomento ``GLOB`` consente di impostare rapidamente una variabile contenente un elenco di tutti i file che corrispondono all'espressione glob. Per esempio:

source: will set the ``SRC_FILES`` variable to a list of all the ``.cxx`` files in the current source directory. It will then create an executable using those source files. Windows developers should be aware that glob matches are case sensitive.
it: imposterà la variabile ``SRC_FILES`` su un elenco di tutti i file ``.cxx`` nella directory corrente dei sorgenti. Creerà quindi un eseguibile utilizzando quei sorgenti. Gli sviluppatori di Windows devono essere consapevoli del fatto che le corrispondenze glob fanno distinzione tra maiuscole e minuscole.

source: Converting UNIX Makefiles
it: Conversione dei Makefile UNIX
