Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Software is typically installed into a directory separate from the source and build trees. This allows it to be distributed in a clean form and isolates users from the details of the build process. CMake provides the :command:`install` command to specify how a project is to be installed. This command is invoked by a project in the CMakeLists file and tells CMake how to generate installation scripts. The scripts are executed at install time to perform the actual installation of files. For Makefile generators (UNIX, NMake, MinGW, etc.), the user simply runs ``make install`` (or ``nmake install``) and the make tool will invoke CMake's installation module. With GUI based systems (Visual Studio, Xcode, etc.), the user simply builds the target called ``INSTALL``.
it: Il software viene in genere installato in una directory separata dalle directory dei sorgenti e da quelle di build. Ciò consente di distribuirlo in una forma pulita e isola gli utenti dai dettagli del processo di build. CMake fornisce il comando :command:`install` per specificare come deve essere installato un progetto. Questo comando viene richiamato da un progetto nel file CMakeLists e indica a CMake come generare gli script di installazione. Gli script vengono eseguiti al momento dell'installazione per fare l'effettiva installazione dei file. Per i generatori di Makefile (UNIX, NMake, MinGW, ecc.), l'utente esegue semplicemente ``make install`` (o ``nmake install``) e lo strumento make invocherà il modulo di installazione di CMake. Con i sistemi basati su GUI (Visual Studio, Xcode, ecc.), l'utente builda semplicemente il target chiamato ``INSTALL``.

source: Each call to the :command:`install` command defines some installation rules. Within one CMakeLists file (source directory), these rules will be evaluated in the order that the corresponding commands are invoked. The order across multiple directories changed in CMake 3.14.
it: Ogni chiamata al comando :command:`install` definisce alcune regole di installazione. All'interno di un file CMakeLists (directory sorgente), queste regole verranno valutate nell'ordine in cui vengono richiamati i comandi corrispondenti. L'ordine tra directory multiple è cambiato in CMake 3.14.

source: The :command:`install` command has several signatures designed for common installation use cases. A particular invocation of the command specifies the signature as the first argument. The signatures are ``TARGETS``, ``FILES`` or ``PROGRAMS``, ``DIRECTORY``, ``SCRIPT``, ``CODE`` and ``EXPORT``.
it: Il comando :command:`install` ha diverse firme progettate per casi d'uso di installazione comuni. Una particolare invocazione del comando specifica la firma come primo argomento. Le firme [signature] sono ``TARGETS``, ``FILES`` o ``PROGRAMS``, ``DIRECTORY``, ``SCRIPT``, ``CODE`` e ``EXPORT``.

source: Installs the binary files corresponding to targets built inside the project.
it: Installa i file binari corrispondenti ai target compilati all'interno del progetto.

source: General-purpose file installation, which is typically used for header files, documentation, and data files required by your software.
it: Installa file per uso generico, generalmente utilizzata per file header, documentazione e file di dati richiesti dal software.

source: Installs executable files not built by the project, such as shell scripts. This argument is identical to ``install(FILES)`` except that the default permissions of the installed file include the executable bit.`
it: Installa i file eseguibili non compilati dal progetto, come gli script della shell. Questo argomento è identico a ``install(FILES)`` tranne per il fatto che i permessi di default del file installato includono il bit eseguibile.

source: This argument installs an entire directory tree. It may be used for installing directories with resources, such as icons and images.
it: Questo argomento installa un intero albero di directory. Può essere utilizzato per installare directory con risorse, come icone e immagini.

source: Specifies a user-provided CMake script file to be executed during installation. This is typically used to define pre-install or post-install actions for other rules.
it: Specifica un file di script CMake fornito dall'utente da eseguire durante l'installazione. Questo è in genere utilizzato per definire le azioni pre-installazione o post-installazione per altre regole.

source: Specifies user-provided CMake code to be executed during the installation. This is similar to ``install (SCRIPT)`` but the code is provided inline in the call as a string.
it: Specifica il codice CMake fornito dall'utente da eseguire durante l'installazione. È simile a ``install (SCRIPT)`` ma il codice viene fornito in linea nella chiamata come stringa.

source: Generates and installs a CMake file containing code to import targets from the installation tree into another project.
it: Genera e installa un file CMake contenente il codice per importare i target dall'albero di installazione in un altro progetto.

source: The ``TARGETS``, ``FILES``, ``PROGRAMS``, and ``DIRECTORY`` signatures are all meant to create install rules for files. The targets, files, or directories to be installed are listed immediately after the signature name argument. Additional details can be specified using keyword arguments followed by corresponding values. Keyword arguments provided by most of the signatures are as follows.
it: Le firme ``TARGETS``, ``FILES``, ``PROGRAMS`` e ``DIRECTORY`` hanno tutte lo scopo di creare regole di installazione per i file. I target, i file o le directory da installare sono elencati immediatamente dopo l'argomento del nome della firma. Ulteriori dettagli possono essere specificati utilizzando argomenti di parole chiave seguiti dai valori corrispondenti. Gli argomenti delle parole chiave forniti dalla maggior parte delle firme sono i seguenti.

source: This argument specifies the location where the installation rule will place files, and must be followed by a directory path indicating the location. If the directory is specified as a full path, it will be evaluated at install time as an absolute path. If the directory is specified as a relative path, it will be evaluated at install time relative to the installation prefix. The prefix may be set by the user through the cache variable :variable:`CMAKE_INSTALL_PREFIX`. A platform-specific default is provided by CMake: ``/usr/local`` on UNIX, and "<SystemDrive>/``Program Files``/<ProjectName>" on Windows, where SystemDrive is along the lines of ``C:`` and ProjectName is the name given to the top-most :command:`project` command.
it: Questo argomento specifica la posizione in cui la regola di installazione inserirà i file e deve essere seguito da un path di directory che indica la posizione. Se la directory viene specificata come percorso completo, verrà valutata al momento dell'installazione come path assoluto. Se la directory è specificata come percorso relativo, verrà valutata al momento dell'installazione rispetto al prefisso di installazione. Il prefisso può essere impostato dall'utente tramite la variabile cache :variable:`CMAKE_INSTALL_PREFIX`. CMake fornisce un'impostazione di default specifica per la piattaforma: ``/usr/local`` su UNIX e "<SystemDrive>/``Program Files``/<ProjectName>" su Windows, dove SystemDrive è sulla falsariga di ``C:`` e ProjectName è il nome dato al comando :command:`project` più in alto.

source: This argument specifies file permissions to be set on the installed files. This option is needed only to override the default permissions selected by a particular :command:`install` command signature. Valid permissions are ``OWNER_READ``, ``OWNER_WRITE``, ``OWNER_EXECUTE``, ``GROUP_READ``, ``GROUP_WRITE``, ``GROUP_EXECUTE``, ``WORLD_READ``, ``WORLD_WRITE``, ``WORLD_EXECUTE``, ``SETUID``, and ``SETGID``. Some platforms do not support all of these permissions; on such platforms those permission names are ignored.
it: Questo argomento specifica le autorizzazioni da impostare sui file installati. Questa opzione è necessaria solo per sovrascrivere le autorizzazioni di default selezionate da una particolare firma del comando :command:`install`. I permessi validi sono ``OWNER_READ``, ``OWNER_WRITE``, ``OWNER_EXECUTE``, ``GROUP_READ``, ``GROUP_WRITE``, ``GROUP_EXECUTE``, ``WORLD_READ``, ``WORLD_WRITE``, ``WORLD_EXECUTE``, ``SETUID`` e ``SETGID``. Alcune piattaforme non supportano tutte queste autorizzazioni; su queste tali nomi di autorizzazione vengono ignorati.

source: This argument specifies a list of build configurations for which an installation rule applies (Debug, Release, etc.). For Makefile generators, the build configuration is specified by the :variable:`CMAKE_BUILD_TYPE` cache variable. For Visual Studio and Xcode generators, the configuration is selected when the :command:`install` target is built. An installation rule will be evaluated only if the current install configuration matches an entry in the list provided to this argument. Configuration name comparison is case-insensitive.
it: Questo argomento specifica un elenco di configurazioni di build per le quali si applica una regola di installazione (Debug, Release e così via). Per i generatori di Makefile, la configurazione della build è specificata dalla variabile della cache :variable:`CMAKE_BUILD_TYPE`. Per i generatori di Visual Studio e Xcode, la configurazione viene selezionata quando viene creato il target :command:`install`. Una regola di installazione verrà valutata solo se la configurazione dell'installazione corrente corrisponde a una voce nell'elenco fornito a questo argomento. Il confronto dei nomi di configurazione non fa distinzione tra maiuscole e minuscole.

source: This argument specifies the installation component for which the installation rule applies. Some projects divide their installations into multiple components for separate packaging. For example, a project may define a ``Runtime`` component that contains the files needed to run a tool; a ``Development`` component containing the files needed to build extensions to the tool; and a ``Documentation`` component containing the manual pages and other help files. The project may then package each component separately for distribution by installing only one component at a time. By default, all components are installed. Component-specific installation is an advanced feature intended for use by package maintainers. It requires manual invocation of the installation scripts with an argument defining the ``COMPONENT`` variable to name the desired component. Note that component names are not defined by CMake. Each project may define its own set of components.
it: Questo argomento specifica il componente dell'installazione per il quale si applica la regola di installazione. Alcuni progetti suddividono le loro installazioni in più componenti per packaging separati. Ad esempio, un progetto può definire un componente ``Runtime`` che contiene i file necessari per eseguire un tool; un componente ``Development`` contenente i file necessari per creare estensioni per il tool; e un componente ``Documentation`` contenente le pagine del manuale e altri file di aiuto. Il progetto può quindi impacchettare ciascun componente separatamente per la distribuzione installando un solo componente alla volta. Per default, tutti i componenti vengono installati. L'installazione "component-specific" è una funzionalità avanzata destinata all'uso da parte dei manutentori dei pacchetti. Richiede l'invocazione manuale degli script di installazione con un argomento che definisce la variabile ``COMPONENT`` per denominare il componente desiderato. Si noti che i nomi dei componenti non sono definiti da CMake. Ogni progetto può definire il proprio insieme di componenti.

source: This argument specifies that it is not an error if the input file to be installed does not exist. If the input file exists, it will be installed as requested. If it does not exist, it will be silently not installed.
it: Questo argomento specifica che non è un errore se il file di input da installare non esiste. Se il file di input esiste, verrà installato come richiesto. Se non esiste, verrà tacitamente non installato.

source: Installing Targets
it: Installazione dei Target

source: Projects typically install some of the library and executable files created during their build process. The :command:`install` command provides the ``TARGETS`` signature for this purpose.
it: I progetti in genere installano parte della libreria e dei file eseguibili creati durante il processo di build. Il comando :command:`install` fornisce la firma ``TARGETS`` per questo scopo.

source: The ``TARGETS`` keyword is immediately followed by a list of the targets created using :command:`add_executable` or :command:`add_library`, which are to be installed. One or more files corresponding to each target will be installed.
it: La parola chiave ``TARGETS`` viene immediatamente seguita da un elenco dei target creati utilizzando :command:`add_executable` o :command:`add_library` e che devono essere installati. Verranno installati uno o più file corrispondenti a ciascun target.

source: Files installed with this signature may be divided into categories such as ``ARCHIVE``, ``LIBRARY``, or ``RUNTIME``. These categories are designed to group target files by typical installation destination. The corresponding keyword arguments are optional, but if present, specify that other arguments following them apply only to target files of that type. Target files are categorized as follows:
it: I file installati con questa firma possono essere suddivisi in categorie come ``ARCHIVE``, ``LIBRARY`` o ``RUNTIME``. Tali categorie sono progettate per raggruppare i file target in base alla destinazione di installazione tipica. Gli argomenti delle parole chiave corrispondenti sono facoltativi, ma se presenti, specifica che gli altri argomenti che li seguono si applicano solo ai file target di quel tipo. I file target sono classificati come segue:

source: Created by :command:`add_executable` (.exe on Windows, no extension on UNIX)
it: Creato da :command:`add_executable` (.exe su Windows, senza estensione su UNIX)

source: Created by :command:`add_library` with the ``MODULE`` option (.dll on Windows, .so on UNIX)
it: Creato da :command:`add_library` con l'opzione ``MODULE`` (.dll su Windows, .so su UNIX)

source: Created by :command:`add_library` with the ``SHARED`` option on UNIX-like platforms (.so on most UNIX, .dylib on Mac)
it: Creato da :command:`add_library` con l'opzione ``SHARED`` su piattaforme simili a UNIX (.so sulla maggior parte degli UNIX, .dylib su Mac)

source: Created by :command:`add_library` with the ``SHARED`` option on Windows platforms (.dll)
it: Creato da :command:`add_library` con l'opzione ``SHARED`` su piattaforme Windows (.dll)

source: A linkable file created by a dynamic-link library that exports symbols (.lib on most Windows, .dll.a on Cygwin and MinGW).
it: Un file linkabile creato da una libreria dinamica che esporta simboli (.lib sulla maggior parte di Windows, .dll.a su Cygwin e MinGW).

source: Created by :command:`add_library` with the ``STATIC`` option (.lib on Windows, .a on UNIX, Cygwin, and MinGW)
it: Creato da :command:`add_library` con l'opzione ``STATIC`` (.lib su Windows, .a su UNIX, Cygwin e MinGW)

source: Consider a project that defines an executable, ``myExecutable``, which links to a shared library ``mySharedLib``. It also provides a static library ``myStaticLib`` and a plugin module to the executable called ``myPlugin`` that also links to the shared library. The executable, static library, and plugin file may be installed individually using the commands
it: Si considera un progetto che definisce un eseguibile, ``myExecutable``, che si linka a una libreria shared ``mySharedLib``. Fornisce inoltre una libreria statica ``myStaticLib`` e un modulo plugin per l'eseguibile chiamato ``myPlugin`` che si collega anche alla libreria shared. L'eseguibile, la libreria statica e il file plugin possono essere installati individualmente utilizzando i comandi

source: The executable will not be able to run from the installed location until the shared library to it links to is also installed. Installation of the library requires a bit more care in order to support all platforms. It must be installed in a location searched by the dynamic linker on each platform. On UNIX-like platforms, the library is typically installed to ``lib``, while on Windows it should be placed next to the executable in ``bin``. An additional challenge is that the import library associated with the shared library on Windows should be treated like the static library, and installed to ``lib/myproject``. In other words, we have three different kinds of files created with a single target name that must be installed to three different destinations! Fortunately, this problem can be solved using the category keyword arguments. The shared library may be installed using the command:
it: L'eseguibile non sarà in grado di essere eseguito dalla posizione di installazione fino a quando non sarà installata anche la libreria shared a cui si collega. L'installazione della libreria richiede un po' più di cura per supportare tutte le piattaforme. Deve essere installata in una posizione cercata dal linker dinamico su ogni piattaforma. Su piattaforme UNIX-like, la libreria è generalmente installata in ``lib``, mentre su Windows dovrebbe essere posizionata accanto all'eseguibile in ``bin``. Un'ulteriore sfida è che la libreria di importazione associata alla libreria shared su Windows dovrebbe essere trattata come libreria statica e installata in ``lib/myproject``. In altre parole, abbiamo tre diversi tipi di file creati con un unico nome di target che devono essere installati in tre diverse destinazioni! Fortunatamente, questo problema può essere risolto utilizzando la categoria di argomenti delle parole chiavi. La libreria shared può essere installata utilizzando il comando:

source: This tells CMake that the ``RUNTIME`` file (.dll) should be installed to ``bin``, the ``LIBRARY`` file (.so) should be installed to ``lib``, and the ``ARCHIVE`` (.lib) file should be installed to ``lib/myproject``. On UNIX, the ``LIBRARY`` file will be installed; on Windows, the ``RUNTIME`` and ``ARCHIVE`` files will be installed.
it: Questo dice a CMake che il file di ``RUNTIME`` (.dll) deve essere installato in ``bin``, il file ``LIBRARY`` (.so) deve essere installato in ``lib`` e il file ``ARCHIVE`` (.lib) dovrebbe essere installato in ``lib/myproject``. Su UNIX, verrà installato il file ``LIBRARY``; su Windows, verranno installati i file ``RUNTIME`` e ``ARCHIVE``.

source: If the above sample project is to be packaged into separate run time and development components, we must assign the appropriate component to each target file installed. The executable, shared library, and plugin are required in order to run the application, so they belong in a ``Runtime`` component. Meanwhile, the import library (corresponding to the shared library on Windows) and the static library are only required to develop extensions to the application, and therefore belong in a ``Development`` component.
it: Se il progetto di esempio precedente deve essere impacchettato in componenti separati di runtime e di sviluppo, dobbiamo assegnare il componente appropriato a ciascun file target installato. L'eseguibile, la libreria shared e il plug-in sono necessari per eseguire l'applicazione, quindi appartengono a un componente ``Runtime``. Nel frattempo, la libreria di importazione (corrispondente alla libreria shared su Windows) e la libreria statica sono necessarie solo per sviluppare estensioni all'applicazione, e quindi appartengono a un componente ``Development``.

source: Component assignments may be specified by adding the ``COMPONENT`` argument to each of the commands above. You may also combine all of the installation rules into a single command invocation, which is equivalent to all of the above commands with components added. The files generated by each target are installed using the rule for their category.
it: Le assegnazioni dei componenti possono essere specificate aggiungendo l'argomento ``COMPONENT`` a ciascuno dei comandi precedenti. È inoltre possibile combinare tutte le regole di installazione in un'unica chiamata di comando, che equivale a tutti i comandi precedenti con l'aggiunta dei componenti. I file generati da ciascun target vengono installati utilizzando la regola per la loro categoria.

source: Either ``NAMELINK_ONLY`` or ``NAMELINK_SKIP`` may be specified as a ``LIBRARY`` option. On some platforms, a versioned shared library has a symbolic link such as
it: Si può specificare ``NAMELINK_ONLY`` o ``NAMELINK_SKIP`` come opzione di ``LIBRARY``. Su alcune piattaforme, una libreria shared versionata ha un link simbolico come

source: where ``lib<name>.so.1`` is the soname of the library, and ``lib<name>.so`` is a "namelink" that helps linkers to find the library when given ``-l<name>``. The ``NAMELINK_ONLY`` option results in installation of only the namelink when a library target is installed. The ``NAMELINK_SKIP`` option causes installation of library files other than the namelink when a library target is installed. When neither option is given, both portions are installed. On platforms where versioned shared libraries do not have namelinks, or when a library is not versioned, the ``NAMELINK_SKIP`` option installs the library and the ``NAMELINK_ONLY`` option installs nothing. See the :prop_tgt:`VERSION` and :prop_tgt:`SOVERSION` target properties for details on creating versioned, shared libraries.
it: dove ``lib<name>.so.1`` è il "soname" della libreria, e ``lib<name>.so`` è un "namelink" che aiuta i linker a trovare la libreria quando viene dato ``-l<name>``. L'opzione ``NAMELINK_ONLY`` comporta l'installazione del solo namelink quando è installata una libreria target. L'opzione ``NAMELINK_SKIP`` provoca l'installazione di file di libreria diversi dal namelink quando viene installato un target di libreria. Quando non viene fornita nessuna opzione, vengono installate entrambe le parti. Sulle piattaforme in cui le librerie shared con versione non hanno collegamenti ai nomi o quando una libreria non è dotata di versione, l'opzione ``NAMELINK_SKIP`` installa la libreria e l'opzione ``NAMELINK_ONLY`` non installa nulla. Consultare le proprietà dei target :prop_tgt:`VERSION` e :prop_tgt:`SOVERSION` per i dettagli sulla creazione di librerie shared e con una versione.

source: Projects may install files other than those that are created with :command:`add_executable` or :command:`add_library`, such as header files or documentation. General-purpose installation of files is specified using the ``FILES`` signature.
it: I progetti possono installare file diversi da quelli creati con :command:`add_executable` o con :command:`add_library`, come file header o documentazione. L'installazione generica dei file viene specificata utilizzando la firma ``FILES``.

source: The ``FILES`` keyword is immediately followed by a list of files to be installed. Relative paths are evaluated with respect to the current source directory. Files will be installed to the given ``DESTINATION`` directory. For example, the command
it: La parola chiave ``FILES`` è immediatamente seguita da un elenco di file da installare. I path relativi vengono valutati rispetto alla directory dei sorgenti corrente. I file verranno installati nella directory ``DESTINATION`` specificata. Ad esempio, il comando
