Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Additional regular expressions to consider a build line not as an error line
it: Espressioni regolari aggiuntive per considerare una riga di build come una riga di errore

source: Additional regular expressions to consider a build line as a warning line
it: Espressioni regolari aggiuntive per considerare una riga di build come una riga di warning

source: Additional regular expressions to consider a build line not as a warning line
it: Espressioni regolari aggiuntive per considerare una riga di build come una riga di warning

source: Maximum number of errors before CTest stops reporting errors (default 50)
it: Numero massimo di errori prima che CTest smetta di segnalare gli errori (default 50)

source: Maximum number of warnings before CTest stops reporting warnings (default 50)
it: Numero massimo di warning prima che CTest smetta di segnalarli (default 50)

source: Regular expressions for files to be excluded from the coverage analysis
it: Espressioni regolari per i file da escludere dall'analisi della "coverage"

source: List of commands to execute before performing memory checking
it: Elenco dei comandi da eseguire prima di eseguire il controllo della memoria

source: List of commands to execute after performing memory checking
it: Elenco dei comandi da eseguire dopo aver eseguito il controllo della memoria

source: List of tests to exclude from the memory checking step
it: Elenco dei test da escludere dalla fase di verifica della memoria

source: List of commands to execute before performing testing
it: Elenco dei comandi da eseguire prima di eseguire il test

source: List of commands to execute after performing testing
it: Elenco dei comandi da eseguire dopo aver eseguito il test

source: List of tests to exclude from the testing step
it: Elenco dei test da escludere dalla fase di test

source: Maximum size of test output for the passed test (default 1k)
it: Dimensione massima dell'output del test per il test superato (default 1k)

source: Maximum size of test output for the failed test (default 300k)
it: Dimensione massima dell'output del test per il test fallito (default 300k)

source: Commands specified in ``CTEST_CUSTOM_PRE_TEST`` and ``CTEST_CUSTOM_POST_TEST``, as well as the equivalent memory checking ones, are executed once per CTest run. These commands can be used, for example, if all tests require some initial setup and some final cleanup to be performed.
it: I comandi specificati in ``CTEST_CUSTOM_PRE_TEST`` e ``CTEST_CUSTOM_POST_TEST``, oltre a quelli equivalenti per il controllo della memoria, vengono eseguiti una volta per esecuzione di CTest. Questi comandi possono essere utilizzati, ad esempio, se tutti i test richiedono l'esecuzione di una configurazione iniziale e di una pulizia finale.

source: Adding Notes to a Dashboard
it: Aggiungere Note a una Dashboard

source: CTest and CDash support adding note files to a dashboard submission. These will appear on the dashboard as a clickable icon that links to the text of all the files. To add notes, call CTest with the -A option followed by a semicolon-separated list of filenames. The contents of these files will be submitted as notes for the dashboard. For example::
it: CTest e CDash supportano l'aggiunta di file di note a un invio di dashboard. Questi appariranno sulla dashboard come un'icona cliccabile che si collega al testo di tutti i file. Per aggiungere le note, si chiama CTest con l'opzione -A seguita da un elenco di nomi di file separati da punto e virgola. Il contenuto di questi file verrà inviato come note per la dashboard. Per esempio::

source: Another way to submit notes with a dashboard is to copy or write the notes as files into a Notes directory under the ``Testing`` directory of your binary tree. Any files found there when CTest submits a dashboard will also be uploaded as notes.
it: Un altro modo per inviare note con una dashboard è copiare o scrivere le note come file in una directory Notes nella directory ``Testing`` dell'albero binario. Anche tutti i file trovati lì quando CTest invia una dashboard verranno caricati come note.

source: CTest Scripting
it: Script di CTest

source: This section describes how to write command-based CTest scripts that allow the maintainer to have fine-grained control over the individual steps of a dashboard.
it: Questa sezione descrive come scrivere script CTest basati su comandi che consentono al manutentore di avere un controllo granulare sui singoli passaggi di una dashboard.

source: The dashboard maintainer has access to individual CTest command functions, such as :command:`ctest_configure` and :command:`ctest_build`. By running these functions individually, the user can flexibly develop custom testing schemes. Here's an example of a CTest script
it: Il manutentore della dashboard ha accesso alle singole funzioni di comando CTest, come :command:`ctest_configure` e :command:`ctest_build`. Eseguendo queste funzioni individualmente, l'utente può sviluppare in modo flessibile schemi di test personalizzati. Ecco un esempio di uno script CTest

source: The first block contains the variables about the submission.
it: Il primo blocco contiene le variabili relative all'invio.

source: These variables are used to identify the system once it submits the results to the dashboard. ``CTEST_NOTES_FILES`` is a list of files that should be submitted as the notes of the dashboard submission. This variable corresponds to the -A flag of :manual:`ctest <ctest(1)>`.
it: Queste variabili vengono utilizzate per identificare il sistema una volta che invia i risultati alla dashboard. ``CTEST_NOTES_FILES`` è un elenco di file che devono essere inviati come le note dell'invio della dashboard. Questa variabile corrisponde al flag -A di :manual:`ctest <ctest(1)>`.

source: The second block describes the information that CTest functions will use to perform the tasks:
it: Il secondo blocco descrive le informazioni che le funzioni CTest utilizzeranno per eseguire le attività:

source: The ``CTEST_UPDATE_COMMAND`` is the path to the command used to update the source directory from the repository. Currently CTest supports Concurrent Versions System (CVS), Subversion, Git, Mercurial, and Bazaar.
it: ``CTEST_UPDATE_COMMAND`` è il path del comando utilizzato per aggiornare la directory dei sorgenti dal repository. Attualmente CTest supporta Concurrent Versions System (CVS), Subversion, Git, Mercurial e Bazaar.

source: Both the configure and build handlers support two modes. One mode is to provide the full command that will be invoked during that stage. This is designed to support projects that do not use CMake as their configuration or build tool. In this case, you specify the full command lines to configure and build your project by setting the :variable:`CTEST_CONFIGURE_COMMAND` and :variable:`CTEST_BUILD_COMMAND` variables respectively.
it: Entrambi i gestori configure e build supportano due modalità Una modalità consiste nel fornire il comando completo che verrà richiamato durante quella fase. Questo è progettato per supportare progetti che non utilizzano CMake come strumento di configurazione o build. In questo caso, si devono specificare le righe di comando complete per configurare e creare il progetto impostando rispettivamente le variabili :variable:`CTEST_CONFIGURE_COMMAND` e :variable:`CTEST_BUILD_COMMAND`.

source: For the build step you should also set the variables ``CTEST_PROJECT_NAME`` and ``CTEST_BUILD_CONFIGURATION``, to specify how to build the project. In this case ``CTEST_PROJECT_NAME`` will match the top level CMakeLists file's :command:`project` command. The ``CTEST_BUILD_CONFIGURATION`` should be one of Release, Debug, MinSizeRel, or RelWithDebInfo. Additionally, ``CTEST_BUILD_FLAGS`` can be provided as a hint to the build command. An example of testing for a CMake based project would be:
it: Per la fase di build si devono anche impostare le variabili ``CTEST_PROJECT_NAME`` e ``CTEST_BUILD_CONFIGURATION``, per specificare come eseguire la build del progetto. In questo caso ``CTEST_PROJECT_NAME`` corrisponderà al comando :command:`project` del file CMakeLists di primo livello. ``CTEST_BUILD_CONFIGURATION`` deve essere uno tra Release, Debug, MinSizeRel o RelWithDebInfo. Inoltre, ``CTEST_BUILD_FLAGS`` può essere fornito come suggerimento per il comando build. Un esempio di test per un progetto basato su CMake potrebbe essere:

source: The final block performs the actual testing and submission:
it: Il blocco finale esegue il test e l'invio effettivi:

source: The :command:`ctest_empty_binary_directory` command empties the directory and all subdirectories. Please note that this command has a safety measure built in, which is that it will only remove the directory if there is a CMakeCache.txt file in the top level directory. This was intended to prevent CTest from mistakenly removing a non-build directory.
it: Il comando :command:`ctest_empty_binary_directory` svuota la directory e tutte le sottodirectory. Si noti che questo comando ha una misura di sicurezza incorporata, ovvero rimuoverà la directory solo se è presente un file CMakeCache.txt nella directory di livello superiore. Questo aveva lo scopo di impedire a CTest di rimuovere erroneamente una directory non di build.

source: The rest of the block contains the calls to the actual CTest functions. Each of them corresponds to a CTest -D option. For example, instead of::
it: Il resto del blocco contiene le chiamate alle effettive funzioni CTest. Ciascuno di essi corrisponde a un'opzione CTest -D. Ad esempio, invece di::

source: the script would contain::
it: lo script conterrebbe::

source: Each step yields a return value, which indicates if the step was successful. For example, the return value of the Update stage can be used in a continuous dashboard to determine if the rest of the dashboard should be run.
it: Ogni passaggio restituisce un valore di ritorno, che indica se il passaggio ha avuto esito positivo. Ad esempio, il valore restituito della fase di aggiornamento può essere utilizzato in una dashboard continua per determinare se il resto della dashboard deve essere eseguito.

source: Let us examine a more advanced CTest script. This script drives testing of an application called Slicer. Slicer uses CMake internally, but it drives the build process through a series of Tcl scripts. One of the problems of this approach is that it does not support out-of-source builds. Also, on Windows certain modules come pre-built, so they have to be copied to the build directory. To test a project like that, we would use a script like this:
it: Esaminiamo uno script CTest più avanzato. Questo script guida il test di un'applicazione chiamata Slicer. Slicer utilizza CMake internamente, ma guida il processo di build attraverso una serie di script Tcl. Uno dei problemi di questo approccio è che non supporta build "out-of-source". Inoltre, su Windows alcuni moduli sono precompilati, quindi devono essere copiati nella directory di build. Per testare un progetto del genere, useremmo uno script come questo:

source: With extended CTest scripting we have full control over the flow, so we can perform arbitrary commands at any point. For example, after performing an update of the project, the script copies the source tree into the build directory. This allows it to do an "out-of-source" build.
it: Con lo scripting CTest esteso abbiamo il pieno controllo del flusso, quindi possiamo eseguire comandi arbitrari in qualsiasi momento. Ad esempio, dopo aver eseguito un aggiornamento del progetto, lo script copia l'albero dei sorgenti nella directory di build. Ciò gli consente di eseguire una build "out-of-source".

source: Project Roles: CDash supports three role levels for users
it: Ruoli del progetto: CDash supporta tre livelli di ruolo per gli utenti

source: Normal users are regular users with read and/or write access to the project's code repository.
it: Gli utenti normali sono utenti regolari con accesso in lettura e/o scrittura al repository del codice del progetto.

source: Site maintainers are responsible for periodic submissions to CDash.
it: I manutentori del sito sono responsabili degli invii periodici a CDash.

source: Project administrators have reserved privileges to administer the project in CDash.
it: Gli amministratori del progetto hanno privilegi riservati per amministrare il progetto in CDash.

source: The first two levels can be defined by the users themselves. Project administrator access must be granted by another administrator of the project, or a CDash server administrator.
it: I primi due livelli possono essere definiti dagli utenti stessi. L'accesso come amministratore del progetto deve essere concesso da un altro amministratore del progetto o da un amministratore del server CDash.

source: Submission backup
it: Backup degli Invii

source: CDash backups all the incoming XML submissions and places them in the ``backup`` directory by default. The default timeframe is 48 hours. The timeframe can be changed in the ``config.local.php`` as follows::
it: CDash esegue il backup di tutti gli invii XML in arrivo e li inserisce nella directory ``backup`` per default. L'intervallo di tempo di default è di 48 ore. L'intervallo di tempo può essere modificato in ``config.local.php`` come segue::

source: If projects are private it is recommended to set the backup directory outside of the apache root directory to make sure that nobody can access the XML files, or to add the following lines to the .htaccess in the backup directory::
it: Se i progetti sono privati, si consiglia di impostare la directory di backup al di fuori di quella principale di apache per assicurarsi che nessuno possa accedere ai file XML o di aggiungere le seguenti righe al file .htaccess nella directory di backup::

source: Note that the backup directory is emptied only when a new submission arrives. If necessary, CDash can also import builds from the backup directory.
it: Si noti che la directory di backup viene svuotata solo quando arriva un nuovo invio. Se necessario, CDash può anche importare build dalla directory di backup.

source: Build Groups
it: Gruppi di Build

source: Builds can be organized by groups. In CDash, three groups are defined automatically and cannot be removed: ``Nightly``, ``Continuous`` and ``Experimental``. These groups are the same as the ones imposed by CTest. Each group has an associated description that is displayed when clicking on the name of the group on the main dashboard.
it: Le build possono essere organizzate per gruppi. In CDash, tre gruppi vengono definiti automaticamente e non possono essere rimossi: ``Nightly``, ``Continuous`` e ``Experimental``. Questi gruppi sono gli stessi imposti da CTest. Ogni gruppo ha una descrizione associata che viene visualizzata quando si fa clic sul nome del gruppo nella dashboard principale.

source: By default, a build belongs to the group associated with the build type defined by CTest, i.e. a nightly build will go in the Nightly section. CDash matches a build by its name, site, and build type. For instance, a nightly build named "Linux-gcc-4.3" from the site "midworld.kitware will be moved to the Nightly section unless a rule on "Linux-gcc-4.3"-"midworld.kitware"-"Nightly" is defined. There are two ways to move a build into a given group by defining a rule: Global Move and Single Move.
it: Per default, una build appartiene al gruppo associato al tipo di build definito da CTest, ovvero una build notturna andrà nella sezione Nightly. CDash abbina una build in base al nome, al sito e al tipo di build. Ad esempio, una build notturna denominata "Linux-gcc-4.3" dal sito "midworld.kitware" verrà spostata nella sezione Nightly a meno che non sia presente una regola su "Linux-gcc-4.3"-"midworld.kitware"-"Nightly". Esistono due modi per spostare una build in un determinato gruppo definendo una regola: Global Move e Single Move.

source: Single move allows modifying only a particular build
it: La single move consente di modificare solo una particolare build

source: If logged in as an administrator of the project, a small folder icon is displayed next to each build on the main dashboard page. Clicking on the icon shows some options for each build. In particular, project administrators can mark a build as expected, move a build to a specific group, or delete a bogus build.
it: Se si è effettuato l'accesso come amministratore del progetto, viene visualizzata una piccola icona di cartella accanto a ciascuna build nella pagina principale della dashboard. Facendo clic sull'icona vengono visualizzate alcune opzioni per ciascuna build. In particolare, gli amministratori del progetto possono contrassegnare una build come prevista, spostare una build in un gruppo specifico o eliminare una build bacata.

source: Expected builds: Project administrators can mark certain builds as expected. That means builds are expected to submit daily. This allows you to quickly check if a build has not been submitting on today's dashboard, or to quickly assess how long the build has been missing by clicking on the info icon on the main dashboard.
it: Build previste [expected]: Gli amministratori del progetto possono contrassegnare determinate build come previste. Ciò significa che le build devono essere inviate quotidianamente. Questo consente di verificare rapidamente se una build non è stata inviata nella dashboard odierna o di valutare rapidamente da quanto tempo manca la build facendo clic sull'icona delle informazioni sulla dashboard principale.

source: If an expected build was not submitted the previous day and the option "Email Build Missing" is checked for the project, an email will be sent to the site maintainer and project administrator to alert them (see the Sites section for more information).
it: Se una build "expected" non è stata inviata il giorno precedente e l'opzione "Email Build Missing" è selezionata per il progetto, verrà inviata un'e-mail al manutentore del sito e all'amministratore del progetto per avvisarli (vedere la sezione Siti per maggiori informazioni).

source: CDash sends email to developers and project administrators when a failure occurs for a given build. The configuration of the email feature is located in three places: the ``config.local.php`` file, the project administration section, and the project's groups section.
it: CDash invia e-mail agli sviluppatori e agli amministratori di progetto quando si verifica un errore per una determinata build. La configurazione della funzione email si trova in tre posizioni: il file ``config.local.php``, la sezione di amministrazione del progetto e la sezione dei gruppi del progetto.

source: In the ``config.local.php``, two variables are defined to specify the email address from which email is sent and the reply address. Note that the SMTP server cannot be defined in the current version of CDash, it is assumed that a local email server is running on the machine.
it: In ``config.local.php``, sono definite due variabili per specificare l'indirizzo e-mail da cui viene inviata l'e-mail e l'indirizzo di risposta. Si noti che il server SMTP non può essere definito nella versione corrente di CDash, si presume che sulla macchina sia in esecuzione un server di posta locale.

source: In the email configuration section of the project, several parameters can be tuned to control the email feature.
it: Nella sezione di configurazione della posta elettronica del progetto, è possibile regolare diversi parametri per controllare la funzione di posta elettronica.

source: In the "build groups" administration section of a project, an administrator can decide if emails are sent to a specific group, or if only a summary email should be sent. The summary email is sent for a given group when at least one build is failing on the current day.
it: Nella sezione di amministrazione "build groups" di un progetto, un amministratore può decidere se inviare le email a un gruppo specifico o se inviare solo un'email di riepilogo. L'e-mail di riepilogo viene inviata per un determinato gruppo quando almeno una build non riesce nel giorno corrente.

source: Sites
it: Siti

source: CDash refers to a site as an individual machine submitting at least one build to a given project. A site might submit multiple builds (e.g. nightly and continuous) to multiple projects stored in CDash.
it: CDash si riferisce a un sito come a una singola macchina che invia almeno una build a un determinato progetto. Un sito potrebbe inviare più build (ad esempio notturne e continue) a più progetti archiviati in CDash.

source: In order to see the site description, click on the name of the site from the main dashboard page for a project. The description of a site includes information regarding the processor type and speed, as well as the amount of memory available on the given machine. The description of a site is automatically sent by CTest, however in some cases it might be required to manually edit it. Moreover, if the machine is upgraded, i.e. the memory is upgraded; CDash keeps track of the history of the description, allowing users to compare performance before and after the upgrade.
it: Per visualizzare la descrizione del sito, fare clic sul nome del sito dalla pagina principale della dashboard per un progetto. La descrizione di un sito include informazioni riguardanti il tipo e la velocità del processore, nonché la quantità di memoria disponibile sulla macchina in questione. La descrizione di un sito viene inviata automaticamente da CTest, tuttavia in alcuni casi potrebbe essere necessario modificarla manualmente. Inoltre, se la macchina viene aggiornata, cioè la memoria viene aggiornata; CDash tiene traccia della cronologia della descrizione, consentendo agli utenti di confrontare le prestazioni prima e dopo l'aggiornamento.

source: Sites usually belong to one maintainer, responsible for the submissions to CDash. It is important for site maintainers to be warned when a site is not submitting as it could be related to a configuration issue.
it: I siti di solito appartengono a un manutentore, responsabile degli invii a CDash. È importante che i manutentori del sito vengano avvisati quando un sito non viene inviato poiché potrebbe essere correlato a un problema di configurazione.

source: Once a site is claimed, its maintainer will receive emails if the client machine does not submit for an unknown reason, assuming that the site is expected to submit nightly. Furthermore, the site will appear in the "My Sites" section of the maintainer's profile, facilitating a quick check of the site's status.
it: Una volta rivendicato un sito, il suo manutentore riceverà una e-mail se il computer client non invia per un motivo sconosciuto, supponendo che il sito debba essere inviato ogni notte. Inoltre, il sito comparirà nella sezione "My Sites" del profilo del manutentore, facilitando una rapida verifica dello stato del sito.

source: Another feature of the site page is the pie chart showing the load of the machine. Assuming that a site submits to multiple projects, it is usually useful to know if the machine has room for other submissions to CDash. The pie chart gives an overview of the machine submission time for each project.
it: Un'altra caratteristica della pagina del sito è il grafico a torta che mostra il carico della macchina. Supponendo che un sito invii a più progetti, di solito è utile sapere se la macchina ha spazio per altri invii a CDash. Il grafico a torta fornisce una panoramica del tempo di invio della macchina per ciascun progetto.

source: Graphs
it: Grafici

source: CDash currently plots three types of graphs. The graphs are generated dynamically from the database records, and are interactive.
it: CDash disegna attualmente tre tipi di grafici. I grafici sono generati dinamicamente dai record del database e sono interattivi.
