Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Before developing CMake, its authors had experience with the existing set of available build tools. Autoconf combined with Automake provides some of the same functionality as CMake, but to use these tools on a Windows platform requires the installation of many additional tools not found natively on a Windows box. In addition to requiring a host of tools, autoconf can be difficult to use or extend, and impossible for performing some tasks that are easy in CMake. Even if you do get autoconf and its required environment running on your system, it generates Makefiles that will force users to the command line. CMake on the other hand, provides a choice, allowing developers to generate project files that can be used directly from the IDE to which Windows and Xcode developers are accustomed.
it: Prima di sviluppare CMake, i suoi autori usavano il set esistente di strumenti di build disponibili. Autoconf combinato con Automake fornisce alcune delle stesse funzionalità di CMake, ma per utilizzare questi strumenti su una piattaforma Windows è necessaria l'installazione di molti strumenti aggiuntivi che non si trovano nativamente su una macchina Windows. Oltre a richiedere una serie di strumenti, autoconf può essere difficile da usare o estendere e impossibile eseguire alcune attività che risultano facili in CMake. Anche se si ha autoconf e il suo ambiente in esecuzione sul sistema, genera Makefile che costringeranno gli utenti alla riga di comando. CMake, d'altra parte, offre una scelta, consentendo agli sviluppatori di generare file di progetto utilizzabili direttamente dall'IDE a cui sono abituati gli sviluppatori Windows e Xcode.

source: While autoconf supports user-specified options, it does not support dependent options where one option depends on another property or selection. For example, in CMake you could have a user option to have multithreading be dependent on first determining if the user's system has multithreading support. CMake provides an interactive user interface, making it easy for the user to see which options are available and how to set them.
it: Sebbene autoconf supporti le opzioni specificate dall'utente, non supporta quelle dipendenti in cui un'opzione dipende da un'altra proprietà o selezione. Ad esempio, in CMake si potrebbe avere un'opzione utente per far dipendere il multithreading dalla prima determinazione se il sistema dell'utente ha il supporto multithreading. CMake fornisce un'interfaccia utente interattiva, che consente all'utente di vedere facilmente quali opzioni sono disponibili e come impostarle.

source: For UNIX users, CMake also provides automated dependency generation that is not done directly by autoconf. CMake's simple input format is also easier to read and maintain than a combination of Makefile.in and configure.in files. The ability of CMake to remember and chain library dependency information has no equivalent in autoconf/automake.
it: Per gli utenti UNIX, CMake fornisce anche la generazione automatica delle dipendenze che non viene gestita direttamente da autoconf. Il semplice formato di input di CMake è anche più facile da leggere e gestire rispetto a una combinazione di file Makefile.in e configure.in. La capacità di CMake di ricordare e concatenare le informazioni sulle dipendenze della libreria non ha equivalenti in autoconf/automake.

source: Why Not Use JAM, qmake, SCons, or ANT?
it: Perché non utilizzare JAM, qmake, SCons o ANT?

source: Other tools such as ANT, qmake, SCons, and JAM have taken different approaches to solving these problems and they have helped us to shape CMake. Of the four, qmake is the most similar to CMake, although it lacks much of the system interrogation that CMake provides. Qmake's input format is more closely related to a traditional Makefile. ANT, JAM, and SCons are also cross-platform although they do not support generating native project files. They do break away from the traditional Makefile-oriented input with ANT using XML; JAM using its own language; and SCons using Python. A number of these tools run the compiler directly, as opposed to letting the system's build process perform that task. Many of these tools require other tools such as Python or Java to be installed before they will work.
it: Altri strumenti come ANT, qmake, SCons e JAM hanno adottato approcci diversi per risolvere questi problemi e ci hanno aiutato a dare forma a CMake. Dei quattro, qmake è il più simile a CMake, sebbene manchi gran parte dell'interrogazione del sistema fornita da CMake. Il formato di input di Qmake è più simile a un Makefile tradizionale. Anche ANT, JAM e SCons sono multipiattaforma sebbene non supportino la generazione di file di progetto nativi. Si staccano dal tradizionale input orientato al Makefile con ANT che usa XML; JAM col proprio linguaggio; e SCons che usa Python. Alcuni di questi strumenti eseguono direttamente il compilatore, invece di lasciare che il processo di build del sistema esegua quell'attività. Molti di questi strumenti richiedono l'installazione di altri come Python o Java prima che funzionino.

source: Why Not Script It Yourself?
it: Perché non degli Script Autoprodotti?

source: Some projects use existing scripting languages such as Perl or Python to configure build processes. Although similar functionality can be achieved with systems like this, over-use of these tools can make the build process more of an Easter egg hunt than a simple-to-use build system. When building your software package, users are forced to find and install version 4.3.2 of this and 3.2.4 of that before they can even start the build process. To avoid that problem, it was decided that CMake would require no more tools than the software it was being used to build would require. At a minimum, using CMake requires a C compiler, that compiler's native build tools, and a CMake executable. CMake was written in C++, requires only a C++ compiler to build, and precompiled binaries are available for most systems. Scripting it yourself also typically means you will not be generating native Xcode or Visual Studio workspaces, making Mac and Windows builds limited.
it: Alcuni progetti utilizzano linguaggi di scripting esistenti come Perl o Python per configurare i processi di build. Sebbene sia possibile ottenere funzionalità simili con sistemi come questo, l'uso eccessivo di tali strumenti può rendere il processo di build più simile a una "caccia al tesoro" che a un sistema di build semplice da usare. Durante la creazione del pacchetto software, gli utenti sono costretti a trovare e installare la versione 4.3.2 di questo e 3.2.4 di quello prima ancora di poter avviare il processo di build. Per evitare questo problema, è stato deciso che CMake non avrebbe richiesto più strumenti di quelli richiesti dal software che veniva utilizzato per il build. Come minimo, l'utilizzo di CMake richiede un compilatore C, gli strumenti nativi del compilatore e un eseguibile CMake. CMake è stato scritto in C++, richiede solo un compilatore C++ per la compilazione e i binari precompilati sono disponibili per la maggior parte dei sistemi. Generando script autonomamente in genere significa anche che non si produrranno aree di lavoro Xcode o Visual Studio native, limitando le build di Mac e Windows.

source: On What Platforms Does CMake Run?
it: Su quali piattaforme funziona CMake?

source: CMake runs on a wide variety of platforms including Microsoft Windows, Apple Mac OS X, and most UNIX or UNIX-like platforms. Likewise, CMake supports most common compilers.
it: CMake funziona su un'ampia varietà di piattaforme tra cui Microsoft Windows, Apple Mac OS X e la maggior parte delle piattaforme UNIX o simili. Allo stesso modo, CMake supporta i compilatori più comuni.

source: How Stable is CMake?
it: Quanto è stabile CMake?

source: Before adopting any new technology or tool for a project, a developer will want to know how well supported and popular the tool is. Since the initial CMake implementation , CMake has grown in popularity as a build tool. Both the developer and user communities continue to grow. CMake has continued to develop support for new build technologies and tools as they become available. The CMake development team has a strong commitment to backwards compatibility. If CMake can build your project once, it should always be able to build your project. Also, since CMake is an open-source project, the source code is always available for a project to edit and patch as needed.
it: Prima di adottare qualsiasi nuova tecnologia o strumento per un progetto, uno sviluppatore vorrà sapere quanto è ben supportato e popolare. Dall'implementazione iniziale, CMake è cresciuto in popolarità come strumento di build. Sia la community di sviluppatori che quella di utenti continuano a crescere. CMake ha continuato a sviluppare il supporto per nuove tecnologie e strumenti di build non appena si rendono disponibili. Il team di sviluppo di CMake è molto impegnato per la compatibilità con le versioni precedenti. Se CMake può creare il progetto una volta, dovrebbe essere in grado di farlo sempre. Inoltre, poiché CMake è un progetto open source, il codice sorgente è sempre disponibile per un progetto da modificare e correggere secondo necessità.

source: Writing CMakeLists Files
it: Scrivere File CMakeLists

source: This chapter will cover the basics of writing effective CMakeLists files for your software. It will cover the basic commands and issues you will need to handle most projects. While CMake can handle extremely complex projects, for most projects you will find this chapter's contents will tell you all you need to know. CMake is driven by the CMakeLists.txt files written for a software project. The CMakeLists files determine everything from which options to present to users, to which source files to compile. In addition to discussing how to write a CMakeLists file, this chapter will also cover how to make them robust and maintainable.
it: Questo capitolo tratterà le basi della scrittura di file CMakeLists efficaci. Tratterà i comandi e i problemi di base necessari per gestire la maggior parte dei progetti. Sebbene CMake sia in grado di gestire progetti estremamente complessi, per la maggior parte dei progetti si scoprirà che i contenuti di questo capitolo diranno tutto ciò che c'è da sapere. CMake è guidato dai file CMakeLists.txt scritti per un progetto software. I file CMakeLists determinano tutto, da quali opzioni presentare agli utenti, a quali file sorgente compilare. Oltre a discutere come scrivere un file CMakeLists, questo capitolo tratterà anche come renderli robusti e manutenibili.

source: Editing CMakeLists Files
it: Modifica dei file CMakeLists

source: CMakeLists files can be edited in almost any text editor. Some editors, such as Notepad++, come with CMake syntax highlighting and indentation support built-in. For editors such as Emacs or Vim, CMake includes indentation and syntax highlighting modes. These can be found in the ``Auxiliary`` directory of the source distribution, or downloaded from the CMake `Download <www.cmake.org/download>`_ page.
it: I file CMakeLists possono essere modificati in quasi tutti gli editor di testo. Alcuni editor, come Notepad++, vengono forniti con l'evidenziazione della sintassi CMake e il supporto dell'indentazione. Per editor come Emacs o Vim, CMake include modalità di indentazione e di evidenziazione della sintassi. Questi si trovano nella directory ``Auxiliary`` della distribuzione sorgente o si possono scaricare dalla pagina di `Download <www.cmake.org/download>`_ di CMake.

source: Within any of the supported generators (Makefiles, Visual Studio, etc.), if you edit a CMakeLists file and rebuild, there are rules that will automatically invoke CMake to update the generated files (e.g. Makefiles or project files) as required. This helps to assure that your generated files are always in sync with your CMakeLists files.
it: All'interno di uno qualsiasi dei generatori supportati (Makefile, Visual Studio, ecc.), se si modifica un file CMakeLists e lo re-builda, ci sono regole che richiameranno automaticamente CMake per aggiornare i file generati (ad es. Makefile o file di progetto) come richiesto. Questo contribuisce a garantire che i file generati siano sempre sincronizzati con i file CMakeLists.

source: CMake Language
it: Il Linguaggio CMake

source: The CMake language is composed of comments, commands, and variables.
it: Il linguaggio CMake è composto da commenti, comandi e variabili.

source: Comments
it: Commenti

source: Comments start with ``#`` and run to the end of the line. See the :manual:`cmake-language <cmake-language(7)>` manual for more details.
it: I commenti iniziano con ``#`` e vanno fino alla fine della riga. Vedere il manuale :manual:`cmake-language <cmake-language(7)>` per maggiori dettagli.

source: Variables
it: Variabili

source: CMakeLists files use variables much like any programming language. CMake variable names are case sensitive and may only contain alphanumeric characters and underscores.
it: I file CMakeLists utilizzano variabili in modo molto simile a qualsiasi altro linguaggio di programmazione. I nomi delle variabili CMake fanno distinzione tra maiuscole e minuscole e possono contenere solo caratteri alfanumerici e caratteri di sottolineatura.

source: A number of useful variables are automatically defined by CMake and are discussed in the :manual:`cmake-variables <cmake-variables(7)>` manual. These variables begin with ``CMAKE_``. Avoid this naming convention (and, ideally, establish your own) for variables specific to your project.
it: Un certo numero di variabili utili sono definite automaticamente da CMake e sono discusse nel manuale :manual:`cmake-variables <cmake-variables(7)>`. Tali variabili iniziano con ``CMAKE_``. Evitare questa convenzione di denominazione (e, idealmente, stabilirne una propria) per le variabili specifiche del progetto.

source: All CMake variables are stored internally as strings although they may sometimes be interpreted as other types.
it: Tutte le variabili CMake sono memorizzate internamente come stringhe sebbene a volte possano essere interpretate come altri tipi.

source: Use the :command:`set` command to set variable values. In its simplest form, the first argument to :command:`set` is the name of the variable and the rest of the arguments are the values. Multiple value arguments are packed into a semicolon-separated list and stored in the variable as a string. For example:
it: Usare il comando :command:`set` per impostare i valori delle variabili. Nella sua forma più semplice, il primo argomento di :command:`set` è il nome della variabile e il resto degli argomenti sono i valori. Più argomenti di valore vengono inseriti in un elenco separato da punti e virgola e memorizzati nella variabile come stringa. Per esempio:

source: Variables may be referenced in command arguments using syntax ``${VAR}`` where ``VAR`` is the variable name. If the named variable is not defined, the reference is replaced with an empty string; otherwise it is replaced by the value of the variable. Replacement is performed prior to the expansion of unquoted arguments, so variable values containing semicolons are split into zero-or-more arguments in place of the original unquoted argument. For example:
it: È possibile fare riferimento alle variabili negli argomenti del comando utilizzando la sintassi ``${VAR}`` dove ``VAR`` è il nome della variabile. Se la variabile richiamata non è definita, il riferimento viene sostituito con una stringa vuota; in caso contrario viene sostituito dal valore della variabile. La sostituzione viene eseguita prima dell'espansione degli argomenti non quotati, quindi i valori delle variabili contenenti punti e virgola vengono suddivisi in zero o più argomenti al posto dell'argomento originale non quotato. Per esempio:

source: System environment variables and Windows registry values can be accessed directly in CMake. To access system environment variables, use the syntax ``$ENV{VAR}``. CMake can also reference registry entries in many commands using a syntax of the form ``[HKEY_CURRENT_USER\\Software\\path1\\path2;key]``, where the paths are built from the registry tree and key.
it: È possibile accedere direttamente alle variabili di ambiente di sistema e ai valori del registro di Windows in CMake. Per accedere alle variabili di ambiente di sistema, utilizzare la sintassi ``$ENV{VAR}``. CMake può anche fare riferimento alle voci di registro in molti comandi utilizzando una sintassi della forma ``[HKEY_CURRENT_USER\\Software\\path1\\path2;key]``, dove i percorsi sono costruiti dalla struttura e dalla chiave del registro.

source: Variable Scope
it: Scope delle Variabili

source: Variables in CMake have a scope that is a little different from most languages. When you set a variable, it is visible to the current CMakeLists file or function and any subdirectory's CMakeLists files, any functions or macros that are invoked, and any files that are included using the :command:`include` command. When a new subdirectory is processed (or a function called), a new variable scope is created and initialized with the current value of all variables in the calling scope. Any new variables created in the child scope, or changes made to existing variables, will not impact the parent scope. Consider the following example:
it: Le variabili in CMake hanno uno scope leggermente diverso da quello della maggior parte dei linguaggi. Quando si imposta una variabile, essa è visibile al file o alla funzione CMakeLists corrente e ai file CMakeLists di qualsiasi sottodirectory, a qualsiasi funzione o macro richiamata e a qualsiasi file incluso utilizzando il comando :command:`include`. Quando viene elaborata una nuova sottodirectory (o viene chiamata una funzione), viene creato e inizializzato un nuovo scope di variabile con il valore corrente di tutte le variabili nello scope chiamante. Eventuali nuove variabili create nello scope figlio o le modifiche apportate alle variabili esistenti non influiranno sullo scope padre. Si consideri l'esempio seguente:

source: In some cases, you might want a function or subdirectory to set a variable in its parent's scope. There is a way for CMake to return a value from a function, and it can be done by using the ``PARENT_SCOPE`` option with the :command:`set` command. We can modify the prior example so that the function ``foo`` changes the value of test in its parent's scope as follows:
it: A volte, si vorrebbe che una funzione o una sottodirectory imposti una variabile nello scope del suo genitore. Esiste un modo per CMake di restituire un valore da una funzione e può essere fatto utilizzando l'opzione ``PARENT_SCOPE`` col comando :command:`set`. Possiamo modificare l'esempio precedente in modo che la funzione ``foo`` cambi il valore di test nello scope del suo genitore in questo modo:

source: Variables in CMake are defined in the order of the execution of :command:`set` commands.
it: Le variabili in CMake sono definite nell'ordine di esecuzione dei comandi :command:`set`.

source: Consider the following example:
it: Si consideri l'esempio seguente:

source: To understand the scope of variables, consider this example:
it: Per comprendere lo scope delle variabili, si consideri questo esempio:

source: In this example, because the variable ``foo`` is defined at the beginning, it will be defined while processing both dir1 and dir2. In contrast, ``bar`` will only be defined when processing dir2. Likewise, ``foo`` will be defined when processing both file1.cmake and file2.cmake, whereas ``bar`` will only be defined while processing file2.cmake.
it: In questo esempio, poiché la variabile ``foo`` è definita all'inizio, verrà definita durante l'elaborazione sia di dir1 che di dir2. Al contrario, ``bar`` sarà definito solo durante l'elaborazione di dir2. Allo stesso modo, ``foo`` sarà definito durante l'elaborazione sia di file1.cmake che di file2.cmake, mentre ``bar`` sarà definito solo durante l'elaborazione di file2.cmake.

source: Commands
it: Comandi

source: A command consists of the command name, opening parenthesis, whitespace separated arguments, and a closing parenthesis. Each command is evaluated in the order that it appears in the CMakeLists file. See the :manual:`cmake-commands <cmake-commands(7)>` manual for a full list of CMake commands.
it: Un comando consiste nel nome del comando, parentesi di apertura, argomenti separati da spazi e parentesi di chiusura. Ogni comando viene valutato nell'ordine in cui appare nel file CMakeLists. Consultare il manuale :manual:`cmake-commands <cmake-commands(7)>` per l'elenco completo dei comandi CMake.

source: CMake is no longer case sensitive to command names, so where you see ``command``, you could use ``COMMAND`` or ``Command`` instead. It is considered best practice to use lowercase commands. All whitespace (spaces, line feeds, tabs) is ignored except to separate arguments. Therefore, commands may span multiple lines as long as the command name and the opening parenthesis are on the same line.
it: CMake non fa più distinzione tra maiuscole e minuscole per i nomi dei comandi, quindi dove si vede ``command``, si può usare ``COMMAND`` o ``Command``. È considerata "best practice" utilizzare i comandi in minuscolo. Tutti i "whitespace" (spazi, line feed, tabulazioni) vengono ignorati tranne che per separare gli argomenti. Pertanto, i comandi possono estendersi su più righe purché il nome del comando e la parentesi di apertura si trovino sulla stessa riga.

source: CMake command arguments are space separated and case sensitive. Command arguments may be either quoted or unquoted. A quoted argument starts and ends in a double quote (") and always represents exactly one argument. Any double quotes contained inside the value must be escaped with a backslash. Consider using bracket arguments for arguments that require escaping, see the :manual:`cmake-language <cmake-language(7)>` manual. An unquoted argument starts in any character other than a double quote (later double quotes are literal) and is automatically expanded into zero-or-more arguments by separating on semicolons within the value. For example:
it: Gli argomenti dei comandi CMake sono separati da spazi e fanno distinzione tra maiuscole e minuscole. Gli argomenti dei comandi possono essere quotati o non quotati. Un argomento quotato (tra virgolette) inizia e finisce con un doppio apice (") e rappresenta sempre esattamente un argomento. Eventuali virgolette doppie contenute all'interno del valore devono essere precedute da una barra rovesciata [backslash]. Si consideri l'utilizzo di argomenti tra parentesi per argomenti che richiedono l'escape, consultare il manuale :manual:`cmake-language <cmake-language(7)>`. Un argomento non quotato inizia con qualsiasi carattere diverso da un doppio apice (successivamente le doppie virgolette sono letterali) e viene automaticamente espanso in zero o più argomenti separando col punto e virgola all'interno del valore. Per esempio:

source: Basic Commands
it: Comandi di Base

source: As we saw earlier, the :command:`set` and :command:`unset` commands explicitly set or unset variables. The :command:`string`, :command:`list`, and :command:`separate_arguments` commands offer basic manipulation of strings and lists.
it: Come visto in precedenza, i comandi :command:`set` e :command:`unset` impostano o annullano esplicitamente le variabili. I comandi :command:`string`, :command:`list` e :command:`separate_arguments` offrono comandi di base per manipolare stringhe e liste.
