Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Sometimes a software project builds an executable that is then used for generating source files, which are used to build other executables or libraries. This may sound like an odd case, but it occurs quite frequently. One example is the build process for the TIFF library, which creates an executable that is then run to generate a source file that has system specific information in it. This file is then used as a source file in building the main TIFF library. Another example is the Visualization Toolkit (VTK), which builds an executable called ``vtkWrapTcl`` that wraps C++ classes into Tcl. The executable is built and then used to create more source files for the build process.
it: A volte un progetto software crea un eseguibile che viene poi utilizzato per generare un file sorgente, che viene utilizzato per creare altri eseguibili o librerie. Questo può sembrare un caso strano, ma si verifica abbastanza frequentemente. Un esempio è il processo di build per la libreria TIFF, che crea un eseguibile per generare un file sorgente contenente informazioni specifiche del sistema. Questo file viene poi utilizzato come file sorgente nella creazione della libreria TIFF principale. Un altro esempio è il Visualization Toolkit (VTK), che crea un eseguibile chiamato ``vtkWrapTcl`` che racchiude le classi C++ nel Tcl. L'eseguibile viene compilato e utilizzato per creare più file sorgenti per il processo di build.

source: The first part of this example produces the ``creator`` executable from the source file ``creator.cxx``. The custom command then sets up a rule for producing the source file ``created.c`` by running the executable ``creator``. The custom command depends on the ``creator`` target and writes its result into the output tree (:variable:`PROJECT_BINARY_DIR`). Finally, an executable target called ``Foo`` is added, which is built using the ``created.c`` source file. CMake will create all the required rules in the Makefile (or Visual Studio workspace) so that when you build the project, the ``creator`` executable will be built, and run to create ``created.c``, which will then be used to build the ``Foo`` executable.
it: La prima parte di questo esempio produce l'eseguibile ``creator`` dal file sorgente ``creator.cxx``. Il comando custom poi imposta una regola per produrre il file sorgente ``created.c`` eseguendo l'eseguibile ``creator``. Il comando custom dipende dal target ``creator`` e scrive il suo risultato nell'albero di output (:variable:`PROJECT_BINARY_DIR`). Infine, viene aggiunto un target eseguibile chiamato ``Foo``, creato utilizzando il file sorgente ``created.c``. CMake creerà tutte le regole richieste nel Makefile (o nel workspace di Visual Studio) in modo che quando si crea il progetto, l'eseguibile ``creator`` verrà compilato ed eseguito per creare ``created.c``, che verrà poi utilizzato per creare l'eseguibile ``Foo``.

source: Adding a Custom Target
it: Aggiungere un Comando Custom

source: In the discussion so far, CMake targets have generally referred to executables and libraries. CMake supports a more general notion of targets, called custom targets, which can be used whenever you want the notion of a target but without the end product being a library or an executable. Examples of custom targets include targets to build documentation, run tests, or update web pages. To add a custom target, use the :command:`add_custom_target` command.
it: Nella discussione finora, i target di CMake hanno generalmente fatto riferimento a eseguibili e librerie. CMake supporta una nozione più generale di target, chiamati target custom (personalizzati), utilizzabili ogni volta che si desidera la nozione di target ma senza che il prodotto finale sia una libreria o un eseguibile. Esempi di target custom includono quelli per creare documentazione, eseguire test o aggiornare pagine web. Per aggiungere un target custom, si usa il comando :command:`add_custom_target`.

source: The name specified will be the name given to the target. You can use that name to specifically build that target with Makefiles (make name) or Visual Studio (right-click on the target and then select Build). If the optional ``ALL`` argument is specified, this target will be included in the ``ALL_BUILD`` target and will automatically be built whenever the Makefile or Project is built. The command and arguments are optional; if specified, they will be added to the target as a post-build command. For custom targets that will only execute a command this is all you will need. More complex custom targets may depend on other files, in these cases the ``DEPENDS`` arguments are used to list which files this target depends on. We will consider examples of both cases. First, let us look at a custom target that has no dependencies:
it: Il nome specificato sarà il nome assegnato al target. È possibile utilizzare quel nome per creare in modo specifico tale target con Makefiles (make nome) o Visual Studio (click destro sul target e quindi selezionare Build). Se viene specificato l'argomento facoltativo ``ALL``, il target verrà incluso nel target ``ALL_BUILD`` e verrà compilato automaticamente ogni volta che viene eseguita la build di Makefile o di Project. Il comando e gli argomenti sono facoltativi; se specificati, verranno aggiunti al target come comando di post-build. Per i target custom che eseguiranno solo un comando, questo è tutto ciò di cui c'è bisogno. Target custom più complessi possono dipendere da altri file, in questi casi vengono utilizzati gli argomenti ``DEPENDS`` per elencare da quali file dipende questo target. Prenderemo in considerazione esempi di entrambi i casi. Per prima cosa, esaminiamo un target custom che non ha dipendenze:

source: With the above definition, whenever the ``FooJAR`` target is built, it will run Java's Archiver (jar) to create the ``Foo.jar`` file from java classes in the ``${PROJECT_SOURCE_DIR}/Java`` directory. In essence, this type of custom target allows the developer to tie a command to a target so that it can be conveniently invoked during the build process. Now let us consider a more complex example that roughly models the generation of PDF files from LaTeX. In this case, the custom target depends on other generated files (mainly the end product .pdf files)
it: Con la definizione di cui sopra, ogni volta che il target ``FooJAR`` viene compilato, eseguirà l'Archiver di Java (jar) per creare il file ``Foo.jar`` dalle classi java nella directory ``${PROJECT_SOURCE_DIR}/Java``. In sostanza, questo tipo di target custom consente allo sviluppatore di associare un comando a un target in modo che possa essere comodamente richiamato durante il processo di build. Consideriamo ora un esempio più complesso che modella approssimativamente la generazione di file PDF da LaTeX. In questo caso, il target custom dipende da altri file generati (principalmente i file .pdf del prodotto finale)

source: This example makes use of both :command:`add_custom_command` and :command:`add_custom_target`. The two :command:`add_custom_command` invocations are used to specify the rules for producing a .pdf file from a .tex file. In this case, there are two steps and two custom commands. First a .dvi file is produced from the .tex file by running LaTeX, then the .dvi file is processed to produce the desired .pdf file. Finally, a custom target is added called TDocument. Its command simply echoes out what it is doing, while the real work is done by the two custom commands. The ``DEPENDS`` argument sets up a dependency between the custom target and the custom commands. When TDocument is built, it will first look to see if all of its dependencies are built. If any are not built, it will invoke the appropriate custom commands to build them. This example can be shortened by combining the two custom commands into one custom command, as shown in the following example:
it: Questo esempio utilizza sia :command:`add_custom_command` che :command:`add_custom_target`. Le due invocazioni :command:`add_custom_command` vengono utilizzate per specificare le regole per la produzione di un file .pdf da un file .tex. In questo caso, ci sono due passaggi e due comandi personalizzati [custom]. Prima viene prodotto un file .dvi dal file .tex eseguendo LaTeX, quindi il file .dvi viene processato per produrre il file .pdf desiderato. Infine, viene aggiunto un target personalizzato chiamato TDocument. Il suo comando fa semplicemente una "echo" di ciò che sta facendo, mentre il vero lavoro viene svolto dai due comandi custom. L'argomento ``DEPENDS`` imposta una dipendenza tra il target custom e i comandi custom. Quando TDocument viene compilato, cercherà prima di vedere se tutte le sue dipendenze sono state compilate. Se qualcuna non viene compilata, richiamerà i comandi personalizzati appropriati per crearli. Questo esempio può essere abbreviato combinando i due comandi in un unico comando custom, come mostrato nell'esempio seguente:

source: Now consider a case where the documentation consists of multiple files. The above example can be modified to handle many files by using a list of inputs and a :command:`foreach` loop. For example
it: Si consideri ora un caso in cui la documentazione sia costituita da più file. L'esempio precedente può essere modificato per gestire molti file utilizzando un elenco di input e un ciclo :command:`foreach`. Per esempio

source: In this example, building the custom target ``TDocument`` will cause all of the specified .pdf files to be generated. Adding a new document to the list is simply a matter of adding its filename to the ``DOCS`` variable at the top of the example.
it: In questo esempio, la build del target custom ``TDocument`` provocherà la generazione di tutti i file .pdf specificati. Aggiungere un nuovo documento all'elenco è consiste semplicemente nell'aggiungere il suo nome alla variabile ``DOCS`` all'inizio dell'esempio.

source: Specifying Dependencies and Outputs
it: Specifica delle Dipendenze e degli Output

source: When using custom commands and custom targets you will often be specifying dependencies. When you specify a dependency or the output of a custom command, you should always specify the full path. For example, if the command produces ``foo.h`` in the binary tree then its output should be something like ``${PROJECT_BINARY_DIR}/foo.h``. CMake will try to determine the correct path for the file if it is not specified; complex projects frequently end up using files in both the source and build trees, this can eventually lead to errors if the full paths are not specified.
it: Quando si utilizzano comandi e obiettivi custom, spesso si specificano le dipendenze. Quando si specifica una dipendenza o l'output di un comando custom, si dovrebbe sempre specificare il path completo. Ad esempio, se il comando produce ``foo.h`` nell'albero binario, il suo output dovrebbe essere qualcosa come ``${PROJECT_BINARY_DIR}/foo.h``. CMake proverà a determinare il path corretto per il file se non è specificato; progetti complessi spesso finiscono per utilizzare file sia nell'albero dei sorgenti che in quello di compilazione, questo può eventualmente portare a errori se non vengono specificati i percorsi completi.

source: When specifying a target as a dependency, you can leave off the full path and executable extension, referencing it simply by its name. Consider the specification of the generator target as an :command:`add_custom_command` dependency in the example earlier in this chapter. CMake recognizes ``creator`` as matching an existing target and properly handles the dependencies.
it: Quando si specifica un target come dipendenza, è possibile tralasciare il path completo e l'estensione eseguibile, facendovi riferimento semplicemente col suo nome. Si consideri la specifica dei target del generatore come una dipendenza di :command:`add_custom_command` nell'esempio precedente in questo capitolo. CMake riconosce ``creator`` come corrispondente a un target esistente e gestisce correttamente le dipendenze.

source: When There Isn't One Rule For One Output
it: Quando Non c'è una Regola Per Un Output

source: There are a couple of unusual cases that can arise when using custom commands that warrant further explanation. The first is a case where one command (or executable) can create multiple outputs, and the second is when multiple commands can be used to create a single output.
it: Ci sono un paio di casi insoliti che possono sorgere quando si utilizzano comandi custom che richiedono ulteriori spiegazioni. Il primo è un caso in cui un comando (o eseguibile) può creare più output e il secondo è quando è possibile utilizzare più comandi per creare un singolo output.

source: A Single Command Producing Multiple Outputs
it: Un Singolo Comando che Produce più Output

source: In CMake, a custom command can produce multiple outputs simply by listing multiple outputs after the ``OUTPUT`` keyword. CMake will create the correct rules for your build system so that no matter which output is required for a target, the right rules will be run. If the executable happens to produce a few outputs but the build process is only using one of them, then you can simply ignore the other outputs when creating your custom command. Say that the executable produces a source file that is used in the build process, and also an execution log that is not used. The custom command should specify the source file as the output and ignore the fact that a log file is also generated.
it: In CMake, un comando custom può produrre più output semplicemente elencando più output dopo la parola chiave ``OUTPUT``. CMake creerà le regole corrette per il sistema di build in modo che, indipendentemente dall'output richiesto per un target, verranno eseguite le regole giuste. Se l'eseguibile produce alcuni output ma il processo di build ne utilizza solo uno, si possono semplicemente ignorare gli altri output durante la creazione del comando custom. Supponiamo che l'eseguibile produca un file sorgente utilizzato nel processo di build e anche un log di esecuzione che non viene utilizzato. Il comando custom deve specificare il file sorgente come output e ignorare il fatto che viene generato anche un file di log.

source: Another case of having one command with multiple outputs is when the command is the same but the arguments to it change. This is effectively the same as having a different command, and each case should have its own custom command. An example of this was the documentation example, where a custom command was added for each .tex file. The command is the same but the arguments passed to it change each time.
it: Un altro caso in cui si ha un comando con più output è quando il comando è lo stesso ma gli argomenti cambiano. Questo è effettivamente come avere un comando diverso e ogni caso dovrebbe avere il proprio comando custom. Un esempio di ciò è stato l'esempio della documentazione, in cui è stato aggiunto un comando personalizzato per ogni file .tex. Il comando è lo stesso ma gli argomenti passati cambiano ogni volta.

source: Having One Output That Can Be Generated By Different Commands
it: Avere un Output che può Essere Generato da Diversi Comandi

source: In rare cases, you may find that you have more than one command that you can use to generate an output. Most build systems, such as make and Visual Studio, do not support this and likewise CMake does not. There are two common approaches that can be used to resolve this. If you truly have two different commands that produce the same output and no other significant outputs, then you can simply pick one of them and create a custom command for it.
it: In rari casi, si potrebbero avere più di un comando che utilizzabile per generare un output. La maggior parte dei sistemi di build, come make e Visual Studio, non lo supporta e allo stesso modo nemmeno CMake. Esistono due approcci comuni che possono essere utilizzati per risolvere questo problema. Se si hanno veramente due comandi diversi che producono lo stesso output e nessun altro output significativo, si può semplicemente sceglierne uno e crearne un comando custom.

source: In more complex cases there are multiple commands with multiple outputs; for example:
it: Nei casi più complessi ci sono più comandi con più output; Per esempio:

source: There are a few approaches that can be used in this case. You might consider combining both commands and all three outputs into a single custom command, so that whenever one output is required, all three are built at the same time. You could also create three custom commands, one for each unique output. The custom command for ``foo.h`` would invoke Command1, while the one for ``widget.h`` would invoke Command2. When specifying the custom command for ``bar.h``, you could choose either Command1 or Command2.
it: Ci sono alcuni approcci che possono essere utilizzati in questo caso. Si potrebbe considerare di combinare entrambi i comandi e tutti e tre gli output in un singolo comando custom, in modo che ogni volta che è richiesto un output, tutti e tre vengano compilati contemporaneamente. Si possono anche creare tre comandi custom, uno per ogni output univoco. Il comando custom per ``foo.h`` invocherebbe Command1, mentre quello per ``widget.h`` invocherebbe Command2. Quando si specifica il comando custom per ``bar.h``, si può scegliere Command1 o Command2.

source: Finding Packages
it: Ricerca dei Pacchetti

source: Many software projects provide tools and libraries that are meant as building blocks for other projects and applications. CMake projects that depend on outside packages locate their dependencies using the :command:`find_package` command. A typical invocation is of the form:
it: Molti progetti software forniscono strumenti e librerie intesi come elementi costitutivi per altri progetti e applicazioni. I progetti CMake che dipendono da pacchetti esterni individuano le loro dipendenze utilizzando il comando :command:`find_package`. Una tipica invocazione è della forma:

source: where ``<Package>`` is the name of the package to be found, and ``[version]`` is an optional version request (of the form ``major[.minor.[patch]]``). The command's notion of a package is distinct from that of CPack, which is meant for creating source and binary distributions and installers.
it: dove ``<Package>`` è il nome del pacchetto da trovare e ``[version]`` è una richiesta di versione facoltativa (nella forma ``major[.minor.[patch]]``). La nozione del comando 'package' è distinta da quella di CPack, che ha lo scopo di creare distribuzioni e programmi di installazione di sorgenti e binari.

source: The command operates in two modes: ``Module`` mode and ``Config`` mode. In Module mode, the command searches for a :manual:`find module <cmake-developer(7)>`: a file named ``Find<Package>.cmake``. It looks first in the :variable:`CMAKE_MODULE_PATH` and then in the CMake installation. If a find module is found, it is loaded to search for individual components of the package. Find modules contain package-specific knowledge of the libraries and other files they expect to find, and internally use commands like :command:`find_library` to locate them. CMake provides find modules for many common packages; see the :manual:`cmake-modules(7)` manual.
it: Il comando opera in due modalità: modalità ``Module`` e modalità ``Config``. In modalità Module, il comando cerca un :manual:`find module <cmake-developer(7)>`: un file chiamato ``Find<Package>.cmake``. Cerca prima in :variable:`CMAKE_MODULE_PATH` e poi nell'installazione di CMake. Se viene trovato un modulo 'find', viene caricato per cercare i singoli componenti del pacchetto. I moduli Find contengono una conoscenza specifica del pacchetto delle librerie e di altri file che si aspettano di trovare e usano internamente comandi come :command:`find_library` per individuarli. CMake fornisce moduli di ricerca per molti pacchetti comuni; vedere il manuale :manual:`cmake-modules(7)`.

source: The Config mode of :command:`find_package` provides a powerful alternative through cooperation with the package to be found. It enters this mode after failing to locate a find module or when explicitly requested by the caller. In Config mode the command searches for a ``package configuration file``: a file named ``<Package>Config.cmake`` or ``<package>-config.cmake`` which is provided by the package to be found. Given the name of a package, the :command:`find_package` command knows how to search deep inside installation prefixes for locations like::
it: La modalità Config di :command:`find_package` fornisce una potente alternativa attraverso la cooperazione col pacchetto da trovare. Entra in questa modalità dopo aver fallito nell'individuare un modulo 'find' o quando esplicitamente richiesto dal chiamante. In modalità Config il comando cerca un ``file di configurazione del pacchetto``: un file chiamato ``<Package>Config.cmake`` o ``<package>-config.cmake`` fornito dal pacchetto da trovare. Dato il nome di un pacchetto, il comando :command:`find_package` sa come cercare approfonditamente all'interno dei prefissi di installazione per locazioni come::

source: (see documentation of the :command:`find_package` command for a complete list of locations). CMake creates a cache entry called ``<Package>_DIR`` to store the location found or allow the user to set it. Since a package configuration file comes with an installation of its package, it knows exactly where to find everything provided by the installation. Once the :command:`find_package` command locates the file it provides the locations of package components without any additional searching.
it: (consultare la documentazione del comando :command:`find_package` per un elenco completo delle locazioni). CMake crea una voce della cache chiamata ``<Package>_DIR`` per memorizzare la posizione trovata o consentire all'utente di impostarla. Dat che un file di configurazione del pacchetto viene fornito con una sua installazione, sa esattamente dove trovare tutto ciò che viene fornito. Una volta che il comando :command:`find_package` ha individuato il file, fornisce le posizioni dei componenti del pacchetto senza ulteriori ricerche.

source: The ``[version]`` option asks :command:`find_package` to locate a particular version of the package. In Module mode, the command passes the request on to the find module. In Config mode the command looks next to each candidate package configuration file for a ``package version file``: a file named ``<Package>ConfigVersion.cmake`` or ``<package>-config-<version>.cmake``. The version file is loaded to test whether the package version is an acceptable match for the version requested (see documentation of :command:`find_package` for the version file API specification). If the version file claims compatibility, the configuration file is accepted, or is otherwise ignored. This approach allows each project to define its own rules for version compatibility.
it: L'opzione ``[version]`` chiede a :command:`find_package` di individuare una particolare versione del pacchetto. In modalità Modulo, il comando passa la richiesta al modulo find. In modalità Config il comando cerca accanto a ciascun file di configurazione del pacchetto candidato un ``file di versione del pacchetto``: un file denominato ``<Package>ConfigVersion.cmake`` o ``<package>-config-<version>.cmake``. Il file della versione viene caricato per verificare se la versione del pacchetto è una corrispondenza accettabile per quella richiesta (vedere la documentazione di :command:`find_package` per la specifica dell'API del file della versione). Se il file della versione dichiara la compatibilità, il file di configurazione viene accettato, altrimenti ignorato. Questo approccio consente a ciascun progetto di definire le proprie regole per la compatibilità delle versioni.

source: Built-in Find Modules
it: Moduli Find Nativi
