Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: All policies in CMake are assigned a name in the form CMPNNNN where NNNN is an integer value. Policies typically support both an old behavior that preserves compatibility with earlier versions of CMake, and a new behavior that is considered correct and preferred for use by new projects. Every policy has documentation detailing the motivation for the change, and the old and new behaviors.
it: A tutte le policy in CMake viene assegnato un nome nel formato CMPNNNN dove NNNN è un valore intero. Le policy in genere supportano sia un vecchio comportamento che mantiene la compatibilità con le versioni precedenti di CMake, sia un nuovo comportamento considerato corretto e preferito per l'uso da parte di nuovi progetti. Ogni policy ha una documentazione che dettaglia la motivazione delle modifiche e i comportamenti vecchi e nuovi.

source: Setting Policies
it: Impostazione delle Policy

source: Projects may configure the setting of each policy to request old or new behaviors. When CMake encounters user code that may be affected by a particular policy, it checks to see whether the project has set the policy. If the policy has been set (to ``OLD`` or ``NEW``) then CMake follows the behavior specified. If the policy has not been set then the old behavior is used, but a warning is issued telling the project author to set the policy.
it: I progetti possono configurare l'impostazione di ciascuna policy per richiedere comportamenti vecchi o nuovi. Quando CMake rileva il codice utente che potrebbe essere interessato da una particolare policy, verifica se il progetto l'ha impostata. Se la policy è stata impostata (su ``OLD`` o ``NEW``), CMake segue il comportamento specificato. Se la policy non è stata impostata, viene utilizzato il vecchio comportamento, ma viene emesso un warning che indica all'autore del progetto di impostare il la policy.

source: There are a couple ways to set the behavior of a policy. The quickest way is to set all policies to a version that corresponds to the release version of CMake the project was written in. Setting the policy version requests the new behavior for all policies introduced in the corresponding version of CMake or earlier. Policies introduced in later versions are marked as "not set" in order to produce proper warning messages. The policy version is set using the :command:`cmake_policy` command's ``VERSION`` signature. For example, the code
it: Ci sono un paio di modi per impostare il comportamento di una policy. Il modo più rapido consiste nell'impostare tutte le policy su una versione che corrisponda a quella di rilascio di CMake in cui è stato scritto il progetto. L'impostazione della versione della policy richiede il nuovo comportamento per tutte le policy introdotte nella versione corrispondente di CMake o precedente. Le policy introdotte nelle versioni successive sono contrassegnati come "not set" per produrre messaggi appropriati. versione della policy viene impostata utilizzando del comando :command:`cmake_policy` la firma ``VERSION``. Ad esempio, il codice

source: will request the new behavior for all policies introduced in CMake 3.20 or earlier.
it: richiederà il nuovo comportamento per tutte le policy introdotte in CMake 3.20 o nelle versioni precedenti.

source: The :command:`cmake_minimum_required` command will require a minimum version of CMake and will call :command:`cmake_policy`. A project should always begin with the lines
it: Il comando :command:`cmake_minimum_required` richiederà una versione minima di CMake e chiamerà :command:`cmake_policy`. Un progetto dovrebbe sempre iniziare con le righe

source: This indicates that the person running CMake must have at least version 3.20. If they are running an older version of CMake, an error message will be displayed telling them that the project requires at least the specified version of CMake.
it: Questo indica che la persona che esegue CMake deve avere almeno la versione 3.20. Se si sta eseguendo una versione precedente di CMake, verrà visualizzato un messaggio di errore che informa che il progetto richiede almeno la versione specificata di CMake.

source: Of course, one should replace "3.20" with the version of CMake you are currently writing to. You can also set each policy individually if you wish; this is sometimes helpful for project authors who want to incrementally convert their projects to use a new behavior, or silence warnings about dependence on an old behavior. The :command:`cmake_policy` command's ``SET`` option may be used to explicitly request old or new behavior for a particular policy.
it: Ovviamente, si dovrebbe sostituire "3.20" con la versione di CMake in cui si sta attualmente scrivendo. Si può anche impostare ciascuna policy individualmente; questo a volte è utile per gli autori di progetti che desiderano convertire in modo incrementale i propri progetti per utilizzare un nuovo comportamento o silenziare i warning sulla dipendenza da un vecchio comportamento. Nel comando :command:`cmake_policy` si può usare l'opzione ``SET`` per richiedere esplicitamente un comportamento vecchio o nuovo per una particolare policy.

source: For example, CMake 2.6 introduced the policy :policy:`CMP0002`, which requires all logical target names to be globally unique (duplicate target names previously worked by accident in some cases, but were not diagnosed). Projects using duplicate target names and working accidentally will receive warnings referencing the policy. The warnings may be silenced with the code
it: Ad esempio, CMake 2.6 ha introdotto la policy :policy:`CMP0002`, che richiede che tutti i nomi di target logici siano univoci a livello globale (i nomi di target duplicati in precedenza funzionavano a volte per caso, ma non venivano diagnosticati). I progetti che utilizzano nomi di target duplicati e che funzionano accidentalmente riceveranno degli avvisi che fanno riferimento alla policy. I warning possono essere silenziati con il codice

source: which explicitly tells CMake to use the old behavior for the policy (silently accepting duplicate target names). Another option is to use the code
it: che dice esplicitamente a CMake di utilizzare il vecchio comportamento per la policy (accettando tacitamente nomi di duplicati dei target). Un'altra opzione è quella di usare il codice

source: to explicitly tell CMake to use new behavior and produce an error when a duplicate target is created. Once this is added to the project, it will not build until the author removes any duplicate target names.
it: per dire esplicitamente a CMake di utilizzare un nuovo comportamento e produrre un errore quando viene creato un target duplicato. Una volta aggiunto al progetto, non verrà compilato fino a quando l'autore non rimuove eventuali nomi duplicati di target.

source: When a new version of CMake is released, it introduces new policies that can still build old projects, because by default they do not request ``NEW`` behavior for any of the new policies. When starting a new project, one should always specify the most recent release of CMake to be supported with the :command:`cmake_minimum_required` command. This will ensure that the project is written to work using policies from that version of CMake and not using any old behavior. If no policy version is set, CMake will warn and assume a policy version of 2.4. This allows existing projects that do not specify :command:`cmake_minimum_required` to build as they would have with CMake 2.4.
it: Quando viene rilasciata una nuova versione di CMake, vengono introdotte nuove policy che possono ancora creare vecchi progetti, perché per default non richiedono il comportamento ``NEW`` per nessuna delle nuove policy. Quando si avvia un nuovo progetto, si dovrebbe sempre specificare la versione più recente di CMake da supportare col comando :command:`cmake_minimum_required`. Ciò assicurerà che il progetto sia scritto per funzionare utilizzando le policy di quella versione di CMake e non utilizzando alcun comportamento precedente. Se non è impostata alcuna versione della policy, CMake avviserà e assumerà una versione della policy 2.4. Ciò consente ai progetti esistenti che non specificano :command:`cmake_minimum_required` di essere compilati come avrebbero fatto con CMake 2.4.

source: The Policy Stack
it: Lo Stack della Policy

source: Policy settings are scoped using a stack. A new level of the stack is pushed when entering a new subdirectory of the project (with :command:`add_subdirectory`) and popped when leaving it. Therefore, setting a policy in one directory of a project will not affect parent or sibling directories, but it will affect subdirectories.
it: Le impostazioni della policy vengono definite utilizzando uno stack. Un nuovo livello dello stack viene spinto [pop] quando si entra in una nuova sottodirectory del progetto (con :command:`add_subdirectory`) e ripreso [pop] quando si esce da esso. Pertanto, l'impostazione di una policy in una directory di un progetto non influirà sulle directory padre o di pari livello, ma influirà sulle sottodirectory.

source: This is useful when a project contains subprojects that are maintained separately yet built inside the tree. The top-level CMakeLists file in a project may write
it: Ciò è utile quando un progetto contiene sottoprogetti che vengono mantenuti separatamente ma creati all'interno dell'albero. Il file CMakeLists di primo livello in un progetto può essere

source: while the ``OtherProject/CMakeLists.txt`` file contains
it: mentre il file ``OtherProject/CMakeLists.txt`` contiene

source: This allows a project to be updated to CMake 2.6 while subprojects, modules, and included files continue to build with CMake 2.4 until their maintainers update them.
it: Ciò consente di aggiornare un progetto a CMake 2.6 mentre i sottoprogetti, i moduli e i file inclusi continuano a essere compilati con CMake 2.4 fino a quando i manutentori non li aggiornano.

source: User code may use the :command:`cmake_policy` command to push and pop its own stack levels as long as every push is paired with a pop. This is useful when temporarily requesting different behavior for a small section of code. For example, policy :policy:`CMP0003` removes extra link directories that used to be included when new behavior is used. When incrementally updating a project, it may be difficult to build a particular target with the remaining targets being OK. The code
it: Il codice utente può utilizzare il comando :command:`cmake_policy` per eseguire il push e il pop dei propri livelli di stack purché ogni push sia associato a un pop. Questo è utile quando si richiede temporaneamente un comportamento diverso per una piccola sezione di codice. Ad esempio, policy :policy:`CMP0003` rimuove i link alle directory extra che venivano incluse quando veniva utilizzato un nuovo comportamento. Quando si aggiorna in modo incrementale un progetto, potrebbe essere difficile creare un target particolare con i target rimanenti OK. Il codice

source: will silence the warning and use the old behavior for that target. You can get a list of policies and help on specific policies by running CMake from the command line as follows
it: silenzierà il warning e utilizzerà il vecchio comportamento per quel target. È possibile ottenere un elenco di policy e l'help su policy specifiche eseguendo CMake dalla riga di comando in questo modo

source: Updating a Project For a New Version of CMake
it: Aggiornamento di un Progetto per una Nuova Versione di CMake

source: When a CMake release introduces new policies, it may generate warnings for some existing projects. These warnings indicate that changes to a project may be necessary for dealing with the new policies. While old releases of a project can continue to build with the warnings, the project development tree should be updated to take the new policies into account. There are two approaches to updating a tree: one-shot and incremental. The question of which one is easier depends on the size of the project and which new policies produce warnings.
it: Quando una versione di CMake introduce nuove policy, potrebbe generare dei warning per alcuni progetti esistenti. Tali warning indicano che potrebbero essere necessarie modifiche a un progetto per gestire le nuove policy. Sebbene le vecchie versioni di un progetto possano continuare a essere compilate con i warning, l'albero di sviluppo del progetto dovrebbe essere aggiornato per tenere conto delle nuove policy. Esistono due approcci per l'aggiornamento di un albero: one-shot e incrementale. La questione di quale sia più facile dipende dalle dimensioni del progetto e da quali nuove policy producono warning.

source: The One-Shot Approach
it: L'Approccio One-Shot

source: The simplest approach to updating a project for a new version of CMake is simply to change the policy version which is set at the top of the project. Then, try building with the new CMake version to fix problems. For example, to update a project to build with CMake 3.20, one might write
it: L'approccio più semplice all'aggiornamento di un progetto per una nuova versione di CMake consiste semplicemente nel modificare la versione della policy impostata all'inizio del progetto. Poi, si prova a compilare con la nuova versione di CMake per risolvere i problemi. Ad esempio, per aggiornare un progetto da compilare con CMake 3.20, si potrebbe scrivere

source: at the beginning of the top-level CMakeLists file. This tells CMake to use the new behavior for every policy introduced in CMake 3.20 and below. When building this project with CMake 3.20, no warnings will be produced regarding policies because it knows that no policies were introduced in later versions. However, if the project was depending on the old policy behavior, it may not build since CMake is now using the new behavior without warning. It is up to the project author who added the policy version line to fix these issues.
it: all'inizio del file CMakeLists di primo livello. Ciò indica a CMake di utilizzare il nuovo comportamento per ogni policy introdotta in CMake 3.20 e versioni precedenti. Durante la build di questo progetto con CMake 3.20, non verranno prodotti warning relativi alle policy perché sa che non sono stati introdotte policy nelle versioni successive. Tuttavia, se il progetto dipendeva dal vecchio comportamento della policy, potrebbe non essere compilato poiché CMake ora utilizza il nuovo comportamento senza warning. Spetta all'autore del progetto che ha aggiunto la riga della versione della policy risolvere questi problemi.

source: The Incremental Approach
it: L'Approccio Incrementale

source: Another approach to updating a project for a new version of CMake is to deal with each warning one-by-one. One advantage of this approach is that the project will continue to build throughout the process, so the changes can be made incrementally.
it: Un altro approccio all'aggiornamento di un progetto per una nuova versione di CMake consiste nel gestire ogni warning uno per uno. Un vantaggio di questo approccio è che il progetto continuerà a compilarsi durante tutto il processo, quindi le modifiche possono essere apportate in modo incrementale.

source: When CMake encounters a situation where it needs to know whether to use the old or new behavior for a policy, it checks whether the project has set the policy. If the policy is set, CMake silently uses the corresponding behavior. If the policy is not set, CMake uses the old behavior but warns the author that the policy is not set.
it: Quando CMake incontra una situazione in cui deve sapere se utilizzare il vecchio o il nuovo comportamento per una policy, controlla se il progetto ha impostato la policy. Se la policy è impostata, CMake usa tacitamente il comportamento corrispondente. Se la policy non è impostata, CMake utilizza il vecchio comportamento ma avverte l'autore che la policy non è impostata.

source: In many cases, a warning message will point to the exact line of code in the CMakeLists files that caused the warning. In some cases, the situation cannot be diagnosed until CMake is generating the native build system rules for the project, so the warning will not include explicit context information. In these cases, CMake will try to provide some information about where code may need to be changed. The documentation for these "generation-time" policies should indicate the point in the project code where the policy should be set to take effect.
it: In molti casi, un warning indicherà l'esatta riga di codice nei file CMakeLists che l'ha causato. In alcuni casi, la situazione non può essere diagnosticata fino a quando CMake non genera le regole del sistema di build nativo per il progetto, pertanto il warning non includerà informazioni esplicite del contesto. In questi casi, CMake proverà a fornire alcune informazioni su dove potrebbe essere necessario modificare il codice. La documentazione per queste policy della "generation-time" dovrebbe indicare il punto nel codice del progetto in cui la policy dovrebbe essere impostata per avere effetto.

source: In order to incrementally update a project, one warning should be addressed at a time. Several cases may occur, as described below.
it: Per aggiornare in modo incrementale un progetto, è necessario affrontare un warning alla volta. Possono verificarsi diversi casi, come descritto di seguito.

source: Silence a Warning When the Code is Correct
it: Tacitare un Warning Quando il Codice è Corretto

source: Many policy warnings may be produced simply because the project has not set the policy even though the project may work correctly with the new behavior (there is no way for CMake to know the difference). For a warning about some policy, ``CMP<NNNN>``, you can check whether this is the case by adding
it: Molti warning di policy possono essere prodotti semplicemente perché il progetto non ha impostato la policy anche se il progetto potrebbe funzionare correttamente con il nuovo comportamento (non c'è modo per CMake di conoscere la differenza). Per un warning su alcuni criteri, ``CMP<NNNN>``, si può controllare se questo è il caso aggiungendo

source: to the top of the project and trying to build it. If the project builds correctly with the new behavior, move on to the next policy warning. If the project does not build correctly, one of the other cases may apply.
it: all'inizio del progetto e cercando di compilarlo. Se il progetto viene compilato correttamente con il nuovo comportamento, si passa al warning della policy successivo. Se il progetto non viene compilato correttamente, potrebbe applicarsi uno degli altri casi.

source: Silence a Warning Without Updating the Code
it: Tacitare un Warning Senza Aggiornare il Codice

source: Users can suppress all instances of a warning ``CMP<NNNN>`` by adding
it: Gli utenti possono sopprimere tutte le istanze di un warning ``CMP<NNNN>`` aggiungendo

source: to the top of a project. However, we encourage project authors to update their code to work with the new behavior for all policies. This is especially important because versions of CMake in the (distant) future may remove support for old behaviors and produce an error for projects requesting them (which tells the user to get an older versions of CMake to build the project).
it: all'inizio del progetto. Tuttavia, incoraggiamo gli autori del progetto ad aggiornare il codice in modo che funzioni con il nuovo comportamento per tutte le policy. Ciò è particolarmente importante perché le versioni di CMake nel (lontano) futuro potrebbero rimuovere il supporto per i vecchi comportamenti e produrre un errore per i progetti che li richiedono (che indica all'utente di ottenere una versione precedente di CMake per creare il progetto).

source: Silence a Warning by Updating Code
it: Tacitare i Warning Aggiornando il Codice

source: When a project does not work correctly with the NEW behaviors for a policy, the code needs to be updated. In order to deal with a warning for some policy ``CMP<NNNN>``,add
it: Quando un progetto non funziona correttamente con i NUOVI comportamenti per una policy, il codice deve essere aggiornato. Per gestire un warning per alcuni criteri ``CMP<NNNN>``, si aggiunge

source: to the top of the project and then fix the code to work with the NEW behavior.
it: all'inizio del progetto e poi si corregge il codice in modo che funzioni con il NUOVO comportamento.

source: If many instances of the warning occur fixing all of them simultaneously may be too difficult: instead, a developer may fix them one at a time by using the PUSH/POP signatures of the :command:`cmake_policy` command::
it: Se si verificano molte istanze del warning, correggerle tutte contemporaneamente potrebbe essere troppo difficile: invece, uno sviluppatore può correggerle una alla volta utilizzando le firme PUSH/POP del comando :command:`cmake_policy`::

source: This will request the new behavior for a small region of code that has been fixed. Other instances of the policy warning may still appear and must be fixed separately.
it: Ciò richiederà il nuovo comportamento per una piccola area di codice che sia stata corretta. Altre istanze del warning sulle policy potrebbero ancora essere visualizzate e devono essere risolte separatamente.

source: Updating the Project Policy Version
it: Aggiornamento della Versione della Policy del Progetto

source: After addressing all policy warnings and getting the project to build cleanly with the new CMake version one step remains. The policy version set at the top of the project should now be updated to match the new CMake version, just as in the one-shot approach described above. For example, after updating a project to build cleanly with CMake 3.20, users may update the top of the project with the line
it: Dopo aver risolto tutti i warning relativi alle policy e ottenuto che il progetto venga compilato in modo pulito con la nuova versione di CMake, rimane un passaggio. La versione della policy impostata all'inizio del progetto dovrebbe ora essere aggiornata in modo che corrisponda alla nuova versione di CMake, proprio come nell'approccio one-shot precedente. Ad esempio, dopo aver aggiornato un progetto per creare in modo pulito con CMake 3.20, gli utenti possono aggiornare la parte iniziale del progetto con la riga

source: This will set all policies introduced in CMake 3.20 or below to use the new behavior. Then users may sweep through the rest of the code and remove the calls that use the :command:`cmake_policy` command to request the new behavior incrementally. The end result should look the same as the one-shot approach, but could be attained step-by-step.
it: Questo imposterà tutti i criteri introdotti in CMake 3.20 o versioni precedenti per utilizzare il nuovo comportamento. Gli utenti, poi, possono esaminare il resto del codice e rimuovere le chiamate che utilizzano il comando :command:`cmake_policy` per richiedere il nuovo comportamento in modo incrementale. Il risultato finale dovrebbe essere lo stesso dell'approccio one-shot, ma potrebbe essere raggiunto passo dopo passo.

source: Supporting Multiple CMake Versions
it: Supporto di Versioni Multiple di CMake

source: Some projects might want to support a few releases of CMake simultaneously. The goal is to build with an older version, while also working with newer versions without warnings. In order to support both CMake 2.4 and 2.6, one may write code like
it: Alcuni progetti potrebbero voler supportare contemporaneamente alcune versioni di CMake. L'obiettivo è compilare con una versione precedente, lavorando anche con versioni più recenti senza warning. Per supportare sia CMake 2.4 che 2.6, è possibile scrivere codice come
