Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: The :command:`add_executable` and :command:`add_library` commands are the main commands for defining the executables and libraries to build, and which source files comprise them. For Visual Studio projects, the source files will show up in the IDE as usual, but any header files the project uses will not be. To have the header files show up, simply add them to the list of source files for the executable or library; this can be done for all generators. Any generators that do not use the header files directly (such as Makefile based generators) will simply ignore them.
it: I comandi :command:`add_executable` e :command:`add_library` sono i comandi principali per definire gli eseguibili e le librerie da compilare e quali file sorgenti li comprendono. Per i progetti di Visual Studio, i file sorgenti verranno visualizzati nell'IDE come di consueto, ma i file header utilizzati dal progetto non lo saranno. Per visualizzare i file header, si aggiungerli all'elenco dei file sorgenti per l'eseguibile o la libreria; questo può essere fatto per tutti i generatori. Tutti i generatori che non usano direttamente i file header (come quelli basati su Makefile) semplicemente li ignoreranno.

source: Flow Control
it: Controllo del Flusso

source: The CMake language provides three flow control constructs to help organize your CMakeLists files and keep them maintainable.
it: Il linguaggio CMake fornisce tre costrutti per il controllo del flusso per aiutare a organizzare i file CMakeLists e mantenerli gestibili.

source: Conditional statements (e.g. :command:`if`)
it: Le istruzioni condizionali (ad es. :command:`if`)

source: Looping constructs (e.g. :command:`foreach` and :command:`while`)
it: Costrutti per i cicli (ad es. :command:`foreach` e :command:`while`)

source: Procedure definitions (e.g. :command:`macro` and :command:`function`)
it: Definizioni di procedure (ad es. :command:`macro` e :command:`function`)

source: Conditional Statements
it: Istruzioni Condizionali

source: First we will consider the :command:`if` command. In many ways, the :command:`if` command in CMake is just like the :command:`if` command in any other language. It evaluates its expression and uses it to execute the code in its body or optionally the code in the :command:`else` clause. For example:
it: Per prima cosa considereremo il comando :command:`if`. In molti modi, il comando :command:`if` in CMake è proprio come il comando :command:`if` in qualsiasi altro linguaggio. Valuta la sua espressione e la usa per eseguire il codice nel suo corpo o facoltativamente il codice nella clausola :command:`else`. Per esempio:

source: CMake also supports :command:`elseif` to help sequentially test for multiple conditions. For example:
it: CMake supporta anche :command:`elseif` per aiutare a testare in sequenza più condizioni. Per esempio:

source: The :command:`if` command documents the many conditions it can test.
it: Il comando :command:`if` documenta le molte condizioni che può testare.

source: Looping Constructs
it: Costrutti per i Cicli

source: The :command:`foreach` and :command:`while` commands allow you to handle repetitive tasks that occur in sequence. The :command:`break` command breaks out of a :command:`foreach` or :command:`while` loop before it would normally end.
it: I comandi :command:`foreach` e :command:`while` consentono di gestire attività ripetitive che si verificano in sequenza. Il comando :command:`break` interrompe un ciclo :command:`foreach` o :command:`while` prima che termini normalmente.

source: The :command:`foreach` command enables you to execute a group of CMake commands repeatedly on the members of a list. Consider the following example adapted from VTK
it: Il comando :command:`foreach` consente di eseguire ripetutamente un gruppo di comandi CMake sui membri di un elenco. Si consideri il seguente esempio adattato da VTK

source: The first argument of the :command:`foreach` command is the name of the variable that will take on a different value with each iteration of the loop; the remaining arguments are the list of values over which to loop. In this example, the body of the :command:`foreach` loop is just one CMake command, :command:`add_test`. In the body of the :command:`foreach`, each time the loop variable (``tfile`` in this example) is referenced will be replaced with the current value from the list. In the first iteration, occurrences of ``${tfile}`` will be replaced with ``TestAnisotropicDiffusion2D``. In the next iteration, ``${tfile}`` will be replaced with ``TestButterworthLowPass``. The :command:`foreach` loop will continue to loop until all of the arguments have been processed.
it: Il primo argomento del comando :command:`foreach` è il nome della variabile che assumerà un valore diverso ad ogni iterazione del ciclo; gli argomenti rimanenti sono l'elenco di valori su cui eseguire il ciclo. In questo esempio, il corpo del ciclo :command:`foreach` è solo un comando CMake, :command:`add_test`. Nel corpo di :command:`foreach`, ogni volta che si fa riferimento alla variabile del ciclo (``tfile`` in questo esempio) verrà sostituita con il valore corrente dall'elenco. Nella prima iterazione, le occorrenze di ``${tfile}`` verranno sostituite con ``TestAnisotropicDiffusion2D``. Nella successiva iterazione, ``${tfile}`` verrà sostituito con ``TestButterworthLowPass``. Il ciclo :command:`foreach` continuerà fino a quando tutti gli argomenti non saranno stati elaborati.

source: It is worth mentioning that :command:`foreach` loops can be nested, and that the loop variable is replaced prior to any other variable expansion. This means that in the body of a :command:`foreach` loop, you can construct variable names using the loop variable. In the code below, the loop variable ``tfile`` is expanded, and then concatenated with ``_TEST_RESULT``. The new variable name is then expanded and tested to see if it matches ``FAILED``.
it: Vale la pena ricordare che i cicli :command:`foreach` possono essere nidificati e che la variabile del ciclo viene sostituita prima di qualsiasi altra espansione della variabile. Ciò significa che nel corpo di un ciclo :command:`foreach`, si possono costruire nomi di variabili usando la variabile del ciclo. Nel codice seguente, la variabile di ciclo ``tfile`` viene espansa e quindi concatenata con ``_TEST_RESULT``. Il nuovo nome della variabile viene quindi espanso e testato per vedere se corrisponde a ``FAILED``.

source: The :command:`while` command provides looping based on a test condition. The format for the test expression in the :command:`while` command is the same as it is for the :command:`if` command, as described earlier. Consider the following example, which is used by CTest. Note that CTest updates the value of ``CTEST_ELAPSED_TIME`` internally.
it: Il comando :command:`while` fornisce il ciclo basato su una condizione di test. Il formato per l'espressione di test nel comando :command:`while` è lo stesso del comando :command:`if`, come descritto. Si consideri l'esempio seguente, utilizzato da CTest. Da notare che CTest aggiorna internamente il valore di ``CTEST_ELAPSED_TIME``.

source: Procedure Definitions
it: Definizioni delle Procedure

source: The :command:`macro` and :command:`function` commands support repetitive tasks that may be scattered throughout your CMakeLists files. Once a macro or function is defined, it can be used by any CMakeLists files processed after its definition.
it: I comandi :command:`macro` e :command:`function` supportano attività ripetitive che possono essere sparse nei file CMakeLists. Una volta definita una macro o una funzione, questa può essere utilizzata da qualsiasi file CMakeLists elaborato dopo la sua definizione.

source: A function in CMake is very much like a function in C or C++. You can pass arguments into it, and they become variables within the function. Likewise, some standard variables such as ``ARGC``, ``ARGV``, ``ARGN``, and ``ARGV0``, ``ARGV1``, etc. are defined. Function calls have a dynamic scope. Within a function you are in a new variable scope; this is like how you drop into a subdirectory using the :command:`add_subdirectory` command and are in a new variable scope. All the variables that were defined when the function was called remain defined, but any changes to variables or new variables only exist within the function. When the function returns, those variables will go away. Put more simply: when you invoke a function, a new variable scope is pushed; when it returns, that variable scope is popped.
it: Una funzione in CMake è molto simile a una funzione in C o C++. Le si possono passare degli argomenti e questi diventano variabili all'interno della funzione. Allo stesso modo, sono definite alcune variabili standard come ``ARGC``, ``ARGV``, ``ARGN`` e ``ARGV0``, ``ARGV1``, ecc. Le chiamate a funzioni hanno uno scope dinamico. All'interno di una funzione ci si trova in un nuovo scope variabile; è come entrare in una sottodirectory usando il comando :command:`add_subdirectory` e trovarsi in un nuovo scope variabile. Tutte le variabili che sono state definite quando la funzione è stata chiamata rimangono definite, ma eventuali modifiche alle variabili o le nuove variabili esistono solo all'interno della funzione. Quando la funzione ritorna, quelle variabili andranno via. In parole povere: quando si invoca una funzione, viene inserito un nuovo scope variabile; quando ritorna, quello scope variabile viene ripreso.

source: The :command:`function` command defines a new function. The first argument is the name of the function to define; all additional arguments are formal parameters to the function.
it: Il comando :command:`function` definisce una nuova funzione. Il primo argomento è il nome della funzione da definire; tutti gli argomenti aggiuntivi sono parametri formali della funzione.

source: Note that in this example, ``_time`` is used to pass the name of the return variable. The :command:`set` command is invoked with the value of ``_time``, which will be ``current_time``. Finally, the :command:`set` command uses the ``PARENT_SCOPE`` option to set the variable in the caller's scope instead of the local scope.
it: Notare che in questo esempio, ``_time`` viene utilizzato per passare il nome della variabile restituita. Il comando :command:`set` viene invocato con il valore di ``_time``, che sarà ``current_time``. Infine, il comando :command:`set` utilizza l'opzione ``PARENT_SCOPE`` per impostare la variabile nello scope del chiamante anziché in quello locale.

source: Macros are defined and called in the same manner as functions. The main differences are that a macro does not push and pop a new variable scope, and that the arguments to a macro are not treated as variables but as strings replaced prior to execution. This is very much like the differences between a macro and a function in C or C++. The first argument is the name of the macro to create; all additional arguments are formal parameters to the macro.
it: Le macro vengono definite e chiamate allo stesso modo delle funzioni. Le differenze principali sono che una macro non esegue il push e il pop di un nuovo scope variabile e che gli argomenti di una macro non vengono trattati come variabili ma come stringhe sostituite prima dell'esecuzione. Questo è molto simile alle differenze tra una macro e una funzione in C o C++. Il primo argomento è il nome della macro da creare; tutti gli argomenti aggiuntivi sono parametri formali della macro.

source: The simple example above creates a macro called ``assert``. The macro is defined into two arguments; the first is a value to test and the second is a comment to print out if the test fails. The body of the macro is a simple :command:`if` command with a :command:`message` command inside of it. The macro body ends when the :command:`endmacro` command is found. The macro can be invoked simply by using its name as if it were a command. In the above example, if ``FOO_LIB`` was not found then a message would be displayed indicating the error condition.
it: Il semplice esempio precedente crea una macro chiamata ``assert``. La macro è definita in due argomenti; il primo è un valore da testare e il secondo è un commento da stampare se il test fallisce. Il corpo della macro è un semplice comando :command:`if` con un comando :command:`message` al suo interno. Il corpo della macro termina quando viene trovato il comando :command:`endmacro`. La macro può essere invocata semplicemente usando il suo nome come se fosse un comando. Nell'esempio precedente, se ``FOO_LIB`` non è stato trovato, verrà visualizzato un messaggio che indica la condizione di errore.

source: The :command:`macro` command also supports defining macros that take variable argument lists. This can be useful if you want to define a macro that has optional arguments or multiple signatures. Variable arguments can be referenced using ``ARGC`` and ``ARGV0``, ``ARGV1``, etc., instead of the formal parameters. ``ARGV0`` represents the first argument to the macro; ``ARGV1`` represents the next, and so forth. You can also use a mixture of formal arguments and variable arguments, as shown in the example below.
it: Il comando :command:`macro` supporta anche la definizione di macro che accettano elenchi variabili di argomenti. Ciò può essere utile se si desidera definire una macro con argomenti facoltativi o firme multiple. Gli argomenti variabili possono essere referenziati usando ``ARGC`` e ``ARGV0``, ``ARGV1``, ecc., invece dei parametri formali. ``ARGV0`` rappresenta il primo argomento della macro; ``ARGV1`` rappresenta il successivo e così via. È inoltre possibile utilizzare una combinazione di argomenti formali e argomenti variabili, come mostrato nell'esempio seguente.

source: In this example, the two required arguments are ``TEST`` and ``COMMENT``. These required arguments can be referenced by name, as they are in this example, or by referencing ``ARGV0`` and ``ARGV1``. If you want to process the arguments as a list, use the ``ARGV`` and ``ARGN`` variables. ``ARGV`` (as opposed to ``ARGV0``, ``ARGV1``, etc) is a list of all the arguments to the macro, while ``ARGN`` is a list of all the arguments after the formal arguments. Inside your macro, you can use the :command:`foreach` command to iterate over ``ARGV`` or ``ARGN`` as desired.
it: In questo esempio, i due argomenti obbligatori sono ``TEST`` e ``COMMENT``. È possibile fare riferimento a questi argomenti obbligatori per nome, come in questo esempio, o facendo riferimento a ``ARGV0`` e ``ARGV1``. Per elaborare gli argomenti come una lista, usare le variabili ``ARGV`` e ``ARGN``. ``ARGV`` (al contrario di ``ARGV0``, ``ARGV1``, ecc.) è un elenco di tutti gli argomenti della macro, mentre ``ARGN`` è un elenco di tutti gli argomenti dopo gli argomenti formali. All'interno della macro, si può utilizzare il comando :command:`foreach` per iterare su ``ARGV`` o ``ARGN`` come desiderato.

source: The :command:`return` command returns from a function, directory or file. Note that a macro, unlike a function, is expanded in place and therefore cannot handle :command:`return`.
it: Il comando :command:`return` ritorna da una funzione, directory o file. Notare che una macro, a differenza di una funzione, viene espansa sul posto e quindi non può gestire :command:`return`.

source: Regular Expressions
it: Espressioni Regolari

source: A few CMake commands, such as :command:`if` and :command:`string`, make use of regular expressions or can take a regular expression as an argument. In its simplest form, a regular expression is a sequence of characters used to search for exact character matches. However, many times the exact sequence to be found is unknown, or only a match at the beginning or end of a string is desired. Since there are several different conventions for specifying regular expressions, CMake's standard is described in the :command:`string` command documentation. The description is based on the open source regular expression class from Texas Instruments, which is used by CMake for parsing regular expressions.
it: Alcuni comandi CMake, come :command:`if` e :command:`string`, fanno uso di espressioni regolari o possono prendere un'espressione regolare come argomento. Nella sua forma più semplice, un'espressione regolare è una sequenza di caratteri utilizzata per cercare corrispondenze esatte di caratteri. Tuttavia, molte volte la sequenza esatta da trovare è sconosciuta o si desidera solo una corrispondenza all'inizio o alla fine di una stringa. Poiché esistono diverse convenzioni per specificare le espressioni regolari, lo standard di CMake è descritto nella documentazione del comando :command:`string`. La descrizione si basa sulla classe di espressioni regolari open source di Texas Instruments, utilizzata da CMake per l'analisi delle espressioni regolari.

source: Advanced Commands
it: Comandi Avanzati

source: There are a few commands that can be very useful, but are not typically used in writing CMakeLists files. This section will discuss a few of these commands and when they are useful.
it: Esistono alcuni comandi che possono essere molto utili, ma in genere non vengono utilizzati nella scrittura di file CMakeLists. Questa sezione tratterà alcuni di questi comandi e quando risultano utili.

source: First, consider the :command:`add_dependencies` command which creates a dependency between two targets. CMake automatically creates dependencies between targets when it can determine them. For example, CMake will automatically create a dependency for an executable target that depends on a library target. The :command:`add_dependencies` command is typically used to specify inter-target dependencies between targets where at least one of the targets is a custom target (see :ref:`add_custom_command` section).
it: Innanzitutto, si considera il comando :command:`add_dependencies` che crea una dipendenza tra due target. CMake crea automaticamente dipendenze tra i target quando può determinarle. Ad esempio, CMake creerà automaticamente una dipendenza per un target eseguibile che dipende da un target libreria. Il comando :command:`add_dependencies` viene in genere utilizzato per specificare le dipendenze inter-target in cui almeno uno è un target personalizzato (vedere la sezione :ref:`add_custom_command`).

source: The :command:`include_regular_expression` command also relates to dependencies. This command controls the regular expression that is used for tracing source code dependencies. By default, CMake will trace all the dependencies for a source file including system files such as ``stdio.h``. If you specify a regular expression with the :command:`include_regular_expression` command, that regular expression will be used to limit which include files are processed. For example; if your software project's include files all started with the prefix foo (e.g. ``fooMain.c fooStruct.h``, etc), you could specify a regular expression of ``^foo.*$`` to limit the dependency checking to just the files of your project.
it: Anche il comando :command:`include_regular_expression` riguarda le dipendenze. Questo comando controlla l'espressione regolare utilizzata per tracciare [trace] le dipendenze del codice sorgente. Per default, CMake traccerà [trace] tutte le dipendenze per un file sorgente inclusi i file di sistema come ``stdio.h``. Se si specifica un'espressione regolare col comando :command:`include_regular_expression`, tale espressione regolare verrà utilizzata per limitare i file header processati. Per esempio; se i file header del progetto software iniziano tutti col prefisso foo (ad es. ``fooMain.c fooStruct.h``, ecc.), si può specificare un'espressione regolare di ``^foo.*$`` per limitare il controllo delle dipendenze ai soli file del progetto.
