Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: To use ``fixup_bundle``, first install one of your executable targets. Then, configure a CMake script that can be called at install time. Inside the configured CMake script, simply :command:`include` :module:`BundleUtilities` and call the ``fixup_bundle`` function with appropriate arguments.
it: Per utilizzare ``fixup_bundle``, si installa prima uno dei target eseguibili. Poi, si configura uno script CMake richiamabile al momento dell'installazione. All'interno dello script configurato di CMake, semplicemente si :command:`include` :module:`BundleUtilities` e si chiama la funzione ``fixup_bundle`` con gli argomenti appropriati.

source: You are responsible for verifying that you have permission to copy and distribute the prerequisite shared libraries for your executable. Some libraries may have restrictive software licenses that prohibit making copies a la ``fixup_bundle``.
it: Si è responsabili di verificare di disporre dell'autorizzazione per copiare e distribuire le librerie shared prerequisite per l'eseguibile. Alcune librerie potrebbero avere licenze software restrittive che vietano di fare copie alla ``fixup_bundle``.

source: Key Concepts
it: Concetti Chiave

source: This chapter provides an introduction to CMake's key concepts. As you start working with CMake, you will run into a variety of concepts such as targets, generators, and commands. Understanding these concepts will provide you with the working knowledge you need to create effective CMakeLists files. Many CMake objects such as targets, directories and source files have properties associated with them. A property is a key-value pair attached to a specific object. The most generic way to access properties is through the :command:`set_property` and :command:`get_property` commands. These commands allow you to set or get a property from any object in CMake that has properties. See the :manual:`cmake-properties <cmake-properties(7)>` manual for a list of supported properties. From the command line a full list of properties supported in CMake can be obtained by running :manual:`cmake <cmake(1)>` with the ``--help-property-list`` option.
it: Questo capitolo introduce i concetti chiave di CMake. Quando si inizia a lavorare con CMake, ci si imbatte in una varietà di concetti come target, generatori e comandi. La comprensione di questi concetti fornirà le conoscenze operative necessarie per creare file CMakeLists efficaci. Molti oggetti CMake come target, directory e file sorgenti hanno delle proprietà associate. Una proprietà è una coppia chiave-valore associata a un oggetto specifico. Il modo più generico per accedere alle proprietà è tramite i comandi :command:`set_property` e :command:`get_property`. Questi comandi consentono di impostare o ottenere una proprietà da qualsiasi oggetto in CMake che ne dispone. Consultare il manuale :manual:`cmake-properties <cmake-properties(7)>` per un elenco delle proprietà supportate. Dalla riga di comando è possibile ottenere un elenco completo delle proprietà supportate in CMake eseguendo :manual:`cmake <cmake(1)>` con l'opzione ``--help-property-list``.

source: Targets
it: Target

source: Probably the most important item is targets. Targets represent executables, libraries, and utilities built by CMake. Every :command:`add_library`, :command:`add_executable`, and :command:`add_custom_target` command creates a target. For example, the following command will create a target named "foo" that is a static library, with ``foo1.c`` and ``foo2.c`` as source files.
it: Probabilmente l'elemento più importante sono i target. I target rappresentano eseguibili, librerie e utilità create da CMake. Ogni comando :command:`add_library`, :command:`add_executable` e :command:`add_custom_target` crea un target. Ad esempio, il seguente comando creerà un target, denominato "foo", che è una libreria statica, con ``foo1.c`` e ``foo2.c`` come file sorgente.

source: The name "foo" is now available for use as a library name everywhere else in the project, and CMake will know how to expand the name into the library when needed. Libraries can be declared as a particular type such as ``STATIC``, ``SHARED``, ``MODULE``, or left undeclared. ``STATIC`` indicates that the library must be built as a static library. Likewise, ``SHARED`` indicates it must be built as a shared library. ``MODULE`` indicates that the library must be created so that it can be dynamically-loaded into an executable. Module libraries are implemented as shared libraries on many platforms, but not all. Therefore, CMake does not allow other targets to link to modules. If none of these options are specified, it indicates that the library could be built as either shared or static. In that case, CMake uses the setting of the variable :variable:`BUILD_SHARED_LIBS` to determine if the library should be ``SHARED`` or ``STATIC``. If it is not set, then CMake defaults to building static libraries.
it: Il nome "foo" è ora disponibile per l'uso, come nome di libreria, ovunque nel progetto e CMake saprà come espandere il nome nella libreria quando necessario. Le librerie possono essere dichiarate come un tipo particolare come ``STATIC``, ``SHARED``, ``MODULE``, o senza dichiarazione. ``STATIC`` indica che la libreria deve essere creata come libreria statica. Allo stesso modo, ``SHARED`` indica che deve essere creata come libreria condivisa. ``MODULE`` indica che la libreria deve essere creata in modo che possa essere caricata dinamicamente in un eseguibile. Le librerie dei moduli vengono implementate come librerie condivise su molte piattaforme, ma non tutte. Pertanto, CMake non consente ad altri target di collegarsi ai moduli. Se nessuna di queste opzioni è specificata, significa che la libreria può essere creata come condivisa o statica. In tal caso, CMake utilizza l'impostazione della variabile :variable:`BUILD_SHARED_LIBS` per determinare se la libreria deve essere ``SHARED`` o ``STATIC``. Se non è impostata, per default CMake crea librerie statiche.

source: Likewise, executables have some options. By default, an executable will be a traditional console application that has a main entry point. One may specify a ``WIN32`` option to request a WinMain entry point on Windows systems, while retaining main on non-Windows systems.
it: Allo stesso modo, gli eseguibili hanno alcune opzioni. Per default, un eseguibile sarà un'applicazione console tradizionale con un punto di ingresso principale. È possibile specificare un'opzione ``WIN32`` per richiedere un punto di ingresso WinMain su sistemi Windows, mantenendo "main" su sistemi non Windows.

source: In addition to storing their type, targets also keep track of general properties. These properties can be set and retrieved using the :command:`set_target_properties` and :command:`get_target_property` commands, or the more general :command:`set_property` and :command:`get_property` commands. One useful property is :prop_tgt:`LINK_FLAGS`, which is used to specify additional link flags for a specific target. Targets store a list of libraries that they link against, which are set using the :command:`target_link_libraries` command. Names passed into this command can be libraries, full paths to libraries, or the name of a library from an :command:`add_library` command. Targets also store the link directories to use when linking, and custom commands to execute after building.
it: Oltre a memorizzarne il tipo, i target tengono traccia anche delle proprietà generali. Tali proprietà possono essere impostate e recuperate usando i comandi :command:`set_target_properties` e :command:`get_target_property`, o i comandi più generali :command:`set_property` e :command:`get_property`. Una proprietà utile è :prop_tgt:`LINK_FLAGS`, che viene utilizzata per specificare flag di link aggiuntivi per un target specifico. I target memorizzano un elenco di librerie a cui si collegano, che vengono impostate utilizzando il comando :command:`target_link_libraries`. I nomi passati a questo comando possono essere librerie, path completi alle librerie o il nome di una libreria da un comando :command:`add_library`. I target memorizzano anche le directory dei collegamento da utilizzare durante il link e i comandi personalizzati da eseguire dopo il build.

source: Usage Requirements
it: Requisiti d'Uso

source: CMake will also propagate "usage requirements" from linked library targets. Usage requirements affect compilation of sources in the <target>. They are specified by properties defined on linked targets.
it: CMake propagherà anche i "requisiti di utilizzo" dai target della libreria linkata. I requisiti di utilizzo influenzano la compilazione dei sorgenti nel <target>. Sono specificati dalle proprietà definite sui target collegati.

source: For example, to specify include directories that are required when linking to a library you would can do the following:
it: Ad esempio, per specificare le directory di inclusione richieste durante il collegamento a una libreria, è possibile eseguire le seguenti operazioni:

source: Now anything that links to the target foo will automatically have foo's binary and source as include directories. The order of the include directories brought in through "usage requirements" will match the order of the targets in the :command:`target_link_libraries` call.
it: Ora tutto ciò che si collega al target foo avrà automaticamente il binario e il sorgente di foo come directory di inclusione. L'ordine delle directory di inclusione introdotte tramite i "requisiti di utilizzo" corrisponderà all'ordine dei target nella chiamata :command:`target_link_libraries`.

source: For each library or executable CMake creates, it tracks of all the libraries on which that target depends using the :command:`target_link_libraries` command. For example:
it: Per ogni libreria o eseguibile creato da CMake, si tiene traccia di tutte le librerie da cui dipende quel target utilizzando il comando :command:`target_link_libraries`. Per esempio:

source: will link the libraries "foo" and "bar" into the executable "foobar" even though only "foo" was explicitly specified for it.
it: linkerà le librerie "foo" e "bar" nell'eseguibile "foobar" anche se solo "foo" è stato esplicitamente specificato.

source: Specifying Optimized or Debug Libraries with a Target
it: Specifica delle Librerie Ottimizzate o di Debug con un Target

source: On Windows platforms, users are often required to link debug libraries with debug libraries, and optimized libraries with optimized libraries. CMake helps satisfy this requirement with the :command:`target_link_libraries` command, which accepts an optional flag labeled as ``debug`` or ``optimized``. If a library is preceded with either ``debug`` or ``optimized``, then that library will only be linked in with the appropriate configuration type. For example
it: Sulle piattaforme Windows, agli utenti viene spesso richiesto di linkare librerie di debug con librerie di debug e librerie ottimizzate con librerie ottimizzate. CMake aiuta a soddisfare questo requisito con il comando :command:`target_link_libraries`, che accetta un flag opzionale etichettato come ``debug`` o ``optimized``. Se una libreria è preceduta da ``debug`` o ``optimized``, questa sarà collegata solo col tipo di configurazione appropriato. Per esempio

source: In this case, foo will be linked against libdebug if a debug build was selected, or against libopt if an optimized build was selected.
it: In questo caso, foo sarà collegato a libdebug se è stata selezionata una build di debug o a libopt se è stata selezionata una build ottimizzata.

source: Object Libraries
it: Librerie di Oggetti

source: Large projects often organize their source files into groups, perhaps in separate subdirectories, that each need different include directories and preprocessor definitions. For this use case CMake has developed the concept of Object Libraries.
it: I progetti di grandi dimensioni spesso organizzano i propri file sorgenti in gruppi, magari in sottodirectory separate, ciascuna delle quali necessita di diverse directory di inclusione e definizioni del preprocessore. Per questo caso d'uso CMake ha sviluppato il concetto di Object Libraries (librerie di oggetti).

source: An Object Library is a collection of source files compiled into an object file which is not linked into a library file or made into an archive. Instead other targets created by :command:`add_library` or :command:`add_executable` may reference the objects using an expression of the form ``$<TARGET_OBJECTS:name>`` as a source, where "name" is the target created by the :command:`add_library` call. For example:
it: Una Object Library è una raccolta di sorgenti compilati in un file oggetto che non è collegato a un file di libreria o trasformato in un archivio. Invece altri target creati da :command:`add_library` o da :command:`add_executable` possono fare riferimento agli oggetti utilizzando un'espressione della forma ``$<TARGET_OBJECTS:name>`` come sorgente, dove "name" è il target creato dalla chiamata :command:`add_library`. Per esempio:

source: will include A and B object files in a library called Combined. Object libraries may contain only sources (and headers) that compile to object files.
it: includerà i file oggetto A e B in una libreria chiamata Combined. Le librerie di oggetti possono contenere solo sorgenti (e header) che vengono compilati in file oggetto.

source: Source Files
it: File Sorgenti

source: The source file structure is in many ways similar to a target. It stores the filename, extension, and a number of general properties related to a source file. Like targets, you can set and get properties using :command:`set_source_files_properties` and :command:`get_source_file_property`, or the more generic versions.
it: La struttura del file sorgenti è per molti versi simile a un target. Memorizza il nome del file, l'estensione e una serie di proprietà generali relative a un file sorgente. Come per i target, si possono impostare e ottenere proprietà usando :command:`set_source_files_properties` e :command:`get_source_file_property`, o le versioni più generiche.

source: Directories, Tests, and Properties
it: Directory, Test e Proprietà

source: In addition to targets and source files, you may find yourself occasionally working with other objects such as directories and tests. Normally such interactions take the shape of setting or getting properties (e.g. :command:`set_directory_properties` or :command:`set_tests_properties`) from these objects.
it: Oltre ai target e ai sorgenti, ci si potrebbe trovare a lavorare occasionalmente con altri oggetti come directory e test. Normalmente tali interazioni assumono la forma impostazioni o interrogazioni delle proprietà (ad esempio :command:`set_directory_properties` o :command:`set_tests_properties`) da questi oggetti.

source: Modules
it: Moduli

source: Using Modules
it: Utilizzo dei Moduli

source: Code reuse is a valuable technique in software development and CMake has been designed to support it. Allowing CMakeLists files to make use of reusable modules enables the entire community to share reusable sections of code. For CMake, these sections are called :manual:`cmake-modules <cmake-modules(7)>` and can be found in the Modules subdirectory of your installation.
it: Il riutilizzo del codice è una tecnica preziosa nello sviluppo del software e CMake è stato progettato per supportarlo. Consentire ai file CMakeLists di utilizzare moduli riutilizzabili consente all'intera comunità di condividere sezioni di codice riutilizzabili. Per CMake, queste sezioni sono chiamate :manual:`cmake-modules <cmake-modules(7)>` e si trovano nella sottodirectory Modules dell'installazione.

source: A module's location can be specified using the full path to the module file, or by letting CMake find the module by itself. CMake will look for modules in the directories specified by :variable:`CMAKE_MODULE_PATH`; if it cannot find it there, it will look in the Modules subdirectory. This way projects can override modules that CMake provides and customize them for their needs. Modules can be broken into a few main categories:
it: La posizione di un modulo può essere specificata utilizzando il path completo del file del modulo o lasciando che CMake lo trovi da solo. CMake cercherà i moduli nelle directory specificate da :variable:`CMAKE_MODULE_PATH`; se non riesce a trovarlo lì, cercherà nella sottodirectory Modules. In questo modo i progetti possono sovrascrivere i moduli forniti da CMake e personalizzarli in base alle proprie esigenze. I moduli possono essere suddivisi in alcune categorie principali:

source: Find Modules
it: Moduli Find

source: These modules support the :command:`find_package` command to determine the location of software elements, such as header files or libraries, that belong to a given package. Do not include them directly. Use the :command:`find_package` command. Each module comes with documentation describing the package it finds and the variables in which it provides results.
it: Questi moduli supportano il comando :command:`find_package` per determinare la posizione degli elementi software, come i file header o le librerie, che appartengono a un determinato pacchetto. Non si devono includere direttamente. Si usa il comando :command:`find_package`. Ogni modulo viene fornito con una documentazione che descrive il pacchetto che trova e le variabili in cui fornisce i risultati.

source: Utility Modules
it: Moduli Utility

source: Utility modules are simply sections of CMake commands put into a file; they can then be included into other CMakeLists files using the :command:`include` command. For example, the following commands will include the :module:`CheckTypeSize` module from CMake and then use the macro it defines.
it: I moduli utility sono semplicemente sezioni di comandi CMake inseriti in un file; possono quindi essere inclusi in altri file CMakeLists utilizzando il comando :command:`include`. Ad esempio, i seguenti comandi includeranno il modulo :module:`CheckTypeSize` di CMake e poi utilizzeranno la macro che definisce.

source: These modules test the system to provide information about the target platform or compiler, such as the size of a float or support for ANSI C++ streams. Many of these modules have names prefixed with ``Test`` or ``Check``, such as :module:`TestBigEndian` and :module:`CheckTypeSize`. Some of them try to compile code in order to determine the correct result. In these cases, the source code is typically named the same as the module, but with a ``.c`` or ``.cxx`` extension. Utility modules also provide useful macros and functions implemented in the CMake language and intended for specific, common use cases. See documentation of each module for details.
it: Questi moduli testano il sistema per fornire informazioni sulla piattaforma o sul compilatore target, ad esempio la dimensione di un float o il supporto per gli stream ANSI C++. Molti di questi moduli hanno nomi preceduti da ``Test`` o ``Check``, come :module:`TestBigEndian` e :module:`CheckTypeSize`. Alcuni di loro cercano di compilare il codice per determinare il risultato corretto. In questi casi, il codice sorgente è tipicamente denominato come il modulo, ma con un'estensione ``.c`` o ``.cxx``. I moduli di utility forniscono anche utili macro e funzioni implementate nel linguaggio CMake e destinate a casi d'uso specifici e comuni. Consultare la documentazione di ciascun modulo per i dettagli.

source: Packaging With CPack
it: Il Packaging Con CPack

source: CPack is a powerful, easy to use, cross-platform software packaging tool distributed with CMake. It uses the generators concept from CMake to abstract package generation on specific platforms. It can be used with or without CMake, but it may depend on some software being installed on the system. Using a simple configuration file, or using a CMake module, the author of a project can package a complex project into a simple installer. This chapter will describe how to apply CPack to a CMake project.
it: CPack è uno strumento di packaging software potente, facile da usare e multipiattaforma distribuito con CMake. Utilizza il concetto di generatori di CMake per astrarre la generazione di pacchetti su piattaforme specifiche. Può essere utilizzato con o senza CMake, ma potrebbe dipendere da alcuni software installati sul sistema. Utilizzando un semplice file di configurazione o utilizzando un modulo CMake, l'autore di un progetto può impacchettare un progetto complesso in un semplice programma di installazione. Questo capitolo descriverà come applicare CPack a un progetto CMake.

source: CPack Basics
it: Nozioni di base su CPack

source: Users of your software may not always want to, or be able to, build the software in order to install it. The software may be closed source, or it may take a long time to compile, or in the case of an end user application, the users may not have the skill or the tools to build the application. For these cases, what is needed is a way to build the software on one machine, and then move the install tree to a different machine. The most basic way to do this is to use the DESTDIR environment variable to install the software into a temporary location, then to tar or zip up that directory and move it to another machine. However, the DESTDIR approach falls short on Windows, simply because path names typically start with a drive letter (C:/) and you cannot simply prefix one full path with another and get a valid path name. Another more powerful approach is to use CPack, included in CMake.
it: Gli utenti del software potrebbero non sempre volere o essere in grado di creare il software per installarlo. Il software potrebbe essere a codice chiuso o la compilazione potrebbe richiedere molto tempo oppure, nel caso di un'applicazione per l'utente finale, gli utenti potrebbero non disporre delle competenze o degli strumenti per creare l'applicazione. In questi casi, è necessario un modo per creare il software su una macchina e quindi spostare l'albero di installazione su un'altra macchina. Il modo più semplice per farlo è utilizzare la variabile d'ambiente DESTDIR per installare il software in una posizione temporanea, poi tarare o comprimere quella directory e spostarla su un'altra macchina. Tuttavia, l'approccio DESTDIR non è all'altezza su Windows, semplicemente perché i path in genere iniziano con una lettera di unità (C:/) e non è possibile aggiungere semplicemente un prefisso a un path completo con un altro e ottenere un nome di path valido. Un altro approccio più potente consiste nell'utilizzare CPack, incluso in CMake.
