Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: The :module:`ExternalData` module implements a flexible system to prevent duplication of content fetching and storage. Objects are retrieved from a list of (possibly redundant) local and remote locations specified in the :module:`ExternalData` CMake configuration as a list of "URL templates". The only requirement of remote storage systems is the ability to fetch from a URL that locates content through specification of the hash algorithm and hash value. Local or networked file systems, an Apache FTP server or a `Midas <http://www.midasplatform.org>`_ server , for example, all have this capability. Each URL template has %(algo) and %(hash) placeholders for :module:`ExternalData` to replace with values from a content link.
it: Il modulo :module:`ExternalData` implementa un sistema flessibile per impedire la duplicazione del recupero e dell'archiviazione dei contenuti. Gli oggetti vengono recuperati da un elenco di posizioni locali e remote (possibilmente ridondanti) specificate nella configurazione :module:`ExternalData` CMake come un elenco di "URL templates". L'unico requisito dei sistemi di archiviazione remota è la capacità di recuperare da un URL che individua il contenuto attraverso la specifica dell'algoritmo hash e del valore hash. I file system locali o in rete, un server FTP Apache o un server `Midas <http://www.midasplatform.org>`_, ad esempio, hanno tutti questa capacità. Ogni template di URL ha segnaposto %(algo) e %(hash) per :module:`ExternalData` da sostituire con i valori di un link al contenuto.

source: A persistent local object store can cache downloaded content to share among build trees by setting the ``ExternalData_OBJECT_STORES`` CMake build configuration variable. This is helpful to de-duplicate content for multiple build trees. It also resolves an important pragmatic concern in a regression testing context; when many machines simultaneously start a nightly dashboard build, they can use their local object store instead of overloading the data servers and flooding network traffic.
it: Un archivio oggetti locale persistente può memorizzare nella cache il contenuto scaricato per condividerlo tra gli alberi di build impostando la variabile CMake di configurazione della build ``ExternalData_OBJECT_STORES``. Ciò è utile per de-duplicare il contenuto per più alberi di build. Risolve anche un'importante preoccupazione pragmatica in un contesto di test di regressione; quando molte macchine avviano contemporaneamente una build notturna del dashboard, possono utilizzare il loro archivio oggetti locale invece di sovraccaricare i server di dati e inondare il traffico di rete.

source: Retrieval is integrated with a dependency-based build system, so resources are fetched only when needed. For example, if the system is used to retrieve testing data and ``BUILD_TESTING`` is OFF, the data are not retrieved unnecessarily. When the source tree is updated and a content link changes, the build system fetches the new data as needed.
it: Il recupero è integrato con un sistema di build basato sulle dipendenze, quindi le risorse vengono recuperate solo quando necessario. Ad esempio, se il sistema viene utilizzato per recuperare dati di test e ``BUILD_TESTING`` è disattivato, i dati non vengono recuperati inutilmente. Quando l'albero dei sorgenti viene aggiornato e un link al contenuto cambia, il sistema di build recupera i nuovi dati secondo necessità.

source: Since all references leaving the source tree go through hashes, they do not depend on any external state. Remote and local object stores can be relocated without invalidating content links in older versions of the source code. Content links within a source tree can be relocated or renamed without modifying the object stores. Duplicate content links can exist in a source tree, but download will only occur once. Multiple versions of data with the same source tree file name in a project's history are uniquely identified in the object stores.
it: Poiché tutti i riferimenti che lasciano l'albero dei sorgenti passano attraverso gli hash, non dipendono da alcuno stato esterno. Gli archivi di oggetti remoti e locali possono essere riposizionati senza invalidare i link ai contenuti nelle versioni precedenti del codice sorgente. I link al contenuto all'interno di un albero di origine possono essere riposizionati o rinominati senza modificare gli archivi oggetti. In un albero di sorgenti possono esistere link ai contenuti duplicati, ma il download avverrà solo una volta. Più versioni di dati con lo stesso nome del file dell'albero dei sorgenti nella cronologia di un progetto vengono identificate in modo univoco negli archivi degli oggetti.

source: Hash-based systems allow the use of untrusted connections to remote resources because downloaded content is verified after it is retrieved. Configuration of the URL templates list improves robustness by allowing multiple redundant remote storage resources. Storage resources can also change over time on an as-needed basis. If a project's remote storage moves over time, a build of older source code versions is always possible by adjusting the URL templates configured for the build tree or by manually populating a local object store.
it: I sistemi basati su hash consentono l'utilizzo di connessioni non attendibili a risorse remote perché il contenuto scaricato viene verificato dopo il recupero. La configurazione dell'elenco dei modelli di URL migliora l'affidabilità consentendo più risorse di archiviazione remote ridondanti. Le risorse di archiviazione possono anche cambiare nel tempo in base alle necessità. Se l'archiviazione remota di un progetto si sposta nel tempo, è sempre possibile creare versioni precedenti del codice sorgente modificando i modelli di URL configurati per l'albero di build o popolando manualmente un archivio oggetti locale.

source: A simple application of the :module:`ExternalData` module looks like the following:
it: Una semplice applicazione del modulo :module:`ExternalData` ha il seguente aspetto:

source: The ``ExternalData_Add_Test`` function is a wrapper around CMake's :command:`add_test` command. The source tree is probed for a Input/Image.png.md5 content link containing the data's MD5 hash. After checking the local object store, a request is made sequentially to each URL in the ``ExternalData_URL_TEMPLATES`` list with the data's hash. Once found, a symlink is created in the build tree. The DATA{Input/Image.png} path will expand to the build tree path in the test command line. Data are retrieved when the MyProjectData target is built.
it: La funzione ``ExternalData_Add_Test`` è un wrapper del comando :command:`add_test` di CMake. L'albero dei sorgenti viene analizzato per un link al contenuto Input/Image.png.md5 contenente l'hash MD5 dei dati. Dopo aver verificato l'archivio oggetti locale, viene effettuata una richiesta in sequenza a ciascun URL nell'elenco ``ExternalData_URL_TEMPLATES`` con l'hash dei dati. Una volta trovato, viene creato un link simbolico nell'albero di compilazione. Il percorso DATA{Input/Image.png} si espanderà nel percorso dell'albero di build nella riga di comando del test. I dati vengono recuperati quando viene creato il target MyProjectData.

source: Why CMake?
it: Perché CMake?

source: If you have ever maintained the build and installation process for a software package, you will be interested in CMake. CMake is an open-source build system generator for software projects that allows developers to specify build parameters in a simple, portable, text file format. This file is then used by CMake to generate project files for native build tools including Integrated Development Environments (IDEs) such as Microsoft Visual Studio or Apple's Xcode, as well as UNIX, Linux, NMake, and Ninja. CMake handles the difficult aspects of building software such as cross-platform builds, system introspection, and user customized builds, in a simple manner that allows users to easily tailor builds for complex hardware and software systems.
it: Se si ha esperienza nella manutenzione del processo di build e di installazione di un pacchetto software, CMake risulterà interessante. CMake è un generatore di sistema di build open source per progetti software che consente agli sviluppatori di specificare i parametri di build in un formato testuale semplice e portatile. Questo file viene poi utilizzato da CMake per generare file di progetto per strumenti di build nativi, inclusi gli ambienti di sviluppo integrato (IDE) come Microsoft Visual Studio o Xcode di Apple, nonché UNIX, Linux, NMake e Ninja. CMake gestisce gli aspetti difficili della creazione di software come build multipiattaforma, introspezione del sistema e build personalizzate dall'utente, in un modo semplice che consente agli utenti di personalizzare facilmente le build per sistemi hardware e software complessi.

source: For any project, and especially cross-platform projects, there is a need for a unified build system. Many non CMake-based projects ship with both a UNIX Makefile (or Makefile.in) and a Microsoft Visual Studio workspace. This requires that developers constantly try to keep both build systems up-to-date and consistent with each other. To target additional build systems, such as Xcode, requires even more custom copies of these files, creating an even bigger problem. This problem is compounded if you try to support optional components, such as including JPEG support if libjpeg is available on the system. CMake solves this by consolidating these different operations into one simple, easy-to-understand file format.
it: Per qualsiasi progetto, e in particolare per quelli cross-piattaforma, è necessario un sistema di build unificato. Molti progetti non basati su CMake vengono forniti con un Makefile UNIX (o Makefile.in) e un'area di lavoro Microsoft Visual Studio. Ciò richiede che gli sviluppatori cerchino costantemente di mantenere entrambi i sistemi di build aggiornati e coerenti tra loro. Per indirizzare sistemi di build aggiuntivi, come Xcode, sono necessarie ancora più copie personalizzate di questi file, creando un problema ancora più grande. Questo problema è aggravato se si tenta di supportare componenti opzionali, come includere il supporto JPEG se libjpeg è disponibile sul sistema. CMake risolve questo problema consolidando queste diverse operazioni in un formato di file semplice e di facile comprensione.

source: If you have multiple developers working on a project, or multiple target platforms, then the software will have to be built on more than one computer. Given the wide range of installed software and custom options that are involved with setting up a modern computer, the chances are that two computers running the same OS will be slightly different. CMake provides many :index:`benefits <single: CMake ; benefits>` for single platform, multi-machine development environments including:
it: Se ci sono più sviluppatori che lavorano su un progetto o più piattaforme target, il software dovrà essere creato su più di un computer. Data l'ampia gamma di software installati e opzioni personalizzate che sono coinvolte nella configurazione di un computer moderno, è probabile che due computer che eseguono lo stesso sistema operativo siano leggermente diversi. CMake offre molti :index:`benefici <single: CMake ; benefits>` per ambienti di sviluppo su piattaforma singola e multi-macchina, tra cui:

source: The ability to automatically search for programs, libraries, and header files that may be required by the software being built. This includes the ability to consider environment variables and Window's registry settings when searching.
it: La possibilità di cercare automaticamente programmi, librerie e file header che potrebbero essere richiesti dal software in fase di build. Ciò include la possibilità di considerare le variabili di ambiente e le impostazioni del registro di Windows durante la ricerca.

source: The ability to build in a directory tree outside of the source tree. This is a useful feature found on many UNIX platforms; CMake provides this feature on Windows as well. This allows a developer to remove an entire build directory without fear of removing source files.
it: La capacità di creare una struttura di directory al di fuori dell'albero dei sorgenti. Questa è una funzione utile che si trova su molte piattaforme UNIX; CMake fornisce questa funzionalità anche su Windows. Ciò consente a uno sviluppatore di rimuovere un'intera directory di build senza timore di rimuovere i file sorgenti.

source: The ability to create complex, custom commands for automatically generated files such as `Qt <http://qt.io>`_'s moc() or `SWIG <http://www.swig.org>`_ wrapper generators. These commands are used to generate new source files during the build process that are in turn compiled into the software.
it: La capacità di creare comandi complessi e personalizzati per file generati automaticamente come i moc() di `Qt <http://qt.io>`_ o i generatori di wrapper di `SWIG <http://www.swig.org>`_. Questi comandi vengono utilizzati per generare nuovi sorgenti durante il processo di build che vengono a loro volta compilati nel software.

source: The ability to select optional components at configuration time. For example, several of `VTK's <http://www.vtk.org>`_ libraries are optional, and CMake provides an easy way for users to select which libraries are built.
it: La possibilità di selezionare componenti opzionali al momento della configurazione. Ad esempio, molte delle librerie di `VTK <http://www.vtk.org>`_ sono opzionali e CMake fornisce un modo semplice per gli utenti di selezionare quali librerie sono create.

source: The ability to automatically generate workspaces and projects from a simple text file. This can be very handy for systems that have many programs or test cases, each of which requires a separate project file, typically a tedious manual process to create using an IDE.
it: La capacità di generare automaticamente aree di lavoro [workspace] e progetti da un semplice file di testo. Questo può risultare molto utile per i sistemi che hanno molti programmi o casi di test, ognuno dei quali richiede un file di progetto separato, in genere un noioso processo manuale da creare utilizzando un IDE.

source: The ability to easily switch between static and shared builds. CMake knows how to create shared libraries and modules on all platforms supported. Complicated platform-specific linker flags are handled, and advanced features like built-in run time search paths for shared libraries are supported on many UNIX systems.
it: La possibilità di passare facilmente tra build statiche e shared. CMake sa come creare librerie e moduli shared su tutte le piattaforme supportate. Vengono gestiti complicati flag del linker specifici della piattaforma e su molti sistemi UNIX sono supportate funzioni avanzate come i path di ricerca per le librerie shared native.

source: Automatic generation of file dependencies and support for parallel builds on most platforms.
it: Generazione automatica di dipendenze di file e supporto per build parallele sulla maggior parte delle piattaforme.

source: When developing cross-platform software, CMake provides a number of additional features:
it: Durante lo sviluppo di software cross-piattaforma, CMake offre una serie di funzionalità aggiuntive:

source: The ability to test for machine byte order and other hardware-specific characteristics.
it: La capacità di testare l'ordine dei byte della macchina e altre caratteristiche specifiche dell'hardware.

source: A single set of build configuration files that work on all platforms. This avoids the problem of developers having to maintain the same information in several different formats inside a project.
it: Un singolo set di file di configurazione della build che funzionano su tutte le piattaforme. Ciò evita il problema degli sviluppatori che devono mantenere le stesse informazioni in diversi formati all'interno di un progetto.

source: Support for building shared libraries on all platforms that support it.
it: Supporto per la creazione di librerie shared su tutte le piattaforme che lo supportano.

source: The ability to configure files with system-dependent information, such as the location of data files and other information. CMake can create header files that contain information such as paths to data files and other information in the form of ``#define`` macros. System specific flags can also be placed in configured header files. This has advantages over command line ``-D`` options to the compiler, because it allows other build systems to use the CMake built library without having to specify the exact same command line options used during the build.
it: La capacità di configurare i file con informazioni dipendenti dal sistema, come la posizione dei file di dati e altre informazioni. CMake può creare file header che contengono informazioni come path di file di dati e altre informazioni sotto forma di macro ``#define``. I flag specifici del sistema possono anche essere inseriti nei file header configurati. Ciò presenta dei vantaggi rispetto alle opzioni della riga di comando ``-D`` per il compilatore, poiché consente ad altri sistemi di build di utilizzare la libreria compilata di CMake senza dover specificare esattamente le stesse opzioni della riga di comando utilizzate durante la build.

source: The History of CMake
it: La Storia di CMake

source: Since 1999, CMake has been under active development and has matured to the point where it is a proven solution for a wide range of build issues. CMake development began as part of the `Insight Toolkit (ITK) <http://www.itk.org>`_, funded by the U.S. National Library of Medicine. ITK is a large software project that works on many platforms and can interact with many other software packages. To support this, a powerful, yet easy-to-use build tool was required. Having worked with build systems for large projects in the past, the developers designed CMake to address these needs. Since then CMake has continuously grown in popularity, with many projects and developers adopting it for its ease-of-use and flexibility. The most telling example of this is the successful adoption of CMake as the build system of the `K Desktop Environment (KDE) <https://kde.org>`_, arguably the largest open-source software project in existence.
it: Dal 1999, CMake è in fase di sviluppo attivo ed è maturato al punto da diventare una soluzione collaudata per un'ampia gamma di problemi di build. Lo sviluppo di CMake è iniziato come parte di `Insight Toolkit (ITK) <http://www.itk.org>`_, finanziato dalla statunitense "National Library of Medicine". ITK è un grande progetto software che funziona su molte piattaforme e può interagire con molti altri pacchetti software. Per supportarlo, era necessario uno strumento di build potente ma facile da usare. Avendo lavorato in passato con sistemi di build per progetti di grandi dimensioni, gli sviluppatori hanno progettato CMake per soddisfare queste esigenze. Da allora CMake è cresciuto costantemente in popolarità, con molti progetti e sviluppatori che lo adottano per la sua facilità d'uso e flessibilità. L'esempio più eloquente di ciò è l'adozione riuscita di CMake come sistema di build del `K Desktop Environment (KDE) <https://kde.org>`_, probabilmente il più grande progetto opensource esistente.

source: CMake also includes software testing support in the form of CTest. Part of the process of testing software involves building the software, possibly installing it, and determining what parts of the software are appropriate for the current system. This makes CTest a logical extension of CMake as it already has most of this information. In a similar vein, CMake contains CPack, which is designed to support cross-platform distribution of software. It provides a cross-platform approach to creating native installations for your software, making use of existing popular packages such as WiX, RPM, Cygwin, and PackageMaker.
it: CMake include anche il supporto per il test del software sotto forma di CTest. Parte del processo di test del software comporta la creazione del software, possibilmente l'installazione e la determinazione di quali parti del software sono appropriate per il sistema corrente. Ciò rende CTest un'estensione logica di CMake poiché dispone già della maggior parte di queste informazioni. Allo stesso modo, CMake contiene CPack, progettato per supportare la distribuzione cross-piattaforma del software. Fornisce un approccio multipiattaforma alla creazione di installazioni native per il software, facendo uso di pacchetti popolari esistenti come WiX, RPM, Cygwin e PackageMaker.

source: CMake continues to track and support popular build tools as they become available. CMake has quickly provided support for new versions of Microsofts's Visual Studio and Apple's Xcode IDE. In addition, support for the new build tool Ninja from Google has been added to CMake. With CMake, once you write your input files you get support for new compilers and build systems for free because the support for them is built into new releases of CMake and not tied to your software distribution. CMake also has ongoing support for cross-compiling to other operating systems or embedded devices. Most commands in CMake properly handle the differences between the host system and the target platform when cross-compiling.
it: CMake continua a monitorare e supportare gli strumenti di creazione più diffusi non appena diventano disponibili. CMake ha rapidamente fornito supporto per le nuove versioni di Visual Studio di Microsoft e Xcode IDE di Apple. Inoltre, a CMake è stato aggiunto il supporto per il nuovo strumento di compilazione Ninja di Google. Con CMake, una volta scritti i file di input, si ottiene supporto per nuovi compilatori e sistemi di compilazione gratuitamente perché il supporto per essi è integrato nelle nuove versioni di CMake e non è legato alla distribuzione del software. CMake offre anche un supporto continuo per la cross-compilazione con altri sistemi operativi o dispositivi embedded. La maggior parte dei comandi in CMake gestisce correttamente le differenze tra il sistema host e la piattaforma target durante la cross-compilazione.

source: Why Not Use Autoconf?
it: Perché Non Usare Autoconf?
