Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: Provides a macro that checks to see if a symbol is defined in a header file by taking three arguments with the first being the symbol to look for; the second argument being a list of header files to try including; and the third argument being where the result is stored. This macro uses ``CMAKE_REQUIRED_FLAGS`` and ``CMAKE_REQUIRED_LIBRARIES`` if they are set.
it: Fornisce una macro che verifica se un simbolo è definito in un file header prendendo tre argomenti, il primo dei quali è il simbolo da cercare; il secondo argomento è un elenco di file header da provare a includere; e il terzo argomento è dove è memorizzato il risultato. Questa macro utilizza ``CMAKE_REQUIRED_FLAGS`` e ``CMAKE_REQUIRED_LIBRARIES`` se sono impostate.

source: Provides a macro that determines the size in bytes of a variable type by taking two arguments with the first argument being the type to evaluate, and the second argument being where the result is stored. Both ``CMAKE_REQUIRED_FLAGS`` and ``CMAKE_REQUIRED_LIBRARIES`` are used if they are set.
it: Fornisce una macro che determina la dimensione in byte di un tipo di variabile prendendo due argomenti con il primo argomento che rappresenta il tipo da valutare e il secondo argomento dove viene archiviato il risultato. Sia ``CMAKE_REQUIRED_FLAGS`` e ``CMAKE_REQUIRED_LIBRARIES`` vengono utilizzati se impostati.

source: Provides a macro that checks to see if a global variable exists by taking two arguments with the first being the variable to look for, and the second argument being the variable to store the result in. This macro will prototype the named variable and then try to use it. If the test program compiles then the variable exists. This will only work for C variables. This macro uses ``CMAKE_REQUIRED_FLAGS`` and ``CMAKE_REQUIRED_LIBRARIES`` if they are set.
it: Fornisce una macro che controlla se esiste una variabile globale prendendo due argomenti, il primo è la variabile da cercare e il secondo è la variabile in cui memorizzare il risultato. Questa macro creerà il prototipo della variabile e poi tenterà di utilizzarla. Se il programma di test viene compilato, la variabile esiste. Funziona solo per le variabili C. Questa macro utilizza ``CMAKE_REQUIRED_FLAGS`` e ``CMAKE_REQUIRED_LIBRARIES`` se sono impostate.

source: Consider the following example which shows a variety of these modules being used to compute properties of the platform. At the beginning of the example four modules are loaded from CMake. The remainder of the example uses the macros defined in those modules to test for header files, libraries, symbols, and type sizes respectively.
it: Si consideri l'esempio seguente che mostra una varietà di questi moduli utilizzati per calcolare le proprietà della piattaforma. All'inizio dell'esempio vengono caricati quattro moduli da CMake. Il resto dell'esempio utilizza le macro definite in quei moduli per testare rispettivamente i file header, le librerie, i simboli e le dimensioni dei tipi.

source: How to Pass Parameters to a Compilation
it: Come Passare i Parametri a una Compilazione

source: Once you have determined the features of the system in which you are interested, it is time to configure the software based on what has been found. There are two common ways to pass this information to the compiler: on the compile line, or using a pre-configured header. The first way is to pass definitions on the compile line. A preprocessor definition can be passed to the compiler from a CMakeLists file with the :command:`target_compile_definitions` command. For example, a common practice in C code is to have the ability to selectively compile in/out debug statements.
it: Una volta determinate le caratteristiche del sistema, è il momento di configurare il software in base a quanto trovato. Esistono due modi comuni per passare queste informazioni al compilatore: sulla riga di compilazione o utilizzando header preconfigurato. Il primo modo consiste nel passare le definizioni sulla riga di compilazione. Una definizione del preprocessore può essere passata al compilatore da un file CMakeLists col comando :command:`target_compile_definitions`. Ad esempio, una pratica comune nel codice C è avere la possibilità di compilare selettivamente istruzioni di debug in/out.

source: A CMake variable could be used to turn on or off debug builds using the :command:`option` command:
it: Una variabile CMake potrebbe essere utilizzata per attivare o disattivare le build di debug utilizzando il comando :command:`option`:

source: Another example would be to tell the compiler the result of the previous ``HAS_FOOBAR_CALL`` test that was discussed earlier in this chapter. You could do this with the following:
it: Un altro esempio potrebbe essere quello di comunicare al compilatore il risultato del precedente test ``HAS_FOOBAR_CALL`` discusso in precedenza in questo capitolo. Lo si può fare in questo modo:

source: How to Configure a Header File
it: Come Configurare un file Header

source: The second approach for passing definitions to the source code is to configure a header file. The header file will include all of the ``#define`` macros needed to build the project. To configure a file with CMake, the :command:`configure_file` command is used. This command requires an input file that is parsed by CMake to produce an output file with all variables expanded or replaced. There are three ways to specify a variable in an input file for :command:`configure_file`.
it: Il secondo approccio per passare le definizioni al codice sorgente consiste nel configurare un file di header. Il file di intestazione includerà tutte le macro ``#define`` necessarie per la build del progetto. Per configurare un file con CMake, viene utilizzato il comando :command:`configure_file`. Questo comando richiede un file di input che viene analizzato da CMake per produrre un file di output con tutte le variabili espanse o sostituite. Ci sono tre modi per specificare una variabile in un file di input per :command:`configure_file`.

source: If VARIABLE is true, then the result will be:
it: Se VARIABLE è true, allora il risultato sarà:

source: If VARIABLE is false, then the result will be:
it: Se VARIABLE è false, allora il risultato sarà:

source: When writing a file to be configured, consider using ``@VARIABLE@`` instead of ``${VARIABLE}`` for variables that are expected to be expanded by CMake. Since the ``${}`` syntax is commonly used by other languages, users can tell the :command:`configure_file` command to only expand variables using the ``@var@`` syntax by passing the ``@ONLY`` option to the command; this is useful if you are configuring a script that may contain ``${var}`` strings that you want to preserve. This is important because CMake will replace all occurrences of ``${var}`` with the empty string if ``var`` is not defined in CMake.
it: Quando si scrive un file da configurare, si prende in considerazione l'utilizzo di ``@VARIABLE@`` invece di ``${VARIABLE}`` per le variabili che dovrebbero essere espanse da CMake. Poiché la sintassi ``${}`` è comunemente usata da altri linguaggi, gli utenti possono dire al comando :command:`configure_file` di espandere solo le variabili usando la sintassi ``@var@`` passando l'opzione ``@ONLY`` al comando; questo è utile se si sta configurando uno script che può contenere stringhe ``${var}`` da preservare. Questo è importante perché CMake sostituirà tutte le occorrenze di ``${var}`` con la stringa vuota se ``var`` non è definita in CMake.

source: The following example configures a .h file for a project that contains preprocessor variables. The first definition indicates if the ``FOOBAR`` call exists in the library, and the next one contains the path to the build tree.
it: L'esempio seguente configura un file .h per un progetto che contiene variabili del preprocessore. La prima definizione indica se la chiamata ``FOOBAR`` esiste nella libreria e la successiva contiene il path dell'albero di build.

source: It is important to configure files into the binary tree, not the source tree. A single source tree may be shared by multiple build trees or platforms. By configuring files into the binary tree the differences between builds or platforms will be kept isolated in the build tree and will not corrupt other builds. This means that you will need to include the directory of the build tree where you configured the header file into the project's list of include directories using the :command:`target_include_directories` command.
it: È importante configurare i file nell'albero binario, non nell'albero dei sorgenti. Un singolo albero di sorgenti può essere condiviso da più alberi di build o di piattaforme. Configurando i file nell'albero binario, le differenze tra build o tra piattaforme verranno mantenute isolate nell'albero della build e non danneggeranno altre build. Ciò significa che si devono includere la directory dell'albero di build in cui è stato configurato il file header nell'elenco delle directory di inclusione del progetto utilizzando il comando :command:`target_include_directories`.

source: Testing With CMake and CTest
it: Test con CMake e CTest

source: Testing is a key tool for producing and maintaining robust, valid software. This chapter will examine the tools that are part of CMake to support software testing. We will begin with a brief discussion of testing approaches, and then discuss how to add tests to your software project using CMake.
it: Il test è uno strumento essenziale per la produzione e la manutenzione di software robusto e valido. Questo capitolo esaminerà gli strumenti che fanno parte di CMake per supportare il test del software. Inizieremo con una breve discussione sugli approcci ai test, quindi discuteremo su come aggiungere test al progetto utilizzando CMake.

source: The tests for a software package may take a number of forms. At the most basic level there are smoke tests, such as one that simply verifies that the software compiles. While this may seem like a simple test, with the wide variety of platforms and configurations available, smoke tests catch more problems than any other type of test. Another form of smoke test is to verify that a test runs without crashing. This can be handy for situations where the developer does not want to spend the time creating more complex tests, but is willing to run some simple tests. Most of the time these simple tests can be small example programs. Running them verifies not only that the build was successful, but that any required shared libraries can be loaded (for projects that use them), and that at least some of the code can be executed without crashing.
it: I test per un pacchetto software possono assumere diverse forme. Al livello più elementare ci sono gli "smoke test", come quello che verifica semplicemente che il software venga compilato. Anche se questo può sembrare un test semplice, con l'ampia varietà di piattaforme e configurazioni disponibili, gli "smoke test" rilevano più problemi di qualsiasi altro tipo di test. Un'altra forma di "smoke test" consiste nel verificare che un test venga eseguito senza arresti anomali. Questo può risultare utile per le situazioni in cui lo sviluppatore non vuole dedicare tempo alla creazione di test più complessi, ma è disposto a eseguirne alcuni semplici. Il più delle volte questi semplici test possono essere piccoli programmi di esempio. Eseguendoli si verifica non solo che la compilazione sia andata a buon fine, ma che tutte le librerie condivise richieste possano essere caricate (per i progetti che le utilizzano) e che almeno una parte del codice possa essere eseguita senza crash.

source: Moving beyond basic smoke tests leads to more specific tests such as regression, black-, and white-box testing. Each of these has its strengths. Regression testing verifies that the results of a test do not change over time or platform. This is very useful when performed frequently, as it provides a quick check that the behavior and results of the software have not changed. When a regression test fails, a quick look at recent code changes can usually identify the culprit. Unfortunately, regression tests typically require more effort to create than other tests.
it: Andare oltre gli "smoke test" di base porta a test più specifici come quelli di regressione, black-box e white-box. Ognuno di questi ha i suoi punti di forza. Il test di regressione verifica che i risultati di un test non cambino nel tempo o tra le piattaforme. Questo è molto utile se eseguito frequentemente, in quanto fornisce un rapido controllo che il comportamento e i risultati del software non sono cambiati. Quando un test di regressione fallisce, una rapida occhiata alle recenti modifiche al codice può in genere identificare il colpevole. Sfortunatamente, i test di regressione in genere richiedono uno sforzo maggiore per la creazione rispetto ad altri test.

source: White- and black-box testing refer to tests written to exercise units of code (at various levels of integration), with and without knowledge of how those units are implemented respectively. White-box testing is designed to stress potential failure points in the code knowing how that code was written, and hence its weaknesses. As with regression testing, this can take a substantial amount of effort to create good tests. Black-box testing typically knows little or nothing about the implementation of the software other than its public API. Black-box testing can provide a lot of code coverage without too much effort in developing the tests. This is especially true for libraries of object oriented software where the APIs are well defined. A black-box test can be written to go through and invoke a number of typical methods on all the classes in the software.
it: I test white- e black- box si riferiscono a test scritti per testare unità di codice (a vari livelli di integrazione), con e senza conoscenza di come tali unità sono rispettivamente implementate. Il test white-box è progettato per evidenziare potenziali punti di errore nel codice sapendo come quel codice è stato scritto e quindi i suoi punti deboli. Come per i test di regressione, questo può richiedere uno sforzo notevole per creare buoni test. I test black-box in genere sanno poco o nulla sull'implementazione del software oltre alla sua API pubblica. I test black-box possono fornire molta copertura del codice senza troppi sforzi nello sviluppo dei test. Ciò è particolarmente vero per le librerie di software orientato agli oggetti in cui le API sono ben definite. È possibile scrivere un test black-box per eseguire e richiamare una serie di metodi tipici su tutte le classi del software.

source: The final type of testing we will discuss is software standard compliance testing. While the other test types we have discussed are focused on determining if the code works properly, compliance testing tries to determine if the code adheres to the coding standards of the software project. This could be a check to verify that all classes have implemented some key method, or that all functions have a common prefix. The options for this type of test are limitless and there are a number of ways to perform such testing. There are software analysis tools that can be used, or specialized test programs (maybe python scripts etc) could be written. The key point to realize is that the tests do not necessarily have to involve running some part of the software. The tests might run some other tool on the source code itself.
it: L'ultimo tipo di test che discuteremo è quello di conformità agli standard del software. Mentre gli altri tipi di test che discussi sono incentrati sulla determinazione del corretto funzionamento del codice, quelli di conformità tentano di determinare se il codice aderisce agli standard di codifica del progetto. Questo potrebbe essere un controllo per verificare che tutte le classi abbiano implementato un metodo chiave o che tutte le funzioni abbiano un prefisso comune. Le opzioni per questo tipo di test sono illimitate e ci sono diversi modi per eseguire tale test. Esistono strumenti di analisi del software utilizzabili o potrebbero essere scritti programmi di test specializzati (forse script Python ecc.). Il punto chiave da comprendere è che i test non devono necessariamente comportare l'esecuzione di certe parti del software. I test potrebbero eseguire qualche altro strumento sul codice sorgente stesso.

source: There are a number of reasons why it helps to have testing support integrated into the build process. First, complex software projects may have a number of configuration or platform-dependent options. The build system knows what options can be enabled and can then enable the appropriate tests for those options. For example, the Visualization Toolkit (VTK) includes support for a parallel processing library called MPI. If VTK is built with MPI support then additional tests are enabled that make use of MPI and verify that the MPI-specific code in VTK works as expected. Secondly, the build system knows where the executables will be placed, and it has tools for finding other required executables (such as perl, python etc). The third reason is that with UNIX Makefiles it is common to have a test target in the Makefile so that developers can type make test and have the test(s) run. In order for this to work, the build system must have some knowledge of the testing process.
it: Esistono diversi motivi per cui è utile avere il supporto per i test, integrato nel processo di build. In primo luogo, i progetti complessi possono avere una serie di opzioni di configurazione o dipendenze dalla piattaforma. Il sistema di build sa quali opzioni possono essere abilitate e può quindi abilitare i test appropriati per tali opzioni. Ad esempio, il Visualization Toolkit (VTK) include il supporto per una libreria di elaborazione parallela denominata MPI. Se VTK viene creato con il supporto MPI, vengono abilitati test aggiuntivi che utilizzano MPI e verificano che il codice specifico di MPI in VTK funzioni come previsto. In secondo luogo, il sistema di build sa dove verranno posizionati gli eseguibili e dispone di strumenti per trovare gli altri eseguibili richiesti (come perl, python ecc.). La terza ragione è che con i Makefile UNIX è normale avere un target test nel Makefile in modo che gli sviluppatori possano digitare make test e far eseguire i test. Affinché funzioni, il sistema di build deve avere una certa conoscenza del processo di test.

source: How Does CMake Facilitate Testing?
it: In Che Modo CMake Facilita i Test?

source: CMake facilitates testing your software through special testing commands and the :manual:`CTest <ctest(1)>` executable. First, we will discuss the key testing commands in CMake. To add testing to a CMake-based project, simply :command:`include(CTest)` and use the :command:`add_test` command. The :command:`add_test` command has a simple syntax as follows:
it: CMake facilita il test del software tramite speciali comandi di test e l'eseguibile :manual:`CTest <ctest(1)>`. Innanzitutto, discuteremo i principali comandi di test in CMake. Per aggiungere test a un progetto basato su CMake, semplicemente :command:`include(CTest)` e si usa il comando :command:`add_test`. Il comando :command:`add_test` ha una sintassi semplice come questa:

source: The first argument is simply a string name for the test. This is the name that will be displayed by testing programs. The second argument is the executable to run. The executable can be built as part of the project or it can be a standalone executable such as python, perl, etc. The remaining arguments will be passed to the running executable. A typical example of testing using the :command:`add_test` command would look like this:
it: Il primo argomento è semplicemente un nome di stringa per il test. Questo è il nome che verrà visualizzato dai programmi di test. Il secondo argomento è l'eseguibile da eseguire. L'eseguibile può essere compilato come parte del progetto o può essere un eseguibile standalone come python, perl, ecc. Gli argomenti rimanenti verranno passati all'eseguibile in esecuzione. Un tipico esempio di test col comando :command:`add_test` sarebbe simile a questo:

source: The :command:`add_test` command is typically placed in the CMakeLists file for the directory that has the test in it. For large projects, there may be multiple CMakeLists files with :command:`add_test` commands in them. Once the :command:`add_test` commands are present in the project, the user can run the tests by invoking the "test" target of Makefile, or the ``RUN_TESTS`` target of Visual Studio or Xcode. An example of running tests on the CMake tests using the Makefile generator on Linux would be::
it: Il comando :command:`add_test` viene solitamente inserito nel file CMakeLists per la directory che contiene il test. Per progetti di grandi dimensioni, potrebbero esserci più file CMakeLists con comandi :command:`add_test` al loro interno. Una volta che i comandi :command:`add_test` sono presenti nel progetto, l'utente può eseguire i test richiamando il target "test" di Makefile o il target ``RUN_TESTS`` di Visual Studio o Xcode. Un esempio di esecuzione sui test CMake utilizzando il generatore di Makefile su Linux potrebbe essere::

source: Additional Test Properties
it: Ulteriori proprietà dei Test

source: By default a test passes if all of the following conditions are true:
it: Per default, un test viene superato se tutte le seguenti condizioni sono vere:

source: The test executable was found
it: L'eseguibile da testare è stato trovato

source: The test ran without exception
it: Il test è stato eseguito senza eccezioni

source: The test exited with return code 0
it: Il test è terminato con codice di ritorno 0

source: That said, these behaviors can be modified using the :command:`set_property` command:
it: Detto questo, tali comportamenti possono essere modificati usando il comando :command:`set_property`:

source: This command will set additional properties for the specified tests. Example properties are:
it: Questo comando imposterà proprietà aggiuntive per i test specificati. Esempi di proprietà sono:

source: Specifies environment variables that should be defined for running a test. If set to a list of environment variables and values of the form ``MYVAR=value``, those environment variables will be defined while the test is running. The environment is restored to its previous state after the test is done.
it: Specifica le variabili di ambiente che devono essere definite per l'esecuzione di un test. Se impostato su un elenco di variabili di ambiente e valori nel formato ``MYVAR=value``, tali variabili di ambiente verranno definite durante l'esecuzione del test. L'ambiente viene ripristinato allo stato precedente al termine del test.

source: Specifies a list of text labels associated with a test. These labels can be used to group tests together based on what they test. For example, you could add a label of MPI to all tests that exercise MPI code.
it: Specifica un elenco di etichette di testo associate a un test. Queste etichette possono essere utilizzate per raggruppare i test in base a ciò che testano. Ad esempio, è possibile aggiungere un'etichetta MPI a tutti i test che utilizzano il codice MPI.

source: If this option is set to true, then the test will pass if the return code is not 0, and fail if it is. This reverses the third condition of the pass requirements.
it: Se questa opzione è impostata su true, allora il test passerà se il codice di ritorno non è 0, e fallirà se lo è. Questo inverte la terza condizione dei requisiti di superamento del test.
