Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: The CMakeLists files (actually ``CMakeLists.txt`` but it is common to leave off the extension) are plain text files that contain the project description in CMake's Language. The :manual:`cmake-language <cmake-language(7)>` is expressed as a series of comments, commands and variables. You might wonder why CMake decided to have its own language instead of using an existing one such as Python, Java, or Tcl. The main reason is that CMake developers did not want to make CMake require an additional tool to run. By requiring one of these other languages, all users of CMake would be required to have that language installed, and potentially a specific version of that language. This is on top of the language extensions that would be required to do some of the CMake work, for both performance and capability reasons.
it: I file CMakeLists (in realtà ``CMakeLists.txt`` ma di solito si tralascia l'estensione) sono file di semplice testo che contengono la descrizione del progetto nel linguaggio di CMake. Il :manual:`cmake-language <cmake-language(7)>` è espresso come una serie di commenti, comandi e variabili. Si si potrebbe chiedere perché CMake ha deciso di avere il proprio linguaggio invece di usarne uno esistente come Python, Java o Tcl. Il motivo principale è che gli sviluppatori di CMake non volevano che CMake richiedesse uno strumento aggiuntivo per l'esecuzione. Richiedendo uno di questi altri linguaggi, tutti gli utenti di CMake dovrebbero avere tale linguaggio installato e potenzialmente una versione specifica. Questo è in cima alle estensioni del linguaggio che sarebbero necessarie per eseguire parte del lavoro di CMake, sia per motivi di prestazioni che di capacità.

source: Hello World for CMake
it: Lo "Hello World" di CMake

source: To begin, let us consider the simplest possible CMakeLists file. To compile an executable from one source file, the CMakeLists file would contain three lines:
it: Per iniziare, consideriamo il file CMakeLists più semplice possibile. Per compilare un eseguibile da un file sorgente, il file CMakeLists conterrebbe tre righe:

source: The first line of the top level CMakeLists file should always be :command:`cmake_minimum_required`. This allows projects to require a given version of CMake and, in addition, allows CMake to be backwards compatible.
it: La prima riga del file CMakeLists di primo livello dovrebbe essere sempre :command:`cmake_minimum_required`. Ciò consente ai progetti di richiedere una determinata versione di CMake e, inoltre, consente a CMake di essere compatibile con le versioni precedenti.

source: The next line of any top level CMakeLists file should be the :command:`project` command. This command sets the name of the project and may specify other options such as language or version.
it: La riga successiva di qualsiasi file CMakeLists di primo livello dovrebbe essere il comando :command:`project`. Questo comando imposta il nome del progetto e può specificare altre opzioni come il linguaggio o la versione.

source: For each directory in a project where the CMakeLists.txt file invokes the :command:`project` command, CMake generates a top-level Makefile or IDE project file. The project will contain all targets that are in the CMakeLists.txt file and any subdirectories, as specified by the :command:`add_subdirectory` command. If the :prop_dir:`EXCLUDE_FROM_ALL` option is used in the :command:`add_subdirectory` command, the generated project will not appear in the top-level Makefile or IDE project file; this is useful for generating sub-projects that do not make sense as part of the main build process. Consider that a project with a number of examples could use this feature to generate the build files for each example with one run of CMake, but not have the examples built as part of the normal build process.
it: Per ogni directory in un progetto in cui il file CMakeLists.txt richiama il comando :command:`project`, CMake genera un Makefile di primo livello o un file di progetto IDE. Il progetto conterrà tutti i target che si trovano nel file CMakeLists.txt e tutte le sottodirectory, come specificato dal comando :command:`add_subdirectory`. Se l'opzione :prop_dir:`EXCLUDE_FROM_ALL` è usata nel comando :command:`add_subdirectory`, il progetto generato non apparirà nel Makefile di primo livello o nel file di progetto IDE; questo è utile per generare sottoprogetti che non hanno senso come parte del processo di build principale. Si consideri che un progetto con un numero di esempi potrebbe utilizzare questa funzione per generare i file di build per ogni esempio con un'esecuzione di CMake, ma non avere gli esempi compilati come parte del normale processo di compilazione.

source: Finally, use the :command:`add_executable` command to add an executable to the project using the given source file.
it: Infine, c'è il comando :command:`add_executable` per aggiungere un eseguibile al progetto utilizzando il file sorgente specificato.

source: In this example, there are two files in the source directory: ``CMakeLists.txt`` and ``Hello.c``.
it: In questo esempio, ci sono due file nella directory dei sorgenti: ``CMakeLists.txt`` e ``Hello.c``.

source: The next sections will describe how to configure and build the project using the CMake GUI and command line interfaces.
it: Le sezioni successive descriveranno come configurare e creare il progetto utilizzando la GUI di CMake e le interfacce a riga di comando.

source: Configure and Generate
it: Configurare e Generare

source: After a CMakeLists file has been created, CMake processes the text file and creates entries in a cache file. Users may edit the CMakeLists file or specify cache values with the CMake gui or ccmake and re-configure. Next, CMake uses the cache entries to generate a project in the user's desired build system (e.g. Makefile or Visual Studio solution).
it: Dopo che un file CMakeLists è stato creato, CMake elabora il file di testo e crea le voci in un file di cache. Gli utenti possono modificare il file CMakeLists o specificare i valori della cache con l'interfaccia grafica di CMake o ccmake e riconfigurare. Successivamente, CMake utilizza le voci della cache per generare un progetto nel sistema di build desiderato dall'utente (ad es. Makefile o soluzione Visual Studio).

source: Running the CMake GUI
it: Esecuzione della GUI di CMake

source: CMake includes a Qt-based user interface that can be used on most platforms, including UNIX, Mac OS X, and Windows. The :manual:`cmake-gui <cmake-gui(1)>` is included in the CMake source code, but you will need an installation of Qt on your system in order to build it.
it: CMake include un'interfaccia utente basata su Qt utilizzabile sulla maggior parte delle piattaforme, inclusi UNIX, Mac OS X e Windows. La :manual:`cmake-gui <cmake-gui(1)>` è inclusa nel codice sorgente di CMake, ma c'è bisogno di un'installazione di Qt sul sistema per compilarla.

source: Qt based CMake GUI
it: La GUI CMake basata su Qt

source: On Windows, the executable is named ``cmake-gui.exe`` and it should be in your Start menu under Program Files. There may also be a shortcut on your desktop, or if you built CMake from the source, it will be in the build directory. For UNIX and Mac users, the executable is named ``cmake-gui`` and it can be found where you installed the CMake executables. A GUI will appear similar to what is shown in Figure :num:`figure-QtbasedCMakeGUI`. The top two fields are the source code and binary directories. They allow you to specify where the source code is located for what you want to compile, and where the resulting binaries should be placed. You should set these two values first. If the binary directory you specify does not exist, it will be created for you. If the binary directory has been configured by CMake before, it will then automatically set the source tree.
it: Su Windows, l'eseguibile si chiama ``cmake-gui.exe`` e dovrebbe trovarsi nel menù Start sotto Programmi. Potrebbe anche esserci un collegamento sul desktop o, se CMake è stato creato dai sorgenti, sarà nella directory di build. Per gli utenti UNIX e Mac, l'eseguibile si chiama ``cmake-gui`` e si trova dove sono installati gli eseguibili di CMake. Apparirà una GUI simile a quella mostrata in Figura :num:`figure-QtbasedCMakeGUI`. I primi due campi sono il codice sorgente e le directory dei file binari. Consentono di specificare dove si trova il codice sorgente per ciò che si desidera compilare e dove devono essere posizionati i binari risultanti. Si devono impostare per primi questi valori. Se la directory binaria specificata non esiste, verrà creata. Se la directory dei binari è stata configurata in precedenza da CMake, imposterà automaticamente l'albero dei sorgenti.

source: Running the ccmake Curses Interface
it: Esecuzione di ccmake con l'Interfaccia di Curses

source: On most UNIX platforms, if the curses library is supported, CMake provides an executable called :manual:`ccmake <ccmake(1)>`. This interface is a terminal-based text application that is very similar to the :manual:`cmake-gui <cmake-gui(1)>`. To run :manual:`ccmake <ccmake(1)>`, change directories into the directory where you want the binaries to be placed. Then run :manual:`ccmake <ccmake(1)>` with the path to the source directory on the command line. This will start the text interface as shown in Figure :num:`figure-ccmakerunningonUNIX`.
it: Sulla maggior parte delle piattaforme UNIX, se la libreria curses è supportata, CMake fornisce un eseguibile chiamato :manual:`ccmake <ccmake(1)>`. Questa interfaccia è un'applicazione testuale basata su terminale, molto simile a :manual:`cmake-gui <cmake-gui(1)>`. Per eseguire :manual:`ccmake <ccmake(1)>`, cambiare le directory in quella in cui si desidera posizionare i file binari. Poi eseguire :manual:`ccmake <ccmake(1)>` con il path della directory dei sorgenti sulla riga di comando. Questo avvierà l'interfaccia testuale come mostrato in Figura :num:`figure-ccmakerunningonUNIX`.

source: ccmake running on UNIX
it: ccmake in esecuzione su UNIX

source: Brief instructions are displayed in the bottom of the window. If you hit the "c" key, it will configure the project. You should always configure after changing values in the cache. To change values, use the arrow keys to select cache entries, and hit the enter key to edit them. Boolean values will toggle with the enter key. Once you have set all the values as you like, you can hit the "g" key to generate the Makefiles and exit. You can also hit "h" for help, "q" to quit, and "t" to toggle the viewing of advanced cache entries.
it: Delle brevi istruzioni vengono visualizzate nella parte inferiore della finestra. Premendo il tasto "c", si configurerà il progetto. Si deve sempre configurare dopo aver modificato i valori nella cache. Per modificare i valori, utilizzare i tasti freccia per selezionare le voci della cache e premere il tasto Invio per modificarle. I valori booleani verranno scambiati con il tasto Invio. Una volta impostati tutti i valori, si preme il tasto "g" per generare i Makefile ed uscire. Si può anche premere "h" per l'help, "q" per uscire e "t" per attivare o disattivare la visualizzazione delle voci avanzate della cache.

source: Running CMake from the Command Line
it: Esecuzione di CMake da Riga di Comando

source: From the command line, the :manual:`cmake <cmake(1)>` executable can be used to generate a project buildsystem. This is best suited for projects with few or no options. For larger projects like VTK, using :manual:`ccmake <ccmake(1)>`, or the :manual:`cmake-gui <cmake-gui(1)>` is recommended. To build a project with :manual:`cmake <cmake(1)>`, first create and change directory to where you want the binaries to be placed. Run :manual:`cmake <cmake(1)>` specifying the path to the source tree and pass in any options using the ``-D`` flag. Unlike :manual:`ccmake <ccmake(1)>`, or the :manual:`cmake-gui <cmake-gui(1)>`, the configure and generate steps are combined into one when using the :manual:`cmake <cmake(1)>` executable.
it: Dalla riga di comando, l'eseguibile :manual:`cmake <cmake(1)>` è utilizzabile per generare un sistema di compilazione del progetto. Questo è adatto per progetti con poche o nessuna opzione. Per progetti più grandi come VTK, si consiglia di utilizzare :manual:`ccmake <ccmake(1)>` o :manual:`cmake-gui <cmake-gui(1)>`. Per creare un progetto con :manual:`cmake <cmake(1)>`, prima si crea e si modifica la directory in cui si desidera posizionare i file binari. Si esegue :manual:`cmake <cmake(1)>` specificando il path dell'alberatura dei sorgenti e si passa qualsiasi opzione usando il flag ``-D``. A differenza di :manual:`ccmake <ccmake(1)>`, o di :manual:`cmake-gui <cmake-gui(1)>`, i passaggi di configurazione e generazione sono combinati in uno solo quando si usa l'eseguibile :manual:`cmake <cmake(1)>`.

source: Specifying the Compiler to CMake
it: Specificare il compilatore per CMake

source: On some systems, you may have more than one compiler to choose from or your compiler may be in a non-standard place. In these cases, you will need to specify to CMake where your desired compiler is located. There are three ways to specify this: the generator can specify the compiler; an environment variable can be set; or a cache entry can be set. Some generators are tied to a specific compiler; for example, the Visual Studio 19 generator always uses the Microsoft Visual Studio 19 compiler. For Makefile-based generators, CMake will try a list of usual compilers until it finds a working one.
it: Su alcuni sistemi, si potrebbero avere più di un compilatore tra cui scegliere o il compilatore potrebbe trovarsi in una posizione non standard. In questi casi, si dovrà specificare a CMake dove si trova il compilatore desiderato. Ci sono tre modi per farlo: il generatore può specificare il compilatore; è possibile impostare una variabile d'ambiente; oppure è possibile impostare una voce della cache. Alcuni generatori sono legati a un compilatore specifico; ad esempio, il generatore di Visual Studio 19 utilizza sempre il compilatore Microsoft Visual Studio 19. Per i generatori basati su Makefile, CMake proverà un elenco di compilatori soliti fino a quando non ne troverà uno funzionante.

source: The lists can be preempted with environment variables that can be set before CMake is run. The ``CC`` environment variable specifies the C compiler, while ``CXX`` specifies the C++ compiler. You can specify the compilers directly on the command line by using ``-DCMAKE_CXX_COMPILER=cl`` for example. Once :manual:`cmake <cmake(1)>` has been run and picked a compiler, if you wish to change the compiler, start over with an empty binary directory.
it: Gli elenchi possono essere superati con variabili di ambiente impostabili prima dell'esecuzione di CMake. La variabile d'ambiente ``CC`` specifica il compilatore C, mentre ``CXX`` specifica quello C++. Si possono specificare i compilatori direttamente sulla riga di comando usando ``-DCMAKE_CXX_COMPILER=cl`` per esempio. Una volta che :manual:`cmake <cmake(1)>` è stato eseguito e si è scelto un compilatore, se si desidera cambiare il compilatore, si ricomincia daccapo con una directory binaria vuota.

source: The flags for the compiler and the linker can also be changed by setting environment variables. Setting ``LDFLAGS`` will initialize the cache values for link flags, while ``CXXFLAGS`` and ``CFLAGS`` will initialize ``CMAKE_CXX_FLAGS`` and ``CMAKE_C_FLAGS`` respectively.
it: I flag per il compilatore e il linker possono anche essere modificati impostando le variabili di ambiente. L'impostazione ``LDFLAGS`` inizializzerà i valori della cache per i flag dei link, mentre ``CXXFLAGS`` e ``CFLAGS`` inizializzeranno ``CMAKE_CXX_FLAGS`` e ``CMAKE_C_FLAGS`` rispettivamente.

source: Build Configurations
it: Configurazioni della Build

source: Build configurations allow a project to be built in different ways for debug, optimized, or any other special set of flags. CMake supports, by default, Debug, Release, MinSizeRel, and RelWithDebInfo configurations. Debug has the basic debug flags turned on. Release has the basic optimizations turned on. MinSizeRel has flags that produce the smallest object code, but not necessarily the fastest code. RelWithDebInfo builds an optimized build with debug information as well.
it: Le configurazioni della build consentono di creare un progetto in modi diversi per il debug, per l'ottimizzazione o per qualsiasi altro set speciale di flag. CMake supporta, per default, le configurazioni Debug, Release, MinSizeRel e RelWithDebInfo. Debug ha i flag di debug di base attivati. Release ha le ottimizzazioni di base attivate. MinSizeRel ha flag che producono il codice oggetto più piccolo, ma non necessariamente quello più veloce. RelWithDebInfo crea una build ottimizzata anche con informazioni di debug.

source: CMake handles the configurations in slightly different ways depending on the generator being used. The conventions of the native build system are followed when possible. This means that configurations impact the build in different ways when using Makefiles versus using Visual Studio project files.
it: CMake gestisce le configurazioni in modi leggermente diversi a seconda del generatore utilizzato. Quando possibile, vengono seguite le convenzioni del sistema di build nativo. Ciò significa che le configurazioni influiscono sulla build in modi diversi quando si usano i Makefile rispetto ai file di progetto di Visual Studio.

source: The Visual Studio IDE supports the notion of Build Configurations. A default project in Visual Studio usually has Debug and Release configurations. From the IDE you can select build Debug, and the files will be built with Debug flags. The IDE puts all of the binary files into directories with the name of the active configuration. This brings about an extra complexity for projects that build programs that need to be run as part of the build process from custom commands. See the :variable:`CMAKE_CFG_INTDIR` variable and the custom commands section for more information about how to handle this issue. The variable :variable:`CMAKE_CONFIGURATION_TYPES` is used to tell CMake which configurations to put in the workspace.
it: L'IDE di Visual Studio supporta la nozione di Build Configuration. Un progetto di default in Visual Studio ha in genere configurazioni di Debug e di Release. Dall'IDE è possibile selezionare build Debug e i file verranno compilati con i flag Debug. L'IDE inserisce tutti i file binari nelle directory con il nome della configurazione attiva. Ciò comporta un'ulteriore complessità per i progetti che compilano programmi che devono essere eseguiti come parte del processo di build da comandi personalizzati. Consultare la variabile :variable:`CMAKE_CFG_INTDIR` e la sezione dei comandi personalizzati per ulteriori informazioni su come gestire questo problema. La variabile :variable:`CMAKE_CONFIGURATION_TYPES` viene utilizzata per indicare a CMake quali configurazioni inserire nell'area di lavoro [workspace].

source: With Makefile-based generators, only one configuration can be active at the time CMake is run, and it is specified with the :variable:`CMAKE_BUILD_TYPE` variable. If the variable is empty then no flags are added to the build. If the variable is set to the name of a configuration, then the appropriate variables and rules (such as ``CMAKE_CXX_FLAGS_<ConfigName>``) are added to the compile lines. Makefiles do not use special configuration subdirectories for object files. To build both debug and release trees, the user is expected to create multiple build directories using the out-of-source build feature of CMake, and set the :variable:`CMAKE_BUILD_TYPE` to the desired selection for each build. For example:
it: Con i generatori basati su Makefile, solo una configurazione può essere attiva al momento dell'esecuzione di CMake ed è specificata con la variabile :variable:`CMAKE_BUILD_TYPE`. Se la variabile è vuota, non vengono aggiunti flag alla build. Se la variabile è impostata sul nome di una configurazione, le variabili e le regole appropriate (come ``CMAKE_CXX_FLAGS_<ConfigName>``) vengono aggiunte alle righe di compilazione. I makefile non usano sottodirectory di configurazione speciali per i file oggetto. Per creare alberature di debug e release, l'utente deve creare più directory di build utilizzando la funzionalità di build out-of-source di CMake e impostare :variable:`CMAKE_BUILD_TYPE` sulla selezione desiderata per ogni build. Per esempio:

source: Building Your Project
it: Building del Progetto

source: After you have run CMake, your project will be ready to be built. If your target generator is based on Makefiles then you can build your project by changing the directory to your binary tree and typing make (or gmake or nmake as appropriate). If you generated files for an IDE such as Visual Studio, you can start your IDE, load the project files into it, and build as you normally would.
it: Dopo aver eseguito CMake, il progetto sarà pronto per il building. Se il generatore target è basato su Makefile, si può creare il progetto cambiando la directory nell'albero binario e digitando make (o gmake o nmake a seconda dei casi). Se è stato generato un file per un IDE come Visual Studio, si avviare l'IDE, caricarvi i file di progetto e compilare come si farebbe normalmente.

source: Another option is to use :manual:`cmake <cmake(1)>`'s ``--build`` option from the command line. This option is simply a convenience that allows you to build your project from the command line, even if that requires launching an IDE.
it: Un'altra possibilità è quella di usare l'opzione di :manual:`cmake <cmake(1)>` ``--build`` dalla riga di comando. Questa opzione è semplicemente una comodità che consente di creare il progetto dalla riga di comando, anche se ciò richiede l'avvio di un IDE.

source: That is all there is to installing and running CMake for simple projects. In the following chapters, we will consider CMake in more detail and explain how to use it on more complex software projects.
it: Questo è tutto ciò che serve per installare ed eseguire CMake per progetti semplici. Nei capitoli seguenti considereremo CMake in modo più dettagliato e spiegheremo come utilizzarlo su progetti software più complessi.

source: Installing Files
it: Installazione di File
