Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: You can find all of the variables that CMake could not determine, from which CMake file they were called, the source file, the arguments for the executable, and the path to the executable. CMake will also copy the executables to the build directory; they have the names ``cmTryCompileExec-<name of the variable>``, e.g. in this case ``cmTryCompileExec-SHARED_LIBRARY_PATH_TYPE``. You can then try to run this executable manually on the actual target platform and check the results.
it: Si possono trovare tutte le variabili che CMake non è stato in grado di determinare, da quale file CMake sono state chiamate, il file sorgente, gli argomenti per l'eseguibile e il path dell'eseguibile. CMake copierà anche gli eseguibili nella directory di build; hanno i nomi ``cmTryCompileExec-<nome della variabile>``, ad es. in questo caso ``cmTryCompileExec-SHARED_LIBRARY_PATH_TYPE``. Si può quindi provare a eseguire questo eseguibile manualmente sulla piattaforma target effettiva e controllare i risultati.

source: Once you have these results, they have to be put into the CMake cache. This can be done by using ccmake or cmake-gui. and editing the variables directly in the cache. It is not possible to reuse these changes in another build directory or if CMakeCache.txt is removed.
it: Una volta ottenuti questi risultati, devono essere inseriti nella cache di CMake. Questo può essere fatto usando ccmake o cmake-gui, e modificando le variabili direttamente nella cache. Non è possibile riutilizzare queste modifiche in un'altra directory di build o se CMakeCache.txt viene rimosso.

source: The recommended approach is to use the TryRunResults.cmake file created by CMake. You should copy it to a safe location (i.e. where it will not be removed if the build directory is deleted) and give it a useful name, e.g. TryRunResults-MyProject-eldk-ppc.cmake. The contents of this file have to be edited so that the set commands set the required variables to the appropriate values for the target system. This file can then be used to preload the CMake cache by using the -C option of cmake::
it: L'approccio consigliato consiste nell'usare il file TryRunResults.cmake creato da CMake. Lo si dovrebbe copiare in una posizione sicura (ovvero dove non verrà rimosso se la directory di build viene eliminata) e assegnargli un nome utile, ad es. TryRunResults-MyProject-eldk-ppc.cmake. Il contenuto di questo file deve essere modificato in modo che i comandi set impostino le variabili richieste sui valori appropriati per il sistema target. Questo file può quindi essere utilizzato per precaricare la cache di CMake utilizzando l'opzione -C di cmake::

source: You do not have to use the other CMake options again as they are now in the cache. This way you can use MyProjectTryRunResults-eldk-ppc.cmake in multiple build trees, and it can be distributed with your project so that it is easier for other users to cross compile it.
it: Non è necessario utilizzare nuovamente le altre opzioni di CMake poiché ora sono nella cache. In questo modo si può utilizzare MyProjectTryRunResults-eldk-ppc.cmake in più alberi di build e può essere distribuito col progetto in modo che sia più facile per altri utenti cross-compilarlo.

source: Running Executables Built in the Project
it: Esecuzione di Eseguibili Creati nel Progetto

source: In some cases it is necessary that during a build, an executable is invoked that was built earlier in the same build; this is usually the case for code generators and similar tools. This does not work when cross compiling, as the executables are built for the target platform and cannot run on the build host (without the use of virtual machines, compatibility layers, emulators, etc.). With CMake, these programs are created using :command:`add_executable`, and executed with :command:`add_custom_command` or :command:`add_custom_target`. The following three options can be used to support these executables with CMake. The old version of the CMake code could look something like this
it: In alcuni casi è necessario che durante una build venga richiamato un eseguibile compilato in precedenza nella stessa build; questo di solito è il caso di generatori di codice e strumenti simili. Questo non funziona durante la cross-compilazione, poiché gli eseguibili sono creati per la piattaforma target e non possono essere eseguiti sull'host di build (senza l'uso di macchine virtuali, layer di compatibilità, emulatori, ecc.). Con CMake, questi programmi vengono creati utilizzando :command:`add_executable`, ed eseguiti con :command:`add_custom_command` o con :command:`add_custom_target`. Le seguenti tre opzioni possono essere utilizzate per supportare questi eseguibili con CMake. La vecchia versione del codice CMake potrebbe essere simile a questa

source: Now we will show how this file can be modified so that it works when cross-compiling. The basic idea is that the executable is built only when doing a native build for the build host, and is then exported as an executable target to a CMake script file. This file is then included when cross-compiling, and the executable target for the executable mygen will be loaded. An imported target with the same name as the original target will be created. :command:`add_custom_command` recognizes target names as executables, so for the command in :command:`add_custom_command`, simply the target name can be used; it is not necessary to use the LOCATION property to obtain the path of the executable:
it: Ora mostreremo come questo file può essere modificato in modo che funzioni durante la cross-compilazione. L'idea di base è che l'eseguibile viene compilato solo quando si esegue una compilazione nativa per l'host di build e viene poi esportato come target eseguibile in un file di script CMake. Questo file viene quindi incluso durante la cross-compilazione e verrà caricato il target eseguibile di mygen. Verrà creato un target importato con lo stesso nome del target originale. :command:`add_custom_command` riconosce i nomi dei target come eseguibili, quindi per il comando in :command:`add_custom_command`, può essere utilizzato semplicemente il nome del target; non è necessario utilizzare la proprietà LOCATION per ottenere il path dell'eseguibile:

source: With the CMakeLists.txt modified like this, the project can be cross-compiled. First, a native build has to be done in order to create the necessary mygen executable. After that, the cross-compiling build can begin. The build directory of the native build has to be given to the cross-compiling build as the location of the MyGen package, so that find_package(MyGen) can find it::
it: Con CMakeLists.txt modificato in questo modo, il progetto può essere cross-compilato. Innanzitutto, è necessario eseguire una build nativa per creare l'eseguibile mygen necessario. Successivamente, si può iniziare la cross-compilazione. La directory di build della build nativa deve essere assegnata a quella della cross-compilazione come la posizione del pacchetto MyGen, in modo che find_package(MyGen) possa trovarlo::

source: Cross-Compiling Hello World
it: Cross-Compilare Hello World

source: Now let's actually start with the cross-compiling. The first step is to install a cross-compiling toolchain. If this is already installed, you can skip the next paragraph.
it: Ora iniziamo effettivamente con la cross-compilazione. Il primo passo consiste nell'installare una toolchain di cross-compilazione. Se questo è già installato, si può saltare il paragrafo successivo.

source: There are many different approaches and projects that deal with cross-compiling for Linux, ranging from free software projects working on Linux-based PDAs to commercial embedded Linux vendors. Most of these projects come with their own way to build and use the respective toolchain. Any of these toolchains can be used with CMake; the only requirement is that it works in the normal file system and does not expect a "sandboxed" environment, like for example the Scratchbox project.
it: Esistono molti approcci e progetti diversi che si occupano di cross-compilazione per Linux, che vanno dai progetti di software libero che lavorano su PDA basati su Linux ai fornitori commerciali di Linux embedded. La maggior parte di questi progetti ha il proprio modo di buildare e utilizzare la rispettiva toolchain. Ciascuna di queste toolchain può essere utilizzata con CMake; l'unico requisito è che funzioni nel normale file system e non preveda un ambiente "sandboxed", come ad esempio il progetto Scratchbox.

source: An easy-to-use toolchain with a relatively complete target environment is the Embedded Linux Development Toolkit (http://www.denx.de/wiki/DULG/ELDK). It supports ARM, PowerPC, and MIPS as target platforms. ELDK can be downloaded from ftp://ftp.sunet.se/pub/Linux/distributions/eldk/. The easiest way is to download the ISOs, mount them, and then install them::
it: Una toolchain di facile utilizzo con un ambiente target relativamente completo è l'Embedded Linux Development Toolkit (http://www.denx.de/wiki/DULG/ELDK). Supporta ARM, PowerPC e MIPS come piattaforme target. ELDK è scaricabile da ftp://ftp.sunet.se/pub/Linux/distributions/eldk/. Il modo più semplice è quello di scaricare gli ISO, montarli e poi installarli::

source: ELDK (and other toolchains) can be installed anywhere, either in the home directory or system-wide if there are more users working with them. In this example, the toolchain will now be located in /home/alex/eldk-mips/usr/bin/ and the target environment is in /home/alex/eldk-mips/mips_4KC/.
it: ELDK (e altre toolchain) possono essere installate ovunque, nella home directory o in tutto il sistema se ci sono più utenti che ci lavorano. In questo esempio, la toolchain si troverà in /home/alex/eldk-mips/usr/bin/ e l'ambiente target in /home/alex/eldk-mips/mips_4KC/.

source: Now that a cross-compiling toolchain is installed, CMake has to be set up to use it. As already described, this is done by creating a toolchain file for CMake. In this example, the toolchain file looks like this:
it: Ora che è installata una toolchain per la cross-compilazione incrociata, CMake deve essere configurato per utilizzarla. Come già descritto, questo viene fatto creando un file di toolchain per CMake. In questo esempio, il file della toolchain ha questo aspetto:

source: The toolchain files can be located anywhere, but it is a good idea to put them in a central place so that they can be reused in multiple projects. We will save this file as ~/Toolchains/Toolchain-eldk-mips4K.cmake. The variables mentioned above are set here: :variable:`CMAKE_SYSTEM_NAME`, the C/C++ compilers, and :variable:`CMAKE_FIND_ROOT_PATH` to specify where libraries and headers for the target environment are located. The find modes are also set up so that libraries and headers are searched for in the target environment only, whereas programs are searched for in the host environment only. Now we will cross-compile the hello world project from Chapter 2
it: I file della toolchain possono trovarsi ovunque, ma è una buona idea metterli in una posizione centralizzata in modo che possano essere riutilizzati in più progetti. Salveremo questo file come ~/Toolchains/Toolchain-eldk-mips4K.cmake. Le variabili sopra menzionate sono impostate qui: :variable:`CMAKE_SYSTEM_NAME`, i compilatori C/C++ e :variable:`CMAKE_FIND_ROOT_PATH` per specificare dove si trovano le librerie e gli header per l'ambiente target. Anche le modalità di ricerca sono impostate in modo che le librerie e gli header vengano cercati solo nell'ambiente target, mentre i programmi vengono cercati solo nell'ambiente host. Ora cross-compileremo il progetto hello world del Capitolo 2

source: Run CMake, this time telling it to use the toolchain file from above::
it: Si esegue CMake, questa volta dicendogli di usare il file toolchain precedente::

source: This should give you an executable that can run on the target platform. Thanks to the VERBOSE=1 option, you should see that the cross-compiler is used. Now we will make the example a bit more sophisticated by adding system inspection and install rules. We will build and install a shared library named Tools, and then build the Hello application which links to the Tools library.
it: Questo dovrebbe dare un eseguibile per la piattaforma target. Grazie all'opzione VERBOSE=1, si dovrebbe vedere che viene utilizzato il cross-compilatore. Ora renderemo l'esempio un po' più sofisticato aggiungendo l'ispezione del sistema e le regole di installazione. Eseguiremo la build e installeremo una libreria shared denominata Tools, poi creeremo l'applicazione Hello che si linka alla libreria Tools.

source: There is no difference in a normal CMakeLists.txt; no special prerequisites are required for cross-compiling. The CMakeLists.txt checks that the header stdio.h is available and sets the version number for the Tools library. These are configured into config.h, which is then used in tools.cxx. The version number is also used to set the version number of the Tools library. The library and headers are installed to ${:variable:`CMAKE_INSTALL_PREFIX`}/lib and ${``CMAKE_INSTALL_PREFIX``}/include respectively. Running CMake gives this result::
it: Non c'è differenza in un normale CMakeLists.txt; non sono richiesti prerequisiti speciali per la cross-compilazione. CMakeLists.txt verifica che l'header stdio.h sia disponibile e imposta il numero di versione per la libreria Tools. Questi vengono configurati in config.h, che viene poi utilizzato in tools.cxx. Il numero di versione viene utilizzato anche per impostare quello della libreria Tools. La libreria e gli header sono installati rispettivamente in ${:variable:`CMAKE_INSTALL_PREFIX`}/lib e in ${``CMAKE_INSTALL_PREFIX``}/include. L'esecuzione di CMake dà questo risultato::

source: As can be seen in the output above, CMake detected the correct compiler, found the stdio.h header for the target platform, and successfully generated the Makefiles. The make command was invoked, which then successfully built and installed the library in the specified installation directory. Now we can build an executable that uses the Tools library and does some system inspection
it: Come si può vedere nell'output precedente, CMake ha rilevato il compilatore corretto, ha trovato l'header stdio.h per la piattaforma target e ha generato correttamente i Makefile. È stato richiamato il comando make, che ha poi compilato e installato correttamente la libreria nella directory di installazione specificata. Ora possiamo buildare un eseguibile che usa la libreria Tools ed esegue un'ispezione del sistema

source: Building works in the same way as with the library; the toolchain file has to be used and then it should just work::
it: La build funziona allo stesso modo della libreria; il file toolchain deve essere utilizzato e poi dovrebbe funzionare::

source: Obviously CMake found the correct zlib and also libTools.so, which had been installed in the previous step.
it: Ovviamente CMake ha trovato lo zlib corretto e anche libTools.so, che era stato installato nel passaggio precedente.

source: Cross-Compiling for a Microcontroller
it: Cross-Compilazione per un Microcontroller

source: CMake can be used for more than cross-compiling to targets with operating systems, it is also possible to use it in development for deeply-embedded devices with small microcontrollers and no operating system at all. As an example, we will use the Small Devices C Compiler (http://sdcc.sourceforge.net), which runs under Windows, Linux, and Mac OS X, and supports 8 and 16 Bit microcontrollers. For driving the build, we will use MS NMake under Windows. As before, the first step is to write a toolchain file so that CMake knows about the target platform. For sdcc, it should look something like this
it: CMake può essere utilizzato per molto di più della cross-compilazione su target con sistemi operativi, è anche possibile utilizzarlo in fase di sviluppo per dispositivi "deeply-embedded" con piccoli microcontrollori e nessun sistema operativo. Ad esempio, utilizzeremo Small Devices C Compiler (http://sdcc.sourceforge.net), che funziona su Windows, Linux e Mac OS X e supporta microcontrollori a 8 e 16 bit. Per gestire la build, useremo MS NMake sotto Windows. Come prima, il primo passo è scrivere un file di toolchain in modo che CMake conosca la piattaforma target. CMakeLists.txt dovrebbe essere simile al seguente

source: The system name for targets that do not have an operating system, "Generic," should be used as the :variable:`CMAKE_SYSTEM_NAME`. The CMake platform file for "Generic" doesn't set up any specific features. All that it assumes is that the target platform does not support shared libraries, and so all properties will depend on the compiler and :variable:`CMAKE_SYSTEM_PROCESSOR`. The toolchain file above does not set the FIND-related variables. As long as none of the find commands is used in the CMake commands, this is fine. In many projects for small microcontrollers, this will be the case. The CMakeLists.txt should look like the following
it: Il nome del sistema per i target che non dispongono di un sistema operativo, "Generic", deve essere utilizzato come :variable:`CMAKE_SYSTEM_NAME`. Il file della piattaforma CMake per "Generic" non imposta alcuna funzionalità specifica. Tutto ciò che presuppone è che la piattaforma target non supporti le librerie shared, quindi tutte le proprietà dipenderanno dal compilatore e da :variable:`CMAKE_SYSTEM_PROCESSOR`. Il file toolchain sopra non imposta le variabili relative a FIND. Finché nessuno dei comandi find viene utilizzato nei comandi CMake, va bene. In molti progetti per piccoli microcontrollori, sarà così. CMakeLists.txt dovrebbe essere simile al seguente

source: There are no major differences in other CMakeLists.txt files. One important point is that the language "C" is enabled explicitly using the :command:`project` command. If this is not done, CMake will also try to enable support for C++, which will fail as sdcc only has support for C. Running CMake and building the project should work as usual::
it: Non ci sono grandi differenze in altri file CMakeLists.txt. Un punto importante è che il linguaggio "C" è abilitato esplicitamente usando il comando :command:`project`. Se ciò non viene fatto, CMake proverà anche ad abilitare il supporto per C++, che fallirà poiché sdcc supporta solo C. L'esecuzione di CMake e la creazione del progetto dovrebbero funzionare come al solito::

source: This was a simple example using NMake with sdcc with the default settings of sdcc. Of course, more sophisticated project layouts are possible. For this kind of project, it is also a good idea to set up an install directory where reusable libraries can be installed, so it is easier to use them in multiple projects. It is normally necessary to choose the correct target platform for sdcc; not everybody uses i8051, which is the default for sdcc. The recommended way to do this is via setting :variable:`CMAKE_SYSTEM_PROCESSOR`.
it: Questo era un semplice esempio usando NMake con sdcc con le impostazioni di default di sdcc. Naturalmente, sono possibili layout di progetto più sofisticati. Per questo tipo di progetto, è anche una buona idea impostare una directory di installazione in cui è possibile installare librerie riutilizzabili, quindi è più facile utilizzarle in più progetti. Normalmente è necessario scegliere la piattaforma target corretta per sdcc; non tutti usano i8051, che è il default per sdcc. Il modo consigliato per farlo è impostando :variable:`CMAKE_SYSTEM_PROCESSOR`.

source: This will cause CMake to search for and load the platform file Platform/Generic-SDCC-C-${CMAKE_SYSTEM_PROCESSOR}.cmake. As this happens, right before loading Platform/Generic-SDCC-C.cmake, it can be used to set up the compiler and linker flags for the specific target hardware and project. Therefore, a slightly more complex toolchain file is required
it: In questo modo CMake cercherà e caricherà il file della piattaforma Platform/Generic-SDCC-C-${CMAKE_SYSTEM_PROCESSOR}.cmake. Poiché ciò accade, subito prima di caricare Platform/Generic-SDCC-C.cmake, può essere utilizzato per impostare i flag del compilatore e del linker per l'hardware e il progetto target specifici. Pertanto, è necessario un file di toolchain leggermente più complesso

source: This toolchain file contains a few new settings; it is also about the most complicated toolchain file you should ever need. :variable:`CMAKE_SYSTEM_PROCESSOR` is set to Test_DS80C400_Rev_1, an identifier for the specific target hardware. This has the effect that CMake will try to load Platform/Generic-SDCC-C-Test_DS80C400_Rev_1.cmake. As this file does not exist in the CMake system module directory, the CMake variable :variable:`CMAKE_MODULE_PATH` has to be adjusted so that this file can be found. If this toolchain file is saved to c:/Toolchains/sdcc-ds400.cmake, the hardware-specific file should be saved in c:/Toolchains/Modules/Platform/. An example of this is shown below:
it: Questo file di toolchain contiene alcune nuove impostazioni; si tratta anche del file di toolchain più complicato di cui si dovrebbe mai aver bisogno. :variable:`CMAKE_SYSTEM_PROCESSOR` è impostato su Test_DS80C400_Rev_1, un identificatore per l'hardware target specifico. Ciò ha l'effetto che CMake proverà a caricare Platform/Generic-SDCC-C-Test_DS80C400_Rev_1.cmake. Poiché questo file non esiste nella directory del modulo di sistema CMake, la variabile CMake :variable:`CMAKE_MODULE_PATH` deve essere aggiustata in modo che questo file possa essere trovato. Se questo file della toolchain viene salvato in c:/Toolchains/sdcc-ds400.cmake, il file specifico dell'hardware deve essere salvato in c:/Toolchains/Modules/Platform/. Un esempio di ciò è mostrato di seguito:

source: This will select the DS80C390 as the target platform and add the --use-accelerator argument to the default compile flags. In this example the "NMake Makefiles" generator was used. In the same way e.g. the "MinGW Makefiles" generator could be used for a GNU make from MinGW, or another Windows version of GNU make, are available. At least version 3.78 is required, or the "Unix Makefiles" generator under UNIX. Also, any Makefile-based, IDE-project generators could be used; e.g. the Eclipse, CodeBlocks, or the KDevelop3 generator.
it: Questo selezionerà DS80C390 come piattaforma target e aggiungerà l'argomento --use-accelerator ai flag di compilazione di default. In questo esempio è stato utilizzato il generatore "NMake Makefiles". Allo stesso modo sono disponibili, ad es., il generatore e.g. "MinGW Makefiles" potrebbe essere utilizzato per un make GNU da MinGW, o un'altra versione Windows di GNU make. È richiesta almeno la versione 3.78 o il generatore "Unix Makefiles" sotto UNIX. Inoltre, è possibile utilizzare qualsiasi generatore di progetti IDE basato su Makefile; per esempio. il generatore Eclipse, CodeBlocks o KDevelop3.

source: Cross-Compiling a Complex Project - VTK
it: Cross-Compilazione di un Progetto Complesso - VTK
