Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: This will set the policies to build with CMake 2.6 and to ignore them for CMake 2.4. In order to support both CMake 2.6 and some policies of CMake 2.8, one may write code like:
it: Questo imposterà le policy per la compilazione con CMake 2.6 e per ignorarli per CMake 2.4. Per supportare sia CMake 2.6 che alcune policy di CMake 2.8, è possibile scrivere codice come:

source: This will set the policies to build with CMake 2.8 and to ignore them for CMake 2.6. If it is known that the project builds with both CMake 2.6 and CMake 2.8's new policies users may write:
it: Questo imposterà le policy per la compilazione con CMake 2.8 e per ignorarli per CMake 2.6. Se è noto che il progetto viene compilato con le nuove policy di CMake 2.6 e CMake 2.8, gli utenti possono scrivere:

source: Checking Versions of CMake
it: Controllo delle Versioni di CMake

source: CMake is an evolving program and as new versions are released, new features or commands are introduced. As a result, there may be instances where you might want to use a command that is in a current version of CMake but not in previous versions. There are a couple of ways to handle this; one option is to use the :command:`if` command to check whether a new command exists. For example:
it: CMake è un programma in evoluzione e man mano che vengono rilasciate nuove versioni, vengono introdotte nuove funzionalità o comandi. Di conseguenza, potrebbero esserci casi in cui si potrebbe voler utilizzare un comando che si trova in una versione corrente di CMake ma non nelle versioni precedenti. Ci sono un paio di modi per gestirlo; un'opzione è usare il comando :command:`if` per controllare se esiste un nuovo comando. Per esempio:

source: Alternatively, one may test against the actual version of CMake that is being run by evaluating the :variable:`CMAKE_VERSION` variable:
it: In alternativa, è possibile testare la versione effettiva di CMake in esecuzione valutando la variabile :variable:`CMAKE_VERSION`:

source: Finally, some new releases of CMake might no longer support some behavior you were using (although we try to avoid this). In these cases, use CMake policies, as discussed in the :manual:`cmake-policies <cmake-policies(7)>` manual.
it: Infine, alcune nuove versioni di CMake potrebbero non supportare più alcuni comportamenti utilizzati (sebbene cerchiamo di evitarlo). In questi casi, si utilizzano le politiche di CMake, come discusso nel manuale :manual:`cmake-policies <cmake-policies(7)>`.

source: This chapter will describe how to use CMake to inspect the environment of the system where the software is being built. This is a critical factor in creating cross-platform applications or libraries. It covers how to find and use system and user installed header files and libraries. It also covers some of the more advanced features of CMake, including the :command:`try_compile` and :command:`try_run` commands. These commands are extremely powerful tools for determining the capabilities of the system and compiler that is hosting your software.
it: Questo capitolo descriverà come utilizzare CMake per ispezionare l'ambiente del sistema in cui viene creato il software. Questo è un fattore critico nella creazione di applicazioni o librerie multipiattaforma. Descrive come trovare e utilizzare i file header e le librerie installati dal sistema e dall'utente. Copre anche alcune delle funzionalità più avanzate di CMake, inclusi i comandi :command:`try_compile` e :command:`try_run`. Questi comandi sono strumenti estremamente potenti per determinare le capacità del sistema e del compilatore che ospita il software.

source: Using Header Files and Libraries
it: Utilizzo di File Header e Librerie

source: Many C and C++ programs depend on external libraries; however, when it comes to the practical aspects of compiling and linking a project, taking advantage of existing libraries can be difficult for both developers and users. Problems typically show up as soon as the software is built on a system other than the one on which it was developed. Assumptions regarding where libraries and header files are located become obvious when they are not installed in the same place on the new computer and the build system is unable to find them. CMake has many features to aid developers in the integration of external software libraries into a project.
it: Molti programmi C e C++ dipendono da librerie esterne; tuttavia, quando si tratta degli aspetti pratici della compilazione e del link di un progetto, sfruttare le librerie esistenti può risultare difficile sia per gli sviluppatori che per gli utenti. I problemi in genere si manifestano non appena il software viene costruito su un sistema diverso da quello su cui è stato sviluppato. I presupposti relativi alla posizione delle librerie e dei file header diventano palesi quando non sono installati nella stessa posizione sul nuovo computer e il sistema di build non è in grado di trovarli. CMake ha molte funzionalità per aiutare gli sviluppatori nell'integrazione di librerie software esterne in un progetto.

source: The CMake commands that are most relevant to this type of integration are the :command:`find_file`, :command:`find_library`, :command:`find_path`, :command:`find_program`, and :command:`find_package` commands. For most C and C++ libraries, a combination of :command:`find_library` and :command:`find_path` will be enough to compile and link with an installed library. The command :command:`find_library` can be used to locate, or allow a user to locate a library, and :command:`find_path` can be used to find the path to a representative include file from the project. For example, if you wanted to link to the tiff library, you could use the following commands in your CMakeLists.txt file
it: I comandi CMake più rilevanti per questo tipo di integrazione sono :command:`find_file`, :command:`find_library`, :command:`find_path`, :command:`find_program` e :command:`find_package`. Per la maggior parte delle librerie C e C++, una combinazione di :command:`find_library` e :command:`find_path` sarà sufficiente per compilare e linkare una libreria installata. Il comando :command:`find_library` è utilizzabile per individuare o consentire a un utente di individuare una libreria e :command:`find_path` può essere utilizzato per trovare il path di un file include rappresentativo del progetto. Ad esempio, volendo linkare la libreria tiff, si possono utilizzare i seguenti comandi nel file CMakeLists.txt

source: The first command used is :command:`find_library`, which in this case, will look for a library with the name tiff or tiff2. The :command:`find_library` command only requires the base name of the library without any platform-specific prefixes or suffixes, such as .lib and .dll. The appropriate prefixes and suffixes for the system running CMake will be added to the library name automatically when CMake attempts to find it. All the ``FIND_*`` commands will look in the ``PATH`` environment variable. In addition, the commands allow the specification of additional search paths as arguments to be listed after the ``PATHS`` marker argument. In addition to supporting standard paths, Windows registry entries and environment variables can be used to construct search paths. The syntax for registry entries is the following::
it: Il primo comando utilizzato è :command:`find_library`, che in questo caso cercherà una libreria con il nome tiff o tiff2. Il comando :command:`find_library` richiede solo il nome di base della libreria senza prefissi o suffissi specifici della piattaforma, come .lib e .dll. I prefissi e i suffissi appropriati per il sistema che esegue CMake verranno aggiunti automaticamente al nome della libreria quando CMake la cerca. Tutti i comandi ``FIND_*`` cercheranno nella variabile d'ambiente ``PATH``. Inoltre, i comandi consentono di specificare ulteriori path di ricerca come argomenti da elencare dopo l'argomento marcatore ``PATHS``. Oltre a supportare i path standard, le voci di registro di Windows e le variabili di ambiente possono essere utilizzate per creare path di ricerca. La sintassi per le voci di registro è la seguente::

source: Since software can be installed in many different places, it is impossible for CMake to find the library every time, but most standard installations should be covered. The ``find_*`` commands automatically create a cache variable so that users can override or specify the location from the CMake GUI. This way, if CMake is unable to locate the files it is looking for, users will still have an opportunity to specify them. If CMake does not find a file, the value is set to ``VAR-NOTFOUND``; this value tells CMake that it should continue looking each time CMake's configure step is run. Note that in if statements, values of ``VAR-NOTFOUND`` will evaluate as false.
it: Poiché il software può essere installato in molti luoghi diversi, è impossibile per CMake trovare la libreria ogni volta, ma la maggior parte delle installazioni standard dovrebbe essere coperta. I comandi ``find_*`` creano automaticamente una variabile di cache in modo che gli utenti possano sovrascrivere o specificare la posizione dalla GUI di CMake. In questo modo, se CMake non è in grado di individuare i file che sta cercando, gli utenti avranno comunque la possibilità di specificarli. Se CMake non trova un file, il valore viene impostato su ``VAR-NOTFOUND``; questo valore indica a CMake che dovrebbe continuare a cercare ogni volta che viene eseguito il passaggio di configurazione di CMake. Notare che nelle istruzioni if, i valori di ``VAR-NOTFOUND`` saranno valutati come falsi.

source: The next command used is :command:`find_path`, a general purpose command that, in this example, is used to locate a header file from the library. Header files and libraries are often installed in different locations, and both locations are required to compile and link programs that use them. The use of :command:`find_path` is similar to :command:`find_library`, although it only supports one name, a list of search paths.
it: Il comando successivo utilizzato è :command:`find_path`, un comando generico che, in questo esempio, viene utilizzato per individuare un file header dalla libreria. I file header e le librerie sono spesso installati in posizioni diverse ed entrambe le posizioni sono necessarie per compilare e linkare i programmi che li utilizzano. L'uso di :command:`find_path` è simile a :command:`find_library`, sebbene supporti solo un nome, un elenco di path di ricerca.

source: The remainder of the CMakeLists file may use the variables created by the ``find_*`` commands. The variables can be used without checking for valid values, as CMake will print an error message notifying the user if any of the required variables have not been set. The user can then set the cache values and reconfigure until the message goes away. Optionally, a CMakeLists file could use the :command:`if` command to use alternative libraries or options to build the project without the library if it cannot be found.
it: Il resto del file CMakeLists può utilizzare le variabili create dai comandi ``find_*``. Le variabili possono essere utilizzate senza controllare che i valori siano validi, poiché CMake stamperà un messaggio di errore che notifica all'utente se una qualsiasi delle variabili richieste non è stata impostata. L'utente può poi impostare i valori della cache e riconfigurare finché il messaggio non scompare. Facoltativamente, un file CMakeLists potrebbe utilizzare il comando :command:`if` per utilizzare librerie o opzioni alternative per creare il progetto se non è possibile trovare la libreria.

source: From the above example you can see how using the ``find_*`` commands can help your software compile on a variety of systems. It is worth noting that the ``find_*`` commands search for a match starting with the first argument and first path, so when listing paths and library names, list your preferred paths and names first. If there are multiple versions of a library and you would prefer tiff over tiff2, make sure they are listed in that order.
it: Dall'esempio sopra vede come l'uso dei comandi ``find_*`` può aiutare il software a compilare su una varietà di sistemi. Vale la pena notare che i comandi ``find_*`` cercano una corrispondenza che inizia con il primo argomento e il primo path, quindi quando si elencano path e nomi di librerie, si devono elencare prima i path e nomi preferiti. Se ci sono più versioni di una libreria e si preferisce tiff a tiff2, devono essere elencate in tale ordine.

source: System Properties
it: Proprietà di Sistema

source: Although it is a common practice in C and C++ code to add platform-specific code inside preprocessor ``ifdef`` directives, for maximum portability this should be avoided. Software should not be tuned to specific platforms with ``ifdefs``, but rather to a canonical system consisting of a set of features. Coding to specific systems makes the software less portable, because systems and the features they support change with time, and even from system to system. A feature that may not have worked on a platform in the past may be a required feature for the platform in the future. The following code fragments illustrate the difference between coding to a canonical system and a specific system:
it: Sebbene sia una pratica comune nel codice C e C++ aggiungere codice specifico della piattaforma all'interno delle direttive ``ifdef`` del preprocessore, per la massima portabilità questo dovrebbe essere evitato. Il software non dovrebbe essere adattato a piattaforme specifiche con ``ifdefs``, ma piuttosto su un sistema canonico costituito da un insieme di funzionalità. La codifica per sistemi specifici rende il software meno portabile, perché i sistemi e le funzionalità che supportano cambiano nel tempo e persino da sistema a sistema. Una funzionalità che potrebbe non aver funzionato su una piattaforma in passato potrebbe essere una funzionalità necessaria in futuro. I seguenti frammenti di codice illustrano la differenza tra la codifica in un sistema canonico e un sistema specifico:

source: The problem with the second approach is that the code will have to be modified for each new platform on which the software is compiled. For example, a future version of SUN may no longer have the foobar call. Using the ``HAS_FOOBAR_CALL`` approach, the software will work as long as ``HAS_FOOBAR_CALL`` is defined correctly, and this is where CMake can help. CMake can be used to define ``HAS_FOOBAR_CALL`` correctly and automatically by making use of the :command:`try_compile` and :command:`try_run` commands. These commands can be used to compile and run small test programs during the CMake configure step. The test programs will be sent to the compiler that will be used to build the project, and if errors occur, the feature can be disabled. These commands require that you write a small C or C++ program to test the feature. For example, to test if the ``foobar`` call is provided on the system, try compiling a simple program that uses ``foobar``. First write the simple test program (testNeedFoobar.c in this example) and then add the CMake calls to the CMakeLists file to try compiling that code. If the compilation works then ``HAS_FOOBAR_CALL`` will be set to true.
it: Il problema con il secondo approccio è che il codice dovrà essere modificato per ogni nuova piattaforma su cui viene compilato il software. Ad esempio, una versione futura di SUN potrebbe non avere più la chiamata foobar. Utilizzando l'approccio ``HAS_FOOBAR_CALL``, il software funzionerà fintanto che ``HAS_FOOBAR_CALL`` è definito correttamente, ed è qui che CMake può aiutare. CMake può essere utilizzato per definire ``HAS_FOOBAR_CALL`` correttamente e automaticamente utilizzando i comandi :command:`try_compile` e :command:`try_run`. Questi comandi possono essere utilizzati per compilare ed eseguire piccoli programmi di test durante la fase di configurazione di CMake. I programmi di test verranno inviati al compilatore che verrà utilizzato per buildare il progetto e, se si verificano errori, la funzionalità può essere disabilitata. Questi comandi richiedono la scrittura di un piccolo programma C o C++ per testare la funzionalità. Ad esempio, per verificare se la chiamata ``foobar`` è presente sul sistema, si prova a compilare un semplice programma che utilizza ``foobar``. Prima si scrive il programmino di test (testNeedFoobar.c in questo esempio) e poi si aggiungono le chiamate CMake al file CMakeLists per provare a compilare quel codice. Se la compilazione funziona allora ``HAS_FOOBAR_CALL`` sarà impostato su true.

source: Now that ``HAS_FOOBAR_CALL`` is set correctly in CMake, you can use it in your source code through the :command:`target_compile_definitions` command. Alternatively, it is possible to configure a header file. This is discussed further in the section called :ref:`configure_header`.
it: Ora che ``HAS_FOOBAR_CALL`` è impostato correttamente in CMake, lo si può utilizzare nel codice sorgente tramite il comando :command:`target_compile_definitions`. In alternativa, è possibile configurare un file header. Questo è discusso ulteriormente nella sezione chiamata :ref:`configure_header`.

source: Sometimes compiling a test program is not enough. In some cases, you may actually want to compile and run a program to get its output. A good example of this is testing the byte order of a machine. The following example shows how to write a small program that CMake will compile and run to determine the byte order of a machine.
it: A volte la compilazione di un programma di test non è sufficiente. In alcuni casi, si potrebbe effettivamente voler compilare ed eseguire un programma per ottenerne l'output. Un buon esempio di ciò è testare l'ordine dei byte di una macchina. L'esempio seguente mostra come scrivere un piccolo programma che CMake compilerà ed eseguirà per determinare l'ordine dei byte di una macchina.

source: The return result of the run will go into ``RUN_RESULT_VAR``, the result of the compile will go into ``COMPILE_RESULT_VAR``, and any output from the run will go into ``OUTPUT``. You can use these variables to report debug information to the users of your project.
it: Il risultato restituito dell'esecuzione andrà in ``RUN_RESULT_VAR``, il risultato della compilazione andrà in ``COMPILE_RESULT_VAR`` e qualsiasi output dell'esecuzione andrà in ``OUTPUT``. Si possono utilizzare queste variabili per segnalare informazioni di debug agli utenti del progetto.

source: For small test programs the :command:`file` command with the ``WRITE`` option can be used to create the source file from the CMakeLists file. The following example tests the C compiler to verify that it can be run.
it: Per piccoli programmi di test, il comando :command:`file` con l'opzione ``WRITE`` può essere utilizzato per creare il file sorgente dal file CMakeLists. L'esempio seguente verifica che il compilatore C possa essere eseguito.

source: For more advanced :command:`try_compile` and :command:`try_run` operations, it may be desirable to pass flags to the compiler or to CMake. Both commands support the optional arguments ``CMAKE_FLAGS`` and ``COMPILE_DEFINITIONS``. ``CMAKE_FLAGS`` can be used to pass ``-DVAR:TYPE=VALUE`` flags to CMake. The value of ``COMPILE_DEFINITIONS`` is passed directly to the compiler command line.
it: Per operazioni :command:`try_compile` e :command:`try_run` più avanzate, potrebbe essere desiderabile passare i flag al compilatore o a CMake. Entrambi i comandi supportano gli argomenti facoltativi ``CMAKE_FLAGS`` e ``COMPILE_DEFINITIONS``. ``CMAKE_FLAGS`` può essere utilizzato per passare i flag ``-DVAR:TYPE=VALUE`` a CMake. Il valore di ``COMPILE_DEFINITIONS`` viene passato direttamente alla riga di comando del compilatore.

source: There are several predefined try-run and try-compile modules available in CMake :manual:`cmake-modules(7)`, some of which are listed below. These modules allow some common checks to be performed without having to create a source file for each test. Many of these modules will look at the current value of the ``CMAKE_REQUIRED_FLAGS`` and ``CMAKE_REQUIRED_LIBRARIES`` variables to add additional compile flags or link libraries to the test.
it: Sono disponibili diversi moduli try-run e try-compile predefiniti in CMake :manual:`cmake-modules(7)`, alcuni dei quali sono elencati di seguito. Questi moduli consentono di eseguire alcuni controlli comuni senza dover creare un file sorgente per ogni test. Molti di questi moduli esamineranno il valore corrente delle variabili ``CMAKE_REQUIRED_FLAGS`` e ``CMAKE_REQUIRED_LIBRARIES`` per aggiungere ulteriori flag di compilazione o link di librerie al test.

source: Provides a macro that checks for an include file on a system by taking two arguments with first being the include file to look for and the second being the variable to store the result into. Additional CFlags can be passed in as a third argument or by setting ``CMAKE_REQUIRED_FLAGS``.
it: Fornisce una macro che verifica la presenza di un file di inclusione su un sistema prendendo due argomenti, il primo è il file di inclusione da cercare e il secondo è la variabile in cui archiviare il risultato. CFlag aggiuntivi possono essere passati come terzo argomento o impostando ``CMAKE_REQUIRED_FLAGS``.

source: Provides a macro that checks for an include file in a C++ program by taking two arguments with the first being the include file to look for and the second being the variable to store the result into. Additional CFlags can be passed in as a third argument.
it: Fornisce una macro che verifica la presenza di un file di inclusione in un programma C++ prendendo due argomenti, il primo è il file di inclusione da cercare e il secondo è la variabile in cui memorizzare il risultato. CFlag aggiuntivi possono essere passati come terzo argomento.

source: Provides a macro that checks if the given header files can be include together. This macro uses ``CMAKE_REQUIRED_FLAGS`` if it is set, and is useful when a header file you are interested in checking for is dependent on including another header file first.
it: Fornisce una macro che verifica se i file header specificati possono essere inclusi insieme. Questa macro utilizza ``CMAKE_REQUIRED_FLAGS`` se è impostata ed è utile quando un file header che interessa controllare dipende dall'inclusione precedente di un altro file header.

source: Provides a macro that checks to see if a library exists by taking four arguments with the first being the name of the library to check for; the second being the name of a function that should be in that library; the third argument being the location of where the library should be found; and the fourth argument being a variable to store the result into. This macro uses ``CMAKE_REQUIRED_FLAGS`` and ``CMAKE_REQUIRED_LIBRARIES`` if they are set.
it: Fornisce una macro che controlla se esiste una libreria prendendo quattro argomenti, il primo dei quali è il nome della libreria da controllare; il secondo è il nome di una funzione che dovrebbe essere in quella libreria; il terzo argomento è la posizione in cui dovrebbe essere trovata la libreria; e il quarto argomento è una variabile in cui memorizzare il risultato. Questa macro utilizza ``CMAKE_REQUIRED_FLAGS`` e ``CMAKE_REQUIRED_LIBRARIES`` se sono impostate.
