Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: In CMake code, the ``CMAKE_SYSTEM_XXX`` variables always describe the target platform. The same is true for the short :variable:`WIN32`, :variable:`UNIX`, :variable:`APPLE` variables. These variables can be used to test the properties of the target. If it is necessary to test the build host system, there is a corresponding set of variables: :variable:`CMAKE_HOST_SYSTEM`, :variable:`CMAKE_HOST_SYSTEM_NAME`, :variable:`CMAKE_HOST_SYSTEM_VERSION`, :variable:`CMAKE_HOST_SYSTEM_PROCESSOR`; and also the short forms: :variable:`CMAKE_HOST_WIN32`, :variable:`CMAKE_HOST_UNIX` and :variable:`CMAKE_HOST_APPLE`.
it: Nel codice CMake, le variabili ``CMAKE_SYSTEM_XXX`` descrivono sempre la piattaforma target. Lo stesso vale per le variabili brevi :variable:`WIN32`, :variable:`UNIX`, :variable:`APPLE`. Queste variabili possono essere utilizzate per testare le proprietà del target. Se è necessario testare il sistema host di build, esiste un insieme corrispondente di variabili: :variable:`CMAKE_HOST_SYSTEM`, :variable:`CMAKE_HOST_SYSTEM_NAME`, :variable:`CMAKE_HOST_SYSTEM_VERSION`, :variable:`CMAKE_HOST_SYSTEM_PROCESSOR`; e anche le forme abbreviate: :variable:`CMAKE_HOST_WIN32`, :variable:`CMAKE_HOST_UNIX` e :variable:`CMAKE_HOST_APPLE`.

source: Since CMake cannot guess the target system, it cannot guess which compiler it should use. Setting the following variables defines what compilers to use for the target system.
it: Poiché CMake non può indovinare il sistema target, non può indovinare quale compilatore dovrebbe usare. L'impostazione delle seguenti variabili definisce quali compilatori utilizzare per il sistema target.

source: This specifies the C compiler executable as either a full path or just the filename. If it is specified with full path, then this path will be preferred when searching for the C++ compiler and the other tools (binutils, linker, etc.). If the compiler is a GNU cross-compiler with a prefixed name (e.g. "arm-elf-gcc"), CMake will detect this and automatically find the corresponding C++ compiler (i.e. "arm-elf-c++"). The compiler can also be set via the ``CC`` environment variable. Setting ``CMAKE_C_COMPILER`` directly in a toolchain file has the advantage that the information about the target system is completely contained in this file, and it does not depend on environment variables.
it: Questa specifica l'eseguibile del compilatore C come path completo o solo come nome file. Se viene specificato con il path completo, questo sarà preferito durante la ricerca del compilatore C++ e degli altri tool (binutils, linker, ecc.). Se il compilatore è un cross-compilatore GNU con un nome prefisso (ad esempio "arm-elf-gcc"), CMake lo rileverà e troverà automaticamente il compilatore C++ corrispondente (ad esempio "arm-elf-c++"). Il compilatore può anche essere impostato tramite la variabile d'ambiente ``CC``. L'impostazione di ``CMAKE_C_COMPILER`` direttamente in un file di toolchain ha il vantaggio che le informazioni sul sistema target sono completamente contenute in questo file e non dipendono dalle variabili di ambiente.

source: This specifies the C++ compiler executable as either a full path or just the filename. It is handled the same way as ``CMAKE_C_COMPILER``. If the toolchain is a GNU toolchain, it should suffice to set only ``CMAKE_C_COMPILER``; CMake should find the corresponding C++ compiler automatically. As for ``CMAKE_C_COMPILER``, also for C++ the compiler can be set via the ``CXX`` environment variable.
it: Questa specifica l'eseguibile del compilatore C come path completo o solo come nome file. Viene gestito allo stesso modo di ``CMAKE_C_COMPILER``. Se la toolchain è una toolchain GNU, dovrebbe essere sufficiente impostare solo ``CMAKE_C_COMPILER``; CMake dovrebbe trovare automaticamente il compilatore C++ corrispondente. Come per ``CMAKE_C_COMPILER``, anche per C++ il compilatore può essere impostato tramite la variabile d'ambiente ``CXX``.

source: Finding External Libraries, Programs and Other Files
it: Ricerca di Librerie Esterne, Programmi e Altri File

source: Most non-trivial projects make use of external libraries or tools. CMake offers the :command:`find_program`, :command:`find_library`, :command:`find_file`, :command:`find_path`, and :command:`find_package` commands for this purpose. They search the file system in common places for these files and return the results. :command:`find_package` is a bit different in that it does not actually search itself, but executes ``Find<*>.cmake`` modules, which in turn call the :command:`find_program`, :command:`find_library`, :command:`find_file`, and :command:`find_path` commands.
it: La maggior parte dei progetti non banali fa uso di librerie o tool esterni. CMake offre i comandi :command:`find_program`, :command:`find_library`, :command:`find_file`, :command:`find_path` e :command:`find_package` per questo scopo. Cercano questi file nel file system in luoghi comuni e restituiscono i risultati. :command:`find_package` è un po' diverso in quanto in realtà non cerca se stesso, ma esegue i moduli ``Find<*>.cmake``, che a loro volta chiamano i comandi :command:`find_program`, :command:`find_library`, :command:`find_file` e :command:`find_path`.

source: When cross-compiling, these commands become more complicated. For example, when cross-compiling to Windows on a Linux system, getting ``/usr/lib/libjpeg.so``` as the result of the command :command:`find_package(JPEG)` would be useless, since this would be the JPEG library for the host system and not the target system. In some cases, you want to find files that are meant for the target platform; in other cases you will want to find files for the build host. The following variables are designed to give you the flexibility to change how the typical find commands in CMake work, so that you can find both build host and target files as necessary.
it: Durante la cross-compilazione, questi comandi diventano più complicati. Ad esempio, durante la cross-compilazione su Windows su un sistema Linux, ottenere ``/usr/lib/libjpeg.so`` come risultato del comando :command:`find_package(JPEG)` sarebbe inutile, poiché questa sarebbe la libreria JPEG per il sistema host e non il sistema target. In alcuni casi, si desidera trovare file destinati alla piattaforma target; in altri casi si vorranno trovare i file per l'host di build. Le seguenti variabili sono progettate per dare la flessibilità di modificare il modo in cui funzionano i tipici comandi di ricerca in CMake, in modo da poter trovare sia l'host di build che i file target, se necessario.

source: The toolchain will come with its own set of libraries and headers for the target platform, which are usually installed under a common prefix. It is a good idea to set up a directory where all the software that is built for the target platform will be installed, so that the software packages don't get mixed up with the libraries that come with the toolchain.
it: La toolchain verrà fornita con il proprio set di librerie e header per la piattaforma target, che di solito sono installate con un prefisso comune. È una buona idea impostare una directory in cui verrà installato tutto il software creato per la piattaforma target, in modo che i pacchetti software non vengano confusi con le librerie fornite con la toolchain.

source: The :command:`find_program` command is typically used to find a program that will be executed during the build, so this should still search in the host file system, and not in the environment of the target platform. :command:`find_library` is normally used to find a library that is then used for linking purposes, so this command should only search in the target environment. For :command:`find_path` and :command:`find_file`, it is not so obvious; in many cases, they are used to search for headers, so by default they should only search in the target environment. The following CMake variables can be set to adjust the behavior of the find commands for cross-compiling.
it: Il comando :command:`find_program` viene in genere utilizzato per trovare un programma che verrà eseguito durante la compilazione, quindi questo dovrebbe comunque cercare nel file system host e non nell'ambiente della piattaforma target. :command:`find_library` viene normalmente utilizzato per trovare una libreria che viene poi utilizzata per scopi di collegamento, quindi questo comando dovrebbe cercare solo nell'ambiente target. Per :command:`find_path` e :command:`find_file`, non è così ovvio; in molti casi, vengono utilizzati per cercare header, quindi per default dovrebbero cercare solo nell'ambiente target. Le seguenti variabili CMake possono essere impostate per regolare il comportamento dei comandi find per la cross-compilazione.

source: This is a list of the directories that contain the target environment. Each of the directories listed here will be prepended to each of the search directories of every find command. Assuming your target environment is installed under ``/opt/eldk/ppc_74xx`` and your installation for that target platform goes to ``~/install-eldk-ppc74xx``, set :variable:`CMAKE_FIND_ROOT_PATH` to these two directories. Then ``find_library(JPEG_LIB jpeg)`` will search in ``/opt/eldk/ppc_74xx/lib``, ``/opt/eldk/ppc_74xx/usr/lib``, ``~/install-eldk-ppc74xx/lib``, ``~/install-eldk-ppc74xx/usr/lib``, and should result in ``/opt/eldk/ppc_74xx/usr/lib/libjpeg.so``.
it: Questo è un elenco delle directory che contengono l'ambiente target. Ognuna delle directory elencate qui verrà anteposta a ciascuna delle directory di ricerca di ogni comando find. Supponendo che l'ambiente target sia installato in ``/opt/eldk/ppc_74xx`` e che l'installazione per quella piattaforma target vada in ``~/install-eldk-ppc74xx``, si imposta :variable:`CMAKE_FIND_ROOT_PATH` con queste due directory. Poi ``find_library(JPEG_LIB jpeg)`` cercherà in ``/opt/eldk/ppc_74xx/lib``, ``/opt/eldk/ppc_74xx/usr/lib``, ``~/install-eldk-ppc74xx/lib``, ``~/install-eldk-ppc74xx/usr/lib`` e dovrebbe risultare in ``/opt/eldk/ppc_74xx/usr/lib/libjpeg.so``.

source: By default, :variable:`CMAKE_FIND_ROOT_PATH` is empty. If set, first the directories prefixed with the path given in :variable:`CMAKE_FIND_ROOT_PATH` will be searched, and then the unprefixed versions of the same directories will be searched.
it: Per default, :variable:`CMAKE_FIND_ROOT_PATH` è vuota. Se impostata, verranno cercate prima le directory con il prefisso del percorso fornito in :variable:`CMAKE_FIND_ROOT_PATH`, poi verranno cercate le versioni senza prefisso delle stesse directory.

source: By setting this variable, you are basically adding a new set of search prefixes to all of the find commands in CMake, but for some find commands you may not want to search the target or host directories. You can control how each find command invocation works by passing in one of the three following options ``NO_CMAKE_FIND_ROOT_PATH``, ``ONLY_CMAKE_FIND_ROOT_PATH``, or ``CMAKE_FIND_ROOT_PATH_BOTH`` when you call it. You can also control how the find commands work using the following three variables.
it: Impostando questa variabile, in pratica si sta aggiungendo un nuovo set di prefissi di ricerca a tutti i comandi di ricerca in CMake, ma per alcuni comandi di ricerca si potrebbe non voler cercare nelle directory target o dell'host. Si può controllare come funziona ogni invocazione del comando find passando una delle tre seguenti opzioni ``NO_CMAKE_FIND_ROOT_PATH``, ``ONLY_CMAKE_FIND_ROOT_PATH`` o ``CMAKE_FIND_ROOT_PATH_BOTH`` quando lo si chiama. Si può anche controllare come funzionano i comandi find usando le seguenti tre variabili.

source: This sets the default behavior for the :command:`find_program` command. It can be set to NEVER, ONLY, or BOTH. When set to NEVER, :variable:`CMAKE_FIND_ROOT_PATH` will not be used for :command:`find_program` calls except where it is enabled explicitly. If set to ONLY, only the search directories with the prefixes coming from :variable:`CMAKE_FIND_ROOT_PATH` will be used by :command:`find_program`. The default is BOTH, which means that first the prefixed directories and then the unprefixed directories, will be searched.
it: Questo imposta il comportamento di default per il comando :command:`find_program`. Può essere impostato su NEVER, ONLY o BOTH. Quando impostato su NEVER, :variable:`CMAKE_FIND_ROOT_PATH` non verrà utilizzato per le chiamate :command:`find_program` tranne dove è abilitato esplicitamente. Se impostato su ONLY, solo le directory di ricerca con i prefissi provenienti da :variable:`CMAKE_FIND_ROOT_PATH` saranno usate da :command:`find_program`. Il default è BOTH, il che significa che verranno cercate prima le directory con prefisso e poi quelle senza prefisso.

source: In most cases, :command:`find_program` is used to search for an executable which will then be executed, e.g. using :command:`execute_process` or :command:`add_custom_command`. So in most cases an executable from the build host is required, so setting :variable:`CMAKE_FIND_ROOT_PATH_MODE_PROGRAM` to NEVER is normally preferred.
it: Nella maggior parte dei casi, :command:`find_program` viene utilizzato per cercare un eseguibile che verrà poi eseguito, ad es. utilizzando :command:`execute_process` o :command:`add_custom_command`. Quindi nella maggior parte dei casi è richiesto un eseguibile dall'host di build, quindi è preferibile impostare :variable:`CMAKE_FIND_ROOT_PATH_MODE_PROGRAM` a NEVER.

source: This is the same as above, but for the :command:`find_library` command. In most cases this is used to find a library which will then be used for linking, so a library for the target is required. In most cases, it should be set to ONLY.
it: Questo è lo stesso di sopra, ma per il comando :command:`find_library`. Nella maggior parte dei casi questo viene utilizzato per trovare una libreria che verrà poi utilizzata per il link, quindi è necessaria una libreria per il target. Nella maggior parte dei casi, dovrebbe essere impostato su ONLY.

source: This is the same as above and used for both :command:`find_path` and :command:`find_file`. In most cases, this is used for finding include directories, so the target environment should be searched. In most cases, it should be set to ONLY. If you also need to find files in the file system of the build host (e.g. some data files that will be processed during the build); you may need to adjust the behavior for those :command:`find_path` or :command:`find_file` calls using the ``NO_CMAKE_FIND_ROOT_PATH``, ``ONLY_CMAKE_FIND_ROOT_PATH`` and ``CMAKE_FIND_ROOT_PATH_BOTH`` options.
it: Questo è lo stesso di sopra e utilizzato sia per :command:`find_path` che per :command:`find_file`. Nella maggior parte dei casi, viene utilizzato per trovare le directory include, quindi la ricerca deve essere eseguita nell'ambiente target. Nella maggior parte dei casi, dovrebbe essere impostato su ONLY. Se c'è anche bisogno di trovare file nel file system dell'host di build (ad esempio alcuni file di dati che verranno elaborati durante la build); potrebbe essere necessario modificare il comportamento per quelle chiamate a :command:`find_path` o a :command:`find_file` utilizzando le opzioni ``NO_CMAKE_FIND_ROOT_PATH``, ``ONLY_CMAKE_FIND_ROOT_PATH`` e ``CMAKE_FIND_ROOT_PATH_BOTH``.

source: With a toolchain file set up as described, CMake now knows how to handle the target platform and the cross-compiler. We should now able to build software for the target platform. For complex projects, there are more issues that must to be taken care of.
it: Con un file di toolchain impostato come descritto, CMake ora sa come gestire la piattaforma target e il cross-compilatore. Ora dovremmo essere in grado di creare software per la piattaforma target. Per progetti complessi, ci sono più problemi che devono essere risolti.

source: System Inspection
it: Ispezione del Sistema

source: Most portable software projects have a set of system inspection tests for determining the properties of the (target) system. The simplest way to check for a system feature with CMake is by testing variables. For this purpose, CMake provides the variables :variable:`UNIX`, :variable:`WIN32`, and :variable:`APPLE`. When cross-compiling, these variables apply to the target platform, for testing the build host platform there are corresponding variables :variable:`CMAKE_HOST_UNIX`, :variable:`CMAKE_HOST_WIN32`, and :variable:`CMAKE_HOST_APPLE`.
it: La maggior parte dei progetti software portabili dispone di una serie di test di ispezione del sistema per determinarne le proprietà (del target). Il modo più semplice per verificare una funzionalità di sistema con CMake è testare le variabili. A tale scopo, CMake fornisce le variabili :variable:`UNIX`, :variable:`WIN32` e :variable:`APPLE`. Durante la cross-compilazione, queste variabili si applicano alla piattaforma target, per testare la piattaforma host di build ci sono variabili corrispondenti :variable:`CMAKE_HOST_UNIX`, :variable:`CMAKE_HOST_WIN32` e :variable:`CMAKE_HOST_APPLE`.

source: If this granularity is too coarse, the variables :variable:`CMAKE_SYSTEM_NAME`, :variable:`CMAKE_SYSTEM`, :variable:`CMAKE_SYSTEM_VERSION`, and :variable:`CMAKE_SYSTEM_PROCESSOR` can be tested, along with their counterparts :variable:`CMAKE_HOST_SYSTEM_NAME`, :variable:`CMAKE_HOST_SYSTEM`, :variable:`CMAKE_HOST_SYSTEM_VERSION`, and :variable:`CMAKE_HOST_SYSTEM_PROCESSOR`, which contain the same information, but for the build host and not for the target system.
it: Se questa granularità è troppo grossolana, si possono testare le variabili :variable:`CMAKE_SYSTEM_NAME`, :variable:`CMAKE_SYSTEM`, :variable:`CMAKE_SYSTEM_VERSION` e :variable:`CMAKE_SYSTEM_PROCESSOR`, insieme alle loro controparti :variable:`CMAKE_HOST_SYSTEM_NAME`, :variable:`CMAKE_HOST_SYSTEM`, :variable:`CMAKE_HOST_SYSTEM_VERSION` e :variable:`CMAKE_HOST_SYSTEM_PROCESSOR`, che contengono le stesse informazioni, ma per l'host di build e non per il sistema target.

source: Using Compile Checks
it: Utilizzo dei Controlli di Compilazione

source: In CMake, there are macros such as :module:`check_include_files <CheckIncludeFiles>` and :module:`check_c_source_runs <CheckCSourceRuns>` that are used to test the properties of the platform. Most of these macros internally use either the :command:`try_compile` or the :command:`try_run` commands. The :command:`try_compile` command works as expected when cross-compiling; it tries to compile the piece of code with the cross-compiling toolchain, which will give the expected result.
it: In CMake, ci sono macro come :module:`check_include_files <CheckIncludeFiles>` e :module:`check_c_source_runs <CheckCSourceRuns>` che vengono utilizzate per testare le proprietà della piattaforma. La maggior parte di queste macro utilizza internamente il comando :command:`try_compile` o il :command:`try_run`. Il comando :command:`try_compile` funziona come previsto durante la cross-compilazione; tenta di compilare il pezzo di codice con la toolchain di cross-compilazione, che darà il risultato atteso.

source: All tests using :command:`try_run` will not work since the created executables cannot normally run on the build host. In some cases, this might be possible (e.g. using virtual machines, emulation layers like Wine or interfaces to the actual target) as CMake does not depend on such mechanisms. Depending on emulators during the build process would introduce a new set of potential problems; they may have a different view on the file system, use other line endings, require special hardware or software, etc.
it: Tutti i test che utilizzano :command:`try_run` non funzioneranno poiché gli eseguibili creati normalmente non possono essere eseguiti sull'host di build. In alcuni casi, ciò potrebbe essere possibile (ad esempio utilizzando macchine virtuali, layer di emulazione come Wine o interfacce al target effettivo) poiché CMake non dipende da tali meccanismi. La dipendenza dagli emulatori durante il processo di build introdurrebbe una nuova serie di potenziali problemi; possono avere una visione diversa del file system, utilizzare altre terminazioni di riga, richiedere hardware o software speciali, ecc.

source: If :command:`try_run` is invoked when cross-compiling, it will first try to compile the software, which will work the same way as when not cross compiling. If this succeeds, it will check the variable :variable:`CMAKE_CROSSCOMPILING` to determine whether the resulting executable can be executed or not. If it cannot, it will create two cache variables, which then have to be set by the user or via the CMake cache. Assume the command looks like this:
it: Se :command:`try_run` viene invocato durante la cross-compilazione, proverà prima a compilare il software, che funzionerà allo stesso modo di quando non si esegue la cross-compilazione. Se ciò riesce, controllerà la variabile :variable:`CMAKE_CROSSCOMPILING` per determinare se l'eseguibile risultante può essere eseguito o meno. In caso contrario, creerà due variabili di cache, che dovranno essere impostate dall'utente o tramite la cache di CMake. Supponiamo che il comando assomigli a questo:

source: In this example, the source file ``SharedLibraryPathInfo.cxx`` will be compiled and if that succeeds, the resulting executable should be executed. The variable ``SHARED_LIBRARY_PATH_INFO_COMPILED`` will be set to the result of the build, i.e. TRUE or FALSE. CMake will create a cache variable ``SHARED_LIBRARY_PATH_TYPE`` and preset it to ``PLEASE_FILL_OUT-FAILED_TO_RUN``. This variable must be set to what the exit code of the executable would have been if it had been executed on the target. Additionally, CMake will create a cache variable ``SHARED_LIBRARY_PATH_TYPE__TRYRUN_OUTPUT`` and preset it to ``PLEASE_FILL_OUT-NOTFOUND``. This variable should be set to the output that the executable prints to stdout and stderr if it were executed on the target. This variable is only created if the :command:`try_run` command was used with the ``RUN_OUTPUT_VARIABLE`` or the ``OUTPUT_VARIABLE`` argument. You have to fill in the appropriate values for these variables. To help you with this CMake tries its best to give you useful information. To accomplish this CMake creates a file ``${CMAKE_BINARY_DIR}/TryRunResults.cmake``, which you can see an example of here:
it: In questo esempio, il file sorgente ``SharedLibraryPathInfo.cxx`` verrà compilato e, se l'operazione riesce, l'eseguibile risultante dovrebbe essere eseguito. La variabile ``SHARED_LIBRARY_PATH_INFO_COMPILED`` verrà impostata sul risultato della compilazione, ovvero TRUE o FALSE. CMake creerà una variabile cache ``SHARED_LIBRARY_PATH_TYPE`` e la preimposta su ``PLEASE_FILL_OUT-FAILED_TO_RUN``. Questa variabile deve essere impostata su quello che sarebbe stato il codice di uscita dell'eseguibile se fosse stato eseguito sul target. Inoltre, CMake creerà una variabile cache ``SHARED_LIBRARY_PATH_TYPE__TRYRUN_OUTPUT`` preimpostandola su ``PLEASE_FILL_OUT-NOTFOUND``. Questa variabile deve essere impostata sull'output che l'eseguibile stampa su stdout e stderr se è stato eseguito sul target. Questa variabile viene creata solo se il comando :command:`try_run` è stato utilizzato con l'argomento ``RUN_OUTPUT_VARIABLE`` o con ``OUTPUT_VARIABLE``. Si devono inserire i valori appropriati per queste variabili. Per aiutare con questo, CMake fa del suo meglio per dare informazioni utili. Per fare questo CMake crea un file ``${CMAKE_BINARY_DIR}/TryRunResults.cmake``, di cui si può vedere un esempio qui:
