Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: The :command:`ctest_submit` command supports ``PARTS`` and ``FILES`` arguments. With ``PARTS``, you can send any subset of the xml files with each :command:`ctest_submit` call. By default, all available parts are sent with any call to :command:`ctest_submit`. A script can wait until all dashboard stages are complete and then call :command:`ctest_submit` once to send the results of all stages at the end of the run. Alternatively, a script may call :command:`ctest_submit` with ``PARTS`` to do partial submissions of subsets of the results. For example, you can submit configure results after :command:`ctest_configure`, build results after :command:`ctest_build`, and test results after :command:`ctest_test`. This allows for information to be posted as the builds progress.
it: Il comando :command:`ctest_submit` supporta gli argomenti ``PARTS`` e ``FILES``. Con ``PARTS``, si può inviare qualsiasi sottoinsieme dei file xml con ogni chiamata :command:`ctest_submit`. Per default, tutte le parti disponibili vengono inviate con qualsiasi chiamata a :command:`ctest_submit`. Uno script può attendere il completamento di tutte le fasi della dashboard e poi chiamare :command:`ctest_submit` una volta per inviare i risultati di tutte le fasi alla fine dell'esecuzione. In alternativa, uno script può chiamare :command:`ctest_submit` con ``PARTS`` per eseguire invii parziali di sottoinsiemi dei risultati. Ad esempio, si possono inviare i risultati di configurazione dopo :command:`ctest_configure`, i risultati di build dopo :command:`ctest_build` e i risultati di test dopo :command:`ctest_test`. Ciò consente di pubblicare informazioni man mano che le build progrediscono.

source: With ``FILES``, you can send arbitrary XML files to CDash. In addition to the standard build result XML files that CTest sends, CDash also handles a ``Project.xml`` file that describes subprojects and dependencies. Below is an example of a dashboard script that contains a single :command:`ctest_submit` call on its last line
it: Con ``FILES``, si possono inviare file XML arbitrari a CDash. Oltre ai file XML dei risultati di build standard inviati da CTest, CDash gestisce anche un file ``Project.xml`` che descrive sottoprogetti e dipendenze. Di seguito è riportato un esempio di uno script di dashboard che contiene una singola chiamata :command:`ctest_submit` nell'ultima riga

source: Submissions can occur incrementally, with each part of the submission sent piecemeal as it becomes available:
it: Gli invii possono avvenire in modo incrementale, con ciascuna parte dell'invio inviata in modo frammentario non appena diventa disponibile:

source: Submitting incrementally by parts means that you can inspect the results of the configure stage live on the CDash dashboard while the build is still in progress. Likewise, you can inspect the results of the build stage live while the tests are still running. When submitting by parts, it's important to use the ``APPEND`` keyword in the :command:`ctest_build` command. If you don't use ``APPEND``, then CDash will erase any existing build with the same build name, site name, and build stamp when it receives the Build.xml file.
it: L'invio incrementale per parti significa che si possono ispezionare i risultati della fase di configurazione in tempo reale sulla dashboard di CDash mentre la build è ancora in corso. Allo stesso modo, si possono controllare i risultati della fase di build dal vivo mentre i test sono ancora in esecuzione. Quando si invia per parti, è importante utilizzare la parola chiave ``APPEND`` nel comando :command:`ctest_build`. Se non si usa ``APPEND``, CDash cancellerà qualsiasi build esistente con lo stesso nome della build, nome del sito e [stamp] della build quando riceve il file Build.xml.

source: Splitting Your Project into Multiple Subprojects
it: Suddivisione del Progetto in Più Sottoprogetti

source: One :command:`ctest_build` invocation that builds everything, followed by one :command:`ctest_test` invocation that tests everything is sufficient for a project that has no subprojects, but if you want to submit results on a per-subproject basis to CDash, you will have to make some changes to your project and test scripts. For your project you need to identify what targets are part of what subprojects. If you organize your CMakeLists files such that you have a target to build for each subproject, and you can derive (or look up) the name of that target based on the subproject name, then revising your script to separate it into multiple smaller configure/build/test chunks should be relatively painless. To do this, you can modify your CMakeLists files in various ways depending on your needs. The most common changes are listed below.
it: Un'invocazione di :command:`ctest_build` che compila tutto, seguita da un'invocazione di :command:`ctest_test` che verifica tutto è sufficiente per un progetto che non ha sottoprogetti, ma per inviare i risultati in base al sottoprogetto a CDash, sarà necessario apportare alcune modifiche al progetto e agli script di test. Per il progetto si deve identificare quali target fanno parte di quali sottoprogetti. Se si organizzano i file CMakeLists in modo tale da avere un target da creare per ogni sottoprogetto e si può derivare (o cercare) il nome di tale target in base al nome del sottoprogetto, rivedere lo script per separarlo in più configurazioni/build/test più piccoli dovrebbero essere relativamente semplice. Per fare ciò, si possono modificare i file CMakeLists in vari modi a seconda delle esigenze. Le modifiche più comuni sono elencate di seguito.

source: CMakeLists.txt modifications
it: Modifiche a CMakeLists.txt

source: Name targets the same as subprojects, base target names on subproject names, or provide a look up mechanism to map from subproject name to target name.
it: Chiamare i target con lo stesso nome dei sottoprogetti, basare i nomi dei target sui nomi dei sottoprogetti o fornire un meccanismo di ricerca per mappare dal nome del sottoprogetto al nome del target.

source: Possibly add custom targets to aggregate existing targets into subprojects, using :command:`add_dependencies` to say which existing targets the custom target depends on.
it: Possibilmente aggiungere target custom per aggregare target esistenti in sottoprogetti, usando :command:`add_dependencies` per dire da quali target esistenti dipende il target custom.

source: Add the ``LABELS`` target property to targets with a value of the subproject name.
it: Aggiungere la proprietà ``LABELS`` col nome del sottoprogetto come valore ai target.

source: Add the ``LABELS`` test property to tests with a value of the subproject name.
it: Aggiungere la proprietà ``LABELS`` col nome del sottoprogetto come valore ai test.

source: Next, you need to modify your CTest scripts that run your dashboards. To split your one large monolithic build into smaller subproject builds, you can use a :command:`foreach` loop in your CTest driver script. To help you iterate over your subprojects, CDash provides a variable named ``CTEST_PROJECT_SUBPROJECTS`` in ``CTestConfig.cmake``. Given the above example, CDash produces a variable like this:
it: Successivamente, è necessario modificare gli script CTest che eseguono le dashboard. Per suddividere la build monolitica di grandi dimensioni in build di sottoprogetti più piccole, si può utilizzare un ciclo :command:`foreach` nello script del driver CTest. Per scorrere i sottoprogetti, CDash fornisce una variabile denominata ``CTEST_PROJECT_SUBPROJECTS`` in ``CTestConfig.cmake``. Dato l'esempio sopra, CDash produce una variabile come questa:

source: CDash orders the elements in this list such that the independent subprojects (that do not depend on any other subprojects) are first, followed by subprojects that depend only on the independent subprojects, and after that subprojects that depend on those. The same logic continues until all subprojects are listed exactly once in this list in an order that makes sense for building them sequentially, one after the other.
it: CDash ordina gli elementi in questo elenco in modo tale che i sottoprogetti indipendenti (che non dipendono da altri sottoprogetti) siano i primi, seguiti dai sottoprogetti che dipendono solo dai sottoprogetti indipendenti e quindi dai sottoprogetti che dipendono da questi. La stessa logica continua finché tutti i sottoprogetti non vengono elencati esattamente una volta in questo elenco in un ordine che abbia senso per la loro creazione in sequenza, uno dopo l'altro.

source: To facilitate building just the targets associated with a subproject, use the variable named ``CTEST_BUILD_TARGET`` to tell :command:`ctest_build` what to build. To facilitate running just the tests associated with a subproject, assign the ``LABELS`` test property to your tests and use the ``INCLUDE_LABEL`` argument to :command:`ctest_test`.
it: Per facilitare la build solo dei target associati a un sottoprogetto, si usa la variabile chiamata ``CTEST_BUILD_TARGET`` per dire a :command:`ctest_build` cosa buildare. Per facilitare l'esecuzione dei soli test associati a un sottoprogetto, si assegna la proprietà test ``LABELS`` ai test e si usa l'argomento ``INCLUDE_LABEL`` per :command:`ctest_test`.

source: ctest driver script modifications
it: Modifiche allo script del driver ctest

source: Iterate over the subprojects in dependency order (from independent to most dependent...).
it: Scorrere i sottoprogetti in ordine di dipendenza (dall'indipendente al più dipendente...).

source: Set the SubProject and Label global properties -- CTest uses these properties to submit the results to the correct subproject on the CDash server.
it: Impostare le proprietà globali SubProject e Label: CTest utilizza queste proprietà per inviare i risultati al sottoprogetto corretto sul server CDash.

source: Build the target(s) for this subproject: compute the name of the target to build from the subproject name, set ``CTEST_BUILD_TARGET``, call :command:`ctest_build`.
it: Creare il/i target per questo sottoprogetto: calcolare il nome del target da compilare dal nome del sottoprogetto, impostare ``CTEST_BUILD_TARGET``, chiamare :command:`ctest_build`.

source: Run the tests for this subproject using the ``INCLUDE`` or ``INCLUDE_LABEL`` arguments to :command:`ctest_test`.
it: Eseguire i test per questo sottoprogetto utilizzando gli argomenti ``INCLUDE`` o ``INCLUDE_LABEL`` in :command:`ctest_test`.

source: Use :command:`ctest_submit` with the ``PARTS`` argument to submit partial results as they complete.
it: Usare :command:`ctest_submit` con l'argomento ``PARTS`` per inviare risultati parziali man mano che vengono completati.

source: To illustrate this, the following example shows the changes required to split a build into smaller pieces. Assume that the subproject name is the same as the target name required to build the subproject's components. For example, here is a snippet from CMakeLists.txt, in the hypothetical Tutorial project. The only additions necessary (since the target names are the same as the subproject names) are the calls to :command:`set_property` for each target and each test.
it: Per illustrare ciò, l'esempio seguente mostra le modifiche necessarie per suddividere una build in parti più piccole. Si supponga che il nome del sottoprogetto sia lo stesso del nome del target richiesto per creare i componenti del sottoprogetto. Ad esempio, ecco uno snippet da CMakeLists.txt, nell'ipotetico progetto Tutorial. Le uniche aggiunte necessarie (poiché i nomi dei target sono gli stessi dei nomi dei sottoprogetti) sono le chiamate a :command:`set_property` per ogni target e ogni test.

source: Here is an example of what the CTest driver script might look like before and after organizing this project into subprojects. Before the changes
it: Ecco un esempio di come potrebbe apparire lo script del driver CTest prima e dopo l'organizzazione di questo progetto in sottoprogetti. Prima delle modifiche

source: After the changes:
it: Dopo le modifiche:

source: In some projects, more than one :command:`ctest_build` step may be required to build all the pieces of the subproject. For example, in Trilinos, each subproject builds the ``${subproject}_libs target``, and then builds the all target to build all the configured executables in the test suite. They also configure dependencies such that only the executables that need to be built for the currently configured packages build when the all target is built.
it: In alcuni progetti, potrebbe essere necessario più di un passo :command:`ctest_build` per buildare tutti i pezzi del sottoprogetto. Ad esempio, in Trilinos, ogni sottoprogetto compila il ``${subproject}_libs target``, poi compila il target all per compilare tutti gli eseguibili configurati nella suite di test. Inoltre configurano le dipendenze in modo tale che solo gli eseguibili che devono essere compilati per i pacchetti attualmente configurati vengano compilati quando viene compilato il target all.

source: Normally, if you submit multiple ``Build.xml`` files to CDash with the same exact build stamp, it will delete the existing entry and add the new entry in its place. In the case where multiple :command:`ctest_build` steps are required, each with their own :command:`ctest_submit(PARTS Build)` call, use the ``APPEND`` keyword argument in all of the :command:`ctest_build` calls that belong together. The ``APPEND`` flag tells CDash to accumulate the results from multiple submissions and display the aggregation of all of them in one row on the dashboard. From CDash's perspective, multiple :command:`ctest_build` calls (with the same build stamp and subproject and ``APPEND`` turned on) result in a single CDash build.
it: Normalmente, se si inviano più file ``Build.xml`` a CDash con lo stesso [stamp] della build, eliminerà la voce esistente e aggiungerà la nuova voce al suo posto. Nel caso in cui siano richiesti più passaggi :command:`ctest_build`, ciascuno con la propria chiamata :command:`ctest_submit(PARTS Build)`, utilizzare l'argomento chiave ``APPEND`` in tutte le chiamate :command:`ctest_build` che risultano raggruppate. Il flag ``APPEND`` indica a CDash di accumulare i risultati di più invii e di visualizzare l'aggregazione di tutti in una riga sulla dashboard. Dal punto di vista di CDash, più chiamate a :command:`ctest_build` (con lo [stamp] di build e sottoprogetto e ``APPEND`` attivato) risultano in una singola build di CDash.

source: Adopt some of these tips and techniques in your favorite CMake-based project:
it: Adottare alcuni di questi suggerimenti e tecniche nel progetto basato su CMake:

source: ``LABELS`` is a CMake/CTest property that applies to source files, targets and tests. Labels are sent to CDash inside the resulting xml files.
it: ``LABELS`` è una proprietà CMake/CTest che si applica a file sorgenti, target e test. Le etichette vengono inviate a CDash all'interno dei file xml risultanti.

source: Use :command:`ctest_submit(PARTS ...)` to do incremental submissions. Results are available for viewing on the dashboards sooner. Don't forget to use ``APPEND`` in your :command:`ctest_build` calls when submitting by parts.
it: Usare :command:`ctest_submit(PARTS ...)` per effettuare invii incrementali. I risultati sono disponibili per la visualizzazione prima sulle dashboard. Non dimenticare di usare ``APPEND`` nelle chiamate a :command:`ctest_build` quando si invia per parti.

source: Use ``INCLUDE_LABEL`` with :command:`ctest_test` to run only the tests with labels that match the regular expression.
it: Usare ``INCLUDE_LABEL`` con :command:`ctest_test` per eseguire solo i test con etichette che corrispondono all'espressione regolare.

source: Use ``CTEST_BUILD_TARGET`` to build your subprojects one at a time, submitting subproject dashboards along the way.
it: Usare ``CTEST_BUILD_TARGET`` per la build dei sottoprogetti uno alla volta, inviando le dashboard dei sottoprogetti man mano.

source: CMake Cache
it: La Cache di CMake

source: The CMake cache may be thought of as a configuration file. The first time CMake is run on a project, it produces a ``CMakeCache.txt`` file in the top directory of the build tree. CMake uses this file to store a set of global cache variables, whose values persist across multiple runs within a project build tree.
it: La cache di CMake può essere considerata come un file di configurazione. La prima volta che CMake viene eseguito su un progetto, produce un file ``CMakeCache.txt`` nella directory superiore dell'albero di build. CMake usa questo file per archiviare un set di variabili globali della cache, i cui valori persistono su più esecuzioni all'interno di un albero di build del progetto.

source: There are a few purposes of this cache. The first is to store the user's selections and choices, so that if they should run CMake again they will not need to reenter that information. For example, the :command:`option` command creates a Boolean variable and stores it in the cache.
it: Ci sono alcuni scopi di tale cache. Il primo è memorizzare le selezioni e le scelte dell'utente, in modo che se dovesse eseguire nuovamente CMake non dovrà reinserire tali informazioni. Ad esempio, il comando :command:`option` crea una variabile booleana e la memorizza nella cache.

source: The above line would create a variable called ``USE_JPEG`` and put it into the cache. That way the user can set that variable from the user interface and its value will remain in case the user should run CMake again in the future. To create a variable in the cache, use commands like :command:`option`, :command:`find_file`, or the standard :command:`set` command with the ``CACHE`` option.
it: La riga precedente crea una variabile chiamata ``USE_JPEG`` e la inserisce nella cache. In questo modo l'utente può impostare tale variabile dall'interfaccia utente e il suo valore rimarrà nel caso in cui l'utente debba eseguire nuovamente CMake in futuro. Per creare una variabile nella cache, si usano comandi come :command:`option`, :command:`find_file`, o il comando standard :command:`set` con l'opzione ``CACHE``.

source: When you use the ``CACHE`` option, you may also provide the type of the variable and a documentation string. The type of the variable is used by the :manual:`cmake-gui <cmake-gui(1)>` to control how that variable is set and displayed, but the value is always stored in the cache file as a string.
it: Quando si usa l'opzione ``CACHE``, si può anche fornire il tipo di variabile e una stringa di documentazione. Il tipo della variabile è usato da :manual:`cmake-gui <cmake-gui(1)>` per controllare come la variabile è impostata e visualizzata, ma il valore è sempre memorizzato nel file di cache come una stringa.

source: Another purpose of the cache is to allow CMake itself to persistently store values between CMake runs. These entries may not be visible or adjustable by the user. Typically, these values are system-dependent variables that require CMake to compile and run a program to determine their value. Once these values have been determined, they are stored in the cache to avoid having to recompute them every time CMake is run. CMake generally tries to limit these variables to properties that should never change (such as the byte order of the machine you are on). If you significantly change your computer, either by changing the operating system or switching to a different compiler, you will need to delete the cache file (and probably all of your binary tree's object files, libraries, and executables).
it: Un altro scopo della cache è consentire a CMake stesso di archiviare in modo persistente i valori tra le sue esecuzioni. Queste voci potrebbero non essere visibili o modificabili dall'utente. In genere, questi valori sono variabili dipendenti dal sistema che richiedono a CMake di compilare ed eseguire un programma per determinarne il valore. Una volta che questi valori sono stati determinati, vengono archiviati nella cache per evitare di doverli ricalcolare ogni volta che viene eseguito CMake. CMake generalmente cerca di limitare queste variabili a proprietà che non dovrebbero mai cambiare (come l'ordine dei byte della macchina su cui ci si trova). Se si modifichi in modo significativo il computer, modificando il sistema operativo o passando a un compilatore diverso, si dovrà eliminare il file cache (e probabilmente tutti i file oggetto, le librerie e gli eseguibili dell'albero binario).

source: Some projects are very complex and setting one value in the cache may cause new options to appear the next time the cache is built. For example, VTK supports the use of MPI for performing distributed computing. This requires the build process to determine where the MPI libraries and header files are and to let the user adjust their values. But MPI is only available if another option ``VTK_USE_PARALLEL`` is first turned on in VTK. So, to avoid confusion for people who don't know what MPI is, those options are hidden until ``VTK_USE_PARALLEL`` is turned on. So CMake shows the ``VTK_USE_PARALLEL`` option in the cache area, if the user turns that on and re-configures with CMake, new options will appear for MPI that they can then set. The rule is to keep building the cache until it doesn't change. For most projects this will be just once. For some complicated ones it may be twice or more.
it: Alcuni progetti sono molto complessi e l'impostazione di un valore nella cache potrebbe far apparire nuove opzioni la prossima volta che la cache viene creata. Ad esempio, VTK supporta l'uso di MPI per eseguire il calcolo distribuito. Ciò richiede che il processo di compilazione determini dove si trovano le librerie MPI e i file header e permetta all'utente di aggiustarne i valori. Ma MPI è disponibile solo se un'altra opzione ``VTK_USE_PARALLEL`` viene attivata prima in VTK. Quindi, per evitare confusione per le persone che non sanno cosa sia MPI, queste opzioni sono nascoste finché ``VTK_USE_PARALLEL`` non viene attivato. Quindi CMake mostra l'opzione ``VTK_USE_PARALLEL`` nell'area della cache, se l'utente la attiva e si riconfigura con CMake, appariranno nuove opzioni per MPI che si possono poi impostare. La regola è continuare il build della cache finché non cambia. Per la maggior parte dei progetti questo avverrà solo una volta. Per alcuni più complicati potrebbe essere due o più.

source: You might be tempted to edit the cache file directly, or to "initialize" a project by giving it a pre-populated ``CMakeCache.txt`` file. This may not work and could cause additional problems in the future. First, the syntax of the CMake cache is subject to change. Second, cache files contain full paths which make them unsuitable for moving between binary trees.
it: Si potrebbe essere tentati di modificare direttamente il file della cache o di "inizializzare" un progetto fornendogli un file ``CMakeCache.txt`` pre-popolato. Questo potrebbe non funzionare e potrebbe causare ulteriori problemi in futuro. Innanzitutto, la sintassi della cache CMake è soggetta a cambiamenti. In secondo luogo, i file di cache contengono path completi che li rendono inadatti allo spostamento tra alberi binari.
