Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: If this option is specified, then the output of the test is checked against the regular expression provided (a list of regular expressions may be passed in as well). If none of the regular expressions match, then the test will fail. If at least one of them matches, then the test will pass.
it: Se questa opzione è specificata, l'output del test viene confrontato con l'espressione regolare fornita (si può passare anche un elenco di espressioni regolari). Se nessuna delle espressioni regolari corrisponde, il test fallirà. Se almeno uno di essi corrisponde, il test passerà.

source: If this option is specified, then the output of the test is checked against the regular expression provided (a list of regular expressions may be passed in as well). If none of the regular expressions match, then the test will pass. If at least one of them matches, then the test will fail.
it: Se questa opzione è specificata, l'output del test viene confrontato con l'espressione regolare fornita (si può passare anche un elenco di espressioni regolari). Se nessuna delle espressioni regolari corrisponde, il test passerà. Se almeno uno di essi corrisponde, il test fallirà.

source: If both :prop_test:`PASS_REGULAR_EXPRESSION` and :prop_test:`FAIL_REGULAR_EXPRESSION` are specified, then the :prop_test:`FAIL_REGULAR_EXPRESSION` takes precedence. The following example illustrates using the :prop_test:`PASS_REGULAR_EXPRESSION` and :prop_test:`FAIL_REGULAR_EXPRESSION`:
it: Se sono specificati sia :prop_test:`PASS_REGULAR_EXPRESSION` che :prop_test:`FAIL_REGULAR_EXPRESSION`, allora ha la precedenza :prop_test:`FAIL_REGULAR_EXPRESSION`. L'esempio seguente illustra l'utilizzo di :prop_test:`PASS_REGULAR_EXPRESSION` e di :prop_test:`FAIL_REGULAR_EXPRESSION`:

source: Testing Using CTest
it: Test Con CTest

source: When you run the tests from your build environment, what really happens is that the build environment runs :manual:`CTest <ctest(1)>`. :manual:`CTest <ctest(1)>` is an executable that comes with CMake; it handles running the tests for the project. While CTest works well with CMake, you do not have to use CMake in order to use CTest. The main input file for CTest is called ``CTestTestfile.cmake``. This file will be created in each directory that was processed by CMake (typically every directory with a CMakeLists file). The syntax of ``CTestTestfile.cmake`` is like the regular CMake syntax, with a subset of the commands available. If CMake is used to generate testing files, they will list any subdirectories that need to be processed as well as any :command:`add_test` calls. The subdirectories are those that were added by the :command:`add_subdirectory` commands. CTest can then parse these files to determine what tests to run. An example of such a file is shown below:
it: Quando si eseguono i test dall'ambiente di build, ciò che realmente accade è che tale ambiente esegue :manual:`CTest <ctest(1)>`. :manual:`CTest <ctest(1)>` è un eseguibile fornito con CMake; gestisce l'esecuzione dei test per progetto. Mentre CTest funziona bene con CMake, non è necessario utilizzare CMake per utilizzare CTest. Il file di input principale per CTest si chiama ``CTestTestfile.cmake``. Questo file verrà creato in ogni directory elaborata da CMake (in genere ogni directory con un file CMakeLists). La sintassi di ``CTestTestfile.cmake`` è come quella di CMake, con un sottoinsieme dei comandi disponibili. Se CMake viene utilizzato per generare file di test, verranno elencate tutte le sottodirectory che devono essere elaborate così come qualsiasi chiamata :command:`add_test`. Le sottodirectory sono quelle aggiunte dai comandi :command:`add_subdirectory`. CTest può quindi analizzare questi file per determinare quali test eseguire. Un esempio di tale file è mostrato di seguito:

source: When CTest parses the ``CTestTestfile.cmake`` files, it will extract the list of tests from them. These tests will be run, and for each test CTest will display the name of the test and its status. Consider the following sample output::
it: Quando CTest analizza i file ``CTestTestfile.cmake``, ne estrae l'elenco dei test. Questi test verranno eseguiti e per ogni test CTest visualizzerà il nome del test e il suo stato. Si consideri il seguente output di esempio::

source: CTest is run from within your build tree. It will run all the tests found in the current directory as well as any subdirectories listed in the ``CTestTestfile.cmake``. For each test that is run CTest will report if the test passed and how long it took to run the test.
it: CTest viene eseguito dall'interno dell'albero di build. Eseguirà tutti i test trovati nella directory corrente e in tutte le sottodirectory elencate in ``CTestTestfile.cmake``. Per ogni test eseguito, CTest riporterà se il test è stato superato e quanto tempo è stato necessario per eseguirlo.

source: The CTest executable includes some handy command line options to make testing a little easier. We will start by looking at the options you would typically use from the command line.
it: L'eseguibile CTest include alcune utili opzioni della riga di comando per semplificare un po' i test. Inizieremo esaminando le opzioni che si userebbero normalmente dalla riga di comando.

source: The ``-R`` option is probably the most commonly used. It allows you to specify a regular expression; only the tests with names matching the regular expression will be run. Using the ``-R`` option with the name (or part of the name) of a test is a quick way to run a single test. The ``-E`` option is similar except that it excludes all tests matching the regular expression. The ``-L`` and ``-LE`` options are similar to ``-R`` and ``-E``, except that they apply to test labels that were set using the :command:`set_property` command described previously. The ``-C`` option is mainly for IDE builds where you might have multiple configurations, such as Release and Debug in the same tree. The argument following the ``-C`` determines which configuration will be tested. The ``-V`` argument is useful when you are trying to determine why a test is failing. With ``-V``, CTest will print out the command line used to run the test, as well as any output from the test itself. The ``-V`` option can be used with any invocation of CTest to provide more verbose output. The ``-N`` option is useful if you want to see what tests CTest would run without actually running them.
it: L'opzione ``-R`` è probabilmente la più usata. Permette di specificare un'espressione regolare; verranno eseguiti solo i test con nomi corrispondenti all'espressione regolare. L'utilizzo dell'opzione ``-R`` con il nome (o parte del nome) di un test è un modo rapido per eseguire un singolo test. L'opzione ``-E`` è simile, tranne per il fatto che esclude tutti i test che corrispondono all'espressione regolare. Le opzioni ``-L`` e ``-LE`` sono simili a ``-R`` e ``-E``, tranne per il fatto che si applicano alle etichette impostate utilizzando il comando :command:`set_property` descritto in precedenza. L'opzione ``-C`` è principalmente per le build con IDE in cui si potrebbero avere più configurazioni, come Release e Debug nello stesso albero. L'argomento che segue ``-C`` determina quale configurazione verrà testata. L'argomento ``-V`` è utile quando si cerca di determinare perché un test fallisce. Con ``-V``, CTest stamperà la riga di comando utilizzata per eseguire il test, nonché qualsiasi output del test stesso. L'opzione ``-V`` può essere utilizzata con qualsiasi invocazione di CTest per fornire un output più dettagliato. L'opzione ``-N`` è utile per vedere quali test verrebbero eseguiti da CTest senza eseguirli effettivamente.

source: Running the tests and making sure they all pass before committing any changes to the software is a sure-fire way to improve your software quality and development process. Unfortunately, for large projects the number of tests and the time required to run them may be prohibitive. In these situations the ``-I`` option of CTest can be used. The ``-I`` option allows you to flexibly specify a subset of the tests to run. For example, the following invocation of CTest will run every seventh test.
it: Eseguire i test e assicurarsi che passino tutti prima di confermare qualsiasi modifica al software è un modo infallibile per migliorare la qualità del software e il processo di sviluppo. Sfortunatamente, per progetti di grandi dimensioni il numero di test e il tempo necessario per eseguirli possono essere proibitivi. In queste situazioni può essere utilizzata l'opzione ``-I`` di CTest. L'opzione ``-I`` consente di specificare in modo flessibile un sottoinsieme dei test da eseguire. Ad esempio, la seguente chiamata di CTest verrà eseguita ogni settimo test.

source: While this is not as good as running every test, it is better than not running any and it may be a more practical solution for many developers. Note that if the start and end arguments are not specified, as in this example, then they will default to the first and last tests. In another example, assume that you always want to run a few tests plus a subset of the others. In this case you can explicitly add those tests to the end of the arguments for ``-I``. For example::
it: Anche se questo non è buono come eseguire tutti i test, è meglio che non eseguirne nessuno e potrebbe essere una soluzione più pratica per molti sviluppatori. Si noti che se gli argomenti start e end non sono specificati, come in questo esempio, per default verranno utilizzati il primo e l'ultimo test. In un altro esempio, si supponga di voler sempre eseguire alcuni test più un sottoinsieme degli altri. In questo caso si possono aggiungere esplicitamente quei test alla fine degli argomenti per ``-I``. Per esempio::

source: will run tests 1, 2, 3, and 10, plus every fifth test. You can pass as many test numbers as you want after the stride argument.
it: eseguirà i test 1, 2, 3 e 10, più ogni quinto test. Si possono passare tutti i numeri di test desiderati dopo l'argomento di Stride.

source: Using CTest to Drive Complex Tests
it: Utilizzo di CTest per Pilotare Test Complessi

source: Sometimes to properly test a project you need to actually compile code during the testing phase. There are several reasons for this. First, if test programs are compiled as part of the main project, they can end up taking up a significant amount of the build time. Also, if a test fails to build, the main build should not fail as well. Finally, IDE projects can quickly become too large to load and work with. The CTest command supports a group of command line options that allow it to be used as the test executable to run. When used as the test executable, CTest can run CMake, run the compile step, and finally run a compiled test. We will now look at the command line options to CTest that support building and running tests.
it: A volte per testare correttamente un progetto è necessario compilare effettivamente il codice durante la fase di test. Ci sono diverse ragioni per questo. Innanzitutto, se i programmi di test vengono compilati come parte del progetto principale, possono finire per occupare una quantità significativa del tempo di building. Inoltre, se un test fallisce, la build principale non dovrebbe fallire. Infine, i progetti IDE possono diventare rapidamente troppo grandi per essere caricati e utilizzati. Il comando CTest supporta un gruppo di opzioni della riga di comando che ne consentono l'utilizzo come eseguibile di test da eseguire. Se utilizzato come eseguibile di test, CTest può eseguire CMake, eseguire il passo della compilazione e infine eseguire un test compilato. Esamineremo ora le opzioni della riga di comando di CTest che supportano la creazione e l'esecuzione di test.

source: For an example, consider the following :command:`add_test` command taken from the CMakeLists.txt file of CMake itself. It shows how CTest can be used both to compile and run a test.
it: Ad esempio, si consideri il seguente comando :command:`add_test` preso dal file CMakeLists.txt di CMake stesso. Esso mostra come CTest è utilizzabile sia per compilare che per eseguire un test.

source: In this example, the :command:`add_test` command is first passed the name of the test, "simple". After the name of the test, the command to be run is specified. In this case, the test command to be run is CTest. The CTest command is referenced via the :variable:`CMAKE_CTEST_COMMAND` variable. This variable is always set by CMake to the CTest command that came from the CMake installation used to build the project. Next, the source and binary directories are specified. The next options to CTest are the ``--build-generator`` and ``--build-makeprogram`` options. These are specified using the CMake variables :variable:`CMAKE_MAKE_PROGRAM` and :variable:`CMAKE_GENERATOR`. Both :variable:`CMAKE_MAKE_PROGRAM` and :variable:`CMAKE_GENERATOR` are defined by CMake. This is an important step as it makes sure that the same generator is used for building the test as was used for building the project itself. The ``--build-project`` option is passed ``Simple``, which corresponds to the :command:`project` command used in the Simple test. The final argument is the ``--test-command`` which tells CTest the command to run once it gets a successful build, and should be the name of the executable that will be compiled by the test.
it: In questo esempio, al comando :command:`add_test` viene prima passato il nome del test, "simple". Dopo il nome del test, viene specificato il comando da eseguire. In questo caso, il comando di test da eseguire è CTest. Il comando CTest viene referenziato tramite la variabile :variable:`CMAKE_CTEST_COMMAND`. Questa variabile è sempre impostata da CMake sul comando CTest proveniente dall'installazione di CMake utilizzata per creare il progetto. Successivamente, vengono specificate le directory dei sorgenti e quella dei binari. Le opzioni successive a CTest sono le ``--build-generator`` e ``--build-makeprogram``. Questi vengono specificate utilizzando le variabili CMake :variable:`CMAKE_MAKE_PROGRAM` e :variable:`CMAKE_GENERATOR`. Sia :variable:`CMAKE_MAKE_PROGRAM` che :variable:`CMAKE_GENERATOR` sono definiti da CMake. Questo è un passaggio importante in quanto garantisce che per la creazione del test venga utilizzato lo stesso generatore utilizzato per la creazione del progetto stesso. L'opzione ``--build-project`` viene passata ``Simple``, che corrisponde al comando :command:`project` utilizzato nel test Simple. L'argomento finale è ``--test-command`` che indica a CTest il comando da eseguire dopo una compilazione riuscita e dovrebbe essere il nome dell'eseguibile che verrà compilato dal test.

source: Handling a Large Number of Tests
it: Gestire un Gran Numero di Test

source: When a large number of tests exist in a single project, it is cumbersome to have individual executables available for each test. That said, the developer of the project should not be required to create tests with complex argument parsing. This is why CMake provides a convenience command for creating a test driver program. This command is called :command:`create_test_sourcelist`. A test driver is a program that links together many small tests into a single executable. This is useful when building static executables with large libraries to shrink the total required size. The signature for :command:`create_test_sourcelist` is as follows:
it: Quando esiste un numero elevato di test in un singolo progetto, è ingombrante disporre di singoli eseguibili per ciascun test. Detto questo, allo sviluppatore del progetto non dovrebbe essere richiesto di creare test con l'analisi [parsing] di argomenti complessi. Questo è il motivo per cui CMake fornisce un comodo comando per la creazione di un programma di test driver. Questo comando si chiama :command:`create_test_sourcelist`. Un test driver è un programma che collega insieme molti piccoli test in un singolo eseguibile. Ciò è utile quando si creano eseguibili statici con librerie di grandi dimensioni per ridurre la dimensione totale richiesta. La firma per :command:`create_test_sourcelist` è la seguente:

source: The first argument is the variable which will contain the list of source files that must be compiled to make the test executable. The DriverName is the name of the test driver program (e.g. the name of the resulting executable). The rest of the arguments consist of a list of test source files. Each test source file should have a function in it that has the same name as the file with no extension (``foo.cxx`` should have ``int foo(argc, argv);``). The resulting executable will be able to invoke each of the tests by name on the command line. The ``EXTRA_INCLUDE`` and ``FUNCTION`` arguments support additional customization of the test driver program. Consider the following CMakeLists file fragment to see how this command can be used:
it: Il primo argomento è la variabile che conterrà l'elenco dei sorgenti che dovranno essere compilati per rendere eseguibile il test. DriverName è il nome del programma del test driver (ad esempio il nome dell'eseguibile risultante). Il resto degli argomenti è costituito da un elenco dei file sorgenti del test. Ogni sorgente del test dovrebbe contenere una funzione che abbia lo stesso nome del file senza estensione (``foo.cxx`` dovrebbe avere ``int foo(argc, argv);``). L'eseguibile risultante sarà in grado di richiamare ciascuno dei test per nome sulla riga di comando. Gli argomenti ``EXTRA_INCLUDE`` e ``FUNCTION`` supportano un'ulteriore personalizzazione del programma del test driver. Consideriamo il seguente frammento di file CMakeLists per vedere come questo comando può essere utilizzato:

source: The :command:`create_test_sourcelist` command is invoked to create a test driver. In this case it creates and writes ``CommonCxxTests.cxx`` into the binary tree of the project, using the rest of the arguments to determine its contents. Next, the :command:`add_executable` command is used to add that executable to the build. Then a new variable called ``TestsToRun`` is created with an initial value of the sources required for the test driver. The :command:`remove` command is used to remove the driver program itself from the list. Then, a :command:`foreach` command is used to loop over the remaining sources. For each source, its name without a file extension is extracted and put in the variable ``TName``, then a new test is added for ``TName``. The end result is that for each source file in the :command:`create_test_sourcelist` an :command:`add_test` command is called with the name of the test. As more tests are added to the :command:`create_test_sourcelist` command, the :command:`foreach` loop will automatically call :command:`add_test` for each one.
it: Il comando :command:`create_test_sourcelist` viene richiamato per creare un test driver. In questo caso crea e scrive ``CommonCxxTests.cxx`` nell'albero binario del progetto, usando il resto degli argomenti per determinarne il contenuto. Successivamente, il comando :command:`add_executable` viene utilizzato per aggiungere l'eseguibile alla build. Quindi viene creata una nuova variabile chiamata ``TestsToRun`` con un valore iniziale delle fonti richieste per il test driver. Il comando :command:`remove` viene utilizzato per rimuovere il programma driver stesso dall'elenco. Quindi, viene utilizzato un comando :command:`foreach` per eseguire il ciclo sui sorgenti rimanenti. Per ogni sorgente, il suo nome di file senza estensione viene estratto e inserito nella variabile ``TName``, poi viene aggiunto un nuovo test per ``TName``. Il risultato finale è che per ogni sorgente in :command:`create_test_sourcelist` viene chiamato un comando :command:`add_test` con il nome del test. Man mano che vengono aggiunti più test al comando :command:`create_test_sourcelist`, il ciclo :command:`foreach` chiamerà automaticamente :command:`add_test` per ognuno.

source: Managing Test Data
it: Gestione dei Dati di Test

source: In addition to handling large numbers of tests, CMake contains a system for managing test data. It is encapsulated in an :module:`ExternalData` CMake module, downloads large data on an as-needed basis, retains version information, and allows distributed storage.
it: Oltre a gestire un gran numero di test, CMake contiene un sistema per la gestione dei dati dei test. È incapsulato in un modulo CMake :module:`ExternalData`, scarica dati di grandi dimensioni in base alle necessità, conserva le informazioni sulla versione e consente l'archiviazione distribuita.

source: The design of the :module:`ExternalData` follows that of distributed version control systems using hash-based file identifiers and object stores, but it also takes advantage of the presence of a dependency-based build system. The figure below illustrates the approach. Source trees contain lighweight "content links" referencing data in remote storage by hashes of their content. The :module:`ExternalData` module produces build rules to download the data to local stores and reference them from build trees by symbolic links (copies on Windows).
it: Il design di :module:`ExternalData` segue quello dei sistemi di controllo della versione distribuiti che utilizzano identificatori di file basati su hash e archivi di oggetti, ma sfrutta anche la presenza di un sistema di build basato sulle dipendenze. La figura seguente illustra l'approccio. Le strutture dei sorgenti contengono "collegamenti ai contenuti" leggeri, che fanno riferimento ai dati nell'archiviazione remota tramite hash del loro contenuto. Il modulo :module:`ExternalData` produce regole di build per scaricare i dati negli archivi locali e farvi riferimento da alberi di build tramite link simbolici (copie su Windows).

source: ExternalData module flow chart
it: Diagramma di flusso del modulo ExternalData

source: A content link is a small, plain text file containing a hash of the real data. Its name is the same as its data file, with an additional extension identifying the hash algorithm e.g. img.png.md5. Content links always take the same (small) amount of space in the source tree regardless of the real data size. The CMakeLists.txt CMake configuration files refer to data using a DATA{} syntax inside calls to the :module:`ExternalData` module API. For example, DATA{img.png} tells the :module:`ExternalData` module to make img.png available in the build tree even if only a img.png.md5 content link appears in the source tree.
it: Un link al contenuto è un piccolo file di semplice testo contenente un hash dei dati reali. Il suo nome è lo stesso del suo file di dati, con un'estensione aggiuntiva che identifica l'algoritmo di hash, ad es. img.png.md5. I link ai contenuti occupano sempre la stessa (piccola) quantità di spazio nell'albero dei sorgenti, indipendentemente dalla dimensione reale dei dati. I file di configurazione CMake CMakeLists.txt fanno riferimento ai dati utilizzando una sintassi DATA{} all'interno delle chiamate all'API del modulo :module:`ExternalData`. Ad esempio, DATA{img.png} dice al modulo :module:`ExternalData` di rendere disponibile img.png nell'albero di build anche se nell'albero dei sorgenti appare solo un link di contenuto img.png.md5.
