Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: The build time graph displays the time required to build a project over time.
it: Il grafico del tempo di build mostra il tempo necessario per buildare un progetto nel tempo.

source: The test time graphs display the time to run a specific test as well as its status (passed/failed) over time.
it: I grafici del tempo del test mostrano il tempo necessario per eseguire un test specifico e il suo stato (superato/fallito) nel tempo.

source: Adding Notes to a Build
it: Aggiunta di note a una build

source: In some cases, it is useful to inform other developers that someone is currently looking at the errors for a build.
it: In alcuni casi, è utile informare altri sviluppatori che qualcuno sta esaminando gli errori di una build.

source: CDash supports an internal logging mechanism using the error_log() PHP function. Any critical SQL errors are logged. By default, the CDash log file is located in the backup directory under the name ``cdash.log``. The location of the log file can be modified by changing the variable in the ``config.local.php`` configuration file.
it: CDash supporta un meccanismo di log interno che usa la funzione PHP error_log(). Tutti gli errori SQL critici vengono loggati. Per default, il file di log di CDash si trova nella directory di backup con il nome ``cdash.log``. La posizione del file di log può essere modificata cambiando la variabile nel file di configurazione ``config.local.php``.

source: The log file can be accessed directly from CDash if the log file is in the standard location.
it: È possibile accedere al file di log direttamente da CDash se il file si trova nella posizione standard.

source: A log rotation mechanism which allows users to cap the current log file to a certain size is available.
it: È disponibile un meccanismo di rotazione del log che consente agli utenti di limitare il file di log corrente a una determinata dimensione.

source: Test Timing
it: Test dei Tempi

source: CDash supports checks on the duration of tests. CDash keeps the current weighted average of the mean and standard deviation for the time each test takes to run in the database. In order to keep the computation as efficient as possible the following formula is used, which only involves the previous build.
it: CDash supporta i controlli sulla durata dei test. CDash mantiene, nel database, la media ponderata corrente della media e della deviazione standard per il tempo impiegato da ciascun test per essere eseguito. Per mantenere il calcolo il più efficiente possibile viene utilizzata la seguente formula, che coinvolge solo la build precedente.

source: A test is defined as having failed timing based on the following logic::
it: Un test è definito come temporizzazione fallita in base alla seguente logica::

source: Mobile Support
it: Supporto Mobile

source: Since CDash is written using template layers via XSLT, developing new layouts is as simple as adding new rendering templates. As a demonstration, an iPhone web template is provided with the current version of CDash.
it: Dal momento che CDash è scritto utilizzando layer di template tramite XSLT, sviluppare nuovi layout è semplice come aggiungere nuovi template di rendering. A titolo dimostrativo, viene fornito un template Web per iPhone con la versione corrente di CDash.

source: The main page shows a list of the public projects hosted on the server. Clicking on the name of a project loads its current dashboard. In the same manner, clicking on a given build displays more detailed information about that build. As of this writing, the ability to login and to access private sections of CDash are not supported with this layout.
it: La pagina principale mostra un elenco dei progetti pubblici ospitati sul server. Facendo clic sul nome di un progetto viene caricata la sua dashboard corrente. Allo stesso modo, clickando su una determinata build vengono visualizzate informazioni più dettagliate su di essa. Al momento della stesura di questo documento, la possibilità di effettuare il login e di accedere alle sezioni private di CDash non è supportata con questo layout.

source: Backing up CDash
it: Backup di CDash

source: All of the data (except the logs) used by CDash is stored in its database. It is important to backup the database regularly, especially so before performing a CDash upgrade. There are a couple of ways to backup a MySQL database. The easiest is to use the `mysqldump <http://dev.mysql.com/doc/refman/5.1/en/mysqldump.html>`__ command::
it: Tutti i dati (tranne i log) utilizzati da CDash sono archiviati nel suo database. È importante eseguire regolarmente il backup del database, soprattutto prima di eseguire un aggiornamento di CDash. Ci sono un paio di modi per eseguire il backup di un database MySQL. Il più semplice è utilizzare il comando `mysqldump <http://dev.mysql.com/doc/refman/5.1/en/mysqldump.html>`__::

source: If you are using MyISAM tables exclusively, you can copy the CDash directory in your MySQL data directory. Note that you need to shutdown MySQL before doing the copy so that no file could be changed during the copy. Similarly to MySQL, PostGreSQL has a pg_dump utility::
it: Se si usano esclusivamente tabelle MyISAM, si può copiare la directory CDash nella directory dei dati MySQL. Si noti che è necessario effettuare lo shutdown di MySQL prima di eseguire la copia in modo che nessun file possa essere modificato durante la copia. Analogamente a MySQL, PostGreSQL ha un'utilità pg_dump::

source: Upgrading CDash
it: Aggiornamento di CDash

source: When a new version of CDash is released or if you decide to update from the repository, CDash will warn you on the front page if the current database needs to be upgraded. When upgrading to a new release version the following steps should be taken:
it: Quando viene rilasciata una nuova versione di CDash o si decide di aggiornare dal repository, CDash avviserà in prima pagina se il database corrente deve essere aggiornato. Quando si esegue l'aggiornamento a una nuova versione di rilascio, è necessario eseguire i seguenti passaggi:

source: Backup your SQL database (see previous section).
it: Eseguire il backup del database SQL (vedere la sezione precedente).

source: Backup your ``config.local.php`` (or ``config.php``) configuration files.
it: Eseguire il backup dei file di configurazione ``config.local.php`` (o ``config.php``).

source: Replace your current cdash directory with the latest version and copy the ``config.local.php`` in the cdash directory.
it: Sostituisci l'attuale directory cdash con l'ultima versione e copiare ``config.local.php`` nella directory di cdash.

source: Navigate your browser to your CDash page. (e.g. http://localhost/CDash).
it: Naviga nel browser fino alla pagina CDash. (ad esempio http://localhost/CDash).

source: Note the version number on the main page, it should match the version that you are upgrading to.
it: Annotare il numero di versione sulla pagina principale, dovrebbe corrispondere a quella a cui si sta effettuando l'aggiornamento.

source: The following message may appear: "The current database schema doesn't match the version of CDash you are running, upgrade your database structure in the Administration panel of CDash." This is a helpful reminder to perform the following steps.
it: Potrebbe apparire il seguente messaggio: "The current database schema doesn't match the version of CDash you are running, upgrade your database structure in the Administration panel of CDash". Questo è un utile promemoria per eseguire i seguenti passaggi.

source: Login to CDash as administrator.
it: Accedere a CDash come amministratore.

source: In the 'Administration' section, click on '[CDash Maintenance]'.
it: Nella sezione 'Administration', clickare su '[CDash Maintenance]'.

source: Click on 'Upgrade CDash': this process might take some time depending on the size of your database (do not close your browser).
it: Clickare su 'Upgrade CDash': questo processo potrebbe richiedere del tempo a seconda delle dimensioni del database (non chiudere il browser).

source: Progress messages may appear while CDash performs the upgrade.
it: I messaggi di avanzamento possono essere visualizzati mentre CDash esegue l'aggiornamento.

source: If the upgrade process takes too long you can check in the ``backup/cdash.log`` file to see where the process is taking a long time and/or failing.
it: Se il processo di aggiornamento richiede troppo tempo, si può controllare nel file ``backup/cdash.log`` per vedere dove il processo impiega molto tempo e/o fallisce.

source: It has been reported that on some systems the spinning icon never turns into a check mark. Please check the ``cdash.log`` for the "Upgrade done." string if you feel that the upgrade is taking too long.
it: È stato segnalato che su alcuni sistemi l'icona rotante non si trasforma mai in un segno di spunta. Controllare ``cdash.log`` per la stringa "Upgrade done." se si ritiene che l'aggiornamento richieda troppo tempo.

source: On a 50GB database the upgrade might take up to 2 hours.
it: Su un database da 50 GB l'aggiornamento potrebbe richiedere fino a 2 ore.

source: Some web browsers might have issues when upgrading (with some javascript variables not being passed correctly), in that case you can perform individual updates. For example, upgrading from CDash 1-2 to 1-4::
it: Alcuni browser Web potrebbero avere problemi durante l'aggiornamento (con alcune variabili javascript non passate correttamente), in tal caso è possibile eseguire singoli aggiornamenti. Ad esempio, l'aggiornamento da CDash 1-2 a 1-4::

source: CDash Maintenance
it: Manutenzione di CDash

source: Database maintenance: we recommend that you perform database optimization (reindexing, purging, etc.) regularly to maintain a stable database. MySQL has a utility called ``mysqlcheck``, and PostgreSQL has several utilities such as ``vacuumdb``.
it: Manutenzione del database: si consiglia di eseguire regolarmente l'ottimizzazione del database (re-indicizzazione, purging, ecc.) per mantenere un database stabile. MySQL ha un'utilità chiamata ``mysqlcheck`` e PostgreSQL ha diverse utilità come ``vacuumdb``.

source: Deleting builds with incorrect dates: some builds might be submitted to CDash with the wrong date, either because the date in the XML file is incorrect or the timezone was not recognized by CDash (mainly by PHP). These builds will not show up in any dashboard because the start time is bogus. In order to remove these builds:
it: Eliminazione di build con date errate: alcune build potrebbero essere inviate a CDash con la data errata, o perché la data nel file XML non è corretta o perché il fuso orario non è stato riconosciuto da CDash (principalmente da PHP). Queste build non verranno visualizzate in nessuna dashboard perché l'ora di inizio è bacata. Per rimuovere queste build:

source: Click on [CDash maintenance] in the administration section.
it: Clickare su [CDash maintenance] nella sezione administration.

source: Click on 'Delete builds with wrong start date'.
it: Clickare su 'Delete builds with wrong start date'.

source: Recompute test timing: if you just upgraded CDash you might notice that the current submissions are showing a high number of failing test due to time defects. This is because CDash does not have enough sample points to compute the mean and standard deviation for each test, in particular the standard deviation might be very small (probably zero for the first few samples). You should turn the "enable test timing" off for about a week, or until you get enough build submissions and CDash has calculated an approximate mean and standard deviation for each test time.
it: Ricalcolare i tempi del test: se è stato appena aggiornato CDash si potrebbero notare che gli invii correnti mostrano un numero elevato di test falliti a causa di un tempo errato. Questo perché CDash non ha abbastanza punti campione per calcolare la media e la deviazione standard per ogni test, in particolare la deviazione standard potrebbe essere molto piccola (probabilmente zero per i primi campioni). Si deve disattivare "enable test timing" per circa una settimana, o fino a quando non si ricevono un numero sufficiente di invii di build e CDash ha calcolato una media approssimativa e una deviazione standard per ogni tempo di test.

source: The other option is to force CDash to compute the mean and standard deviation for each test for the past few days. Be warned that this process may take a long time, depending on the number of test and projects involved. In order to recompute the test timing:
it: L'altra opzione è quella di forzare CDash a calcolare la media e la deviazione standard per ogni test degli ultimi giorni. Si tenga presente che questo processo potrebbe richiedere molto tempo, a seconda del numero di test e progetti coinvolti. Per ricalcolare i tempi del test:

source: Specify the number of days (default is 4) to recompute the test timings for.
it: Specificare il numero di giorni (il default è 4) per ricalcolare i tempi del test.

source: Click on "Compute test timing". When the process is done the new mean, standard deviation, and status should be updated for the tests submitted during this period.
it: Clickare su "Compute test timing". Al termine del processo, la nuova media, la deviazione standard e lo stato devono essere aggiornati per i test inviati durante questo periodo.

source: Automatic build removal
it: Rimozione automatica della build

source: In order to keep the database at a reasonable size, CDash can automatically purge old builds. There are currently two ways to setup automatic removal of builds: without a cronjob, edit the ``config.local.php`` and add/edit the following line
it: Per mantenere il database a dimensioni ragionevoli, CDash può eliminare automaticamente le vecchie build. Attualmente ci sono due modi per impostare la rimozione automatica delle build: senza un cronjob, si modifica ``config.local.php`` e si aggiunge/modifica la riga seguente

source: CDash will automatically remove builds on the first submission of the day. Note that removing builds might add an extra load on the database, or slow down the current submission process if your database is large and the number of submissions is high. If you can use a cronjob the PHP command line tool can be used to trigger build removals at a convenient time. For example, removing the builds for all the projects at 6am every Sunday::
it: CDash rimuoverà automaticamente le build al primo invio della giornata. Si noti che la rimozione delle build potrebbe aggiungere un carico aggiuntivo al database o rallentare l'attuale processo di invio se il database è grande e il numero di invii è elevato. Se possibile utilizzare un cronjob, lo strumento della riga di comando PHP può essere utilizzato per attivare le rimozioni di build in un momento opportuno. Ad esempio, rimuovendo le build per tutti i progetti ogni domenica alle 6:00::

source: Note that the 'all' parameter can be changed to a specific project name in order to purge builds from a single project.
it: Si noti che il parametro 'all' può essere modificato in un nome di progetto specifico per eliminare le build da un singolo progetto.

source: CDash XML Schema
it: Schema XML di CDash

source: The XML parsers in CDash can be easily extended to support new features. The current XML schemas generated by CTest, and their features as described in the book, are located at::
it: I parser XML in CDash possono essere facilmente estesi per supportare nuove funzionalità. Gli attuali schemi XML generati da CTest e le loro funzionalità descritte nel libro si trovano in::

source: Subprojects
it: Sottoprogetti

source: CDash supports splitting projects into subprojects. Some of the subprojects may in turn depend on other subprojects. A typical real life project consists of libraries, executables, test suites, documentation, web pages, and installers. Organizing your project into well-defined subprojects and presenting the results of nightly builds on a CDash dashboard can help identify where the problems are at different levels of granularity.
it: CDash supporta la suddivisione dei progetti in sottoprogetti. Alcuni dei sottoprogetti possono a loro volta dipendere da altri sottoprogetti. Un tipico progetto reale è costituito da librerie, eseguibili, test suite, documentazione, pagine Web e programmi di installazione. Organizzare il progetto in sottoprogetti ben definiti e presentare i risultati delle build notturne su un dashboard CDash può aiutare a identificare dove si trovano i problemi a diversi livelli di granularità.

source: A project with subprojects has a different view for its top level CDash page than a project without any. It contains a summary row for the project as a whole, and then one summary row for each subproject.
it: Un progetto con sottoprogetti ha una vista diversa per la sua pagina CDash di primo livello rispetto a un progetto senza. Contiene una riga di riepilogo per il progetto nel suo insieme, quindi una riga di riepilogo per ogni sottoprogetto.

source: Organizing and defining subprojects
it: Organizzazione e definizione di sottoprogetti

source: To add subproject organization to your project, you must: (1) define the subprojects for CDash, so that it knows how to display them properly and (2) use build scripts with CTest to submit subproject builds of your project. Some (re-)organization of your project's CMakeLists.txt files may also be necessary to allow building of your project by subprojects.
it: Per aggiungere l'organizzazione del sottoprogetto al progetto, si deve: (1) definire i sottoprogetti per CDash, in modo che sappia come visualizzarli correttamente e (2) utilizzare gli script di build con CTest per inviare le build del sottoprogetto. Potrebbe anche essere necessaria una (ri)organizzazione dei file CMakeLists.txt del progetto per consentire la creazione del progetto per sottoprogetti.

source: There are two ways to define subprojects and their dependencies: interactively in the CDash GUI when logged in as a project administrator, or by submitting a ``Project.xml`` file describing the subprojects and dependencies.
it: Esistono due modi per definire i sottoprogetti e le loro dipendenze: in modo interattivo nella GUI di CDash quando si accede come amministratore del progetto o inviando un file ``Project.xml`` che descrive i sottoprogetti e le dipendenze.

source: Adding Subprojects Interactively
it: Aggiunta Interattiva di Sottoprogetti

source: As a project administrator, a "Manage subprojects" button will appear for each of your projects on the My CDash page. Clicking the Manage Subprojects button opens the manage subproject page, where you may add new subprojects or establish dependencies between existing subprojects for any project that you are an administrator of.
it: In qualità di amministratore del progetto, apparirà un pulsante "Manage subprojects" per ciascuno dei progetti nella pagina My CDash. Clickando sul pulsante Manage Subprojects si apre la pagina di gestione dei sottoprogetti, dove si possono aggiungere nuovi sottoprogetti o stabilire dipendenze tra sottoprogetti esistenti per qualsiasi progetto di cui si è amministratore.

source: Adding Subprojects Automatically
it: Aggiunta automatica di sottoprogetti

source: Another way to define CDash subprojects and their dependencies is to submit a "Project.xml" file along with the usual submission files that CTest sends when it submits a build to CDash. To define the same two subprojects as in the interactive example above (Exes and Libs) with the same dependency (Exes depend on Libs), the ``Project.xml`` file would look like the following example::
it: Un altro modo per definire i sottoprogetti CDash e le loro dipendenze è quello di inviare un file "Project.xml" insieme ai normali spediti da CTest quando invia una build a CDash. Per definire gli stessi due sottoprogetti dell'esempio interattivo sopra (Exes e Libs) con la stessa dipendenza (gli Exes dipendono da Libs), il file ``Project.xml`` dovrebbe avere il seguente esempio::

source: Once the ``Project.xml`` file is written or generated, it can be submitted to CDash from a ctest -S script using the FILES argument to the :command:`ctest_submit` command, or directly from the :manual:`ctest <ctest(1)>` command line in a build tree configured for dashboard submission.
it: Una volta che il file ``Project.xml`` è stato scritto o generato, può essere inviato a CDash da uno script ctest -S usando l'argomento FILES al comando :command:`ctest_submit`, oppure direttamente dalla riga di comando :manual:`ctest <ctest(1)>` in un albero di build configurato per l'invio della dashboard.

source: From inside a ctest -S script:
it: Dall'interno di uno script ctest -S:

source: From the command line::
it: Dalla riga di comando::

source: CDash will automatically add subprojects and dependencies according to the ``Project.xml`` file. CDash will also remove any subprojects or dependencies not defined in the ``Project.xml`` file. Additionally, if the same ``Project.xml`` is submitted multiple times, the second and subsequent submissions will have no observable effect: the first submission adds/modifies the data, the second and later submissions send the same data, so no changes are necessary. CDash tracks changes to the subproject definitions over time to allow for projects to evolve. If you view dashboards from a past date, CDash will present the project/subproject views according to the subproject definitions in effect on that date.
it: CDash aggiungerà automaticamente sottoprogetti e dipendenze in base al file ``Project.xml``. CDash rimuoverà anche eventuali sottoprogetti o dipendenze non definiti nel file ``Project.xml``. Inoltre, se lo stesso ``Project.xml`` viene inviato più volte, il secondo e i successivi invii non avranno alcun effetto osservabile: il primo invio aggiunge/modifica i dati, il secondo e i successivi invii inviano gli stessi dati, quindi non sono necessarie modifiche. CDash tiene traccia delle modifiche alle definizioni dei sottoprogetti nel tempo per consentire l'evoluzione dei progetti. Se si visualizzano le dashboard da una data passata, CDash presenterà le viste del progetto/sottoprogetto in base alle definizioni del sottoprogetto in vigore in quella data.

source: Using ctest_submit with PARTS and FILES
it: Uso di ctest_submit con PARTS e FILES
