Repository: BravoBaldo/CMake_Italian_docs
Catalog: MasteringCMake/chapter.po
Languages: it

source: CPack is a tool included with CMake, it can be used to create installers and packages for projects. CPack can create two basic types of packages, source and binary. CPack works in much the same way as CMake does for building software. It does not aim to replace native packaging tools, rather it provides a single interface to a variety of tools. Currently CPack supports the creation of Windows installers using NullSoft installer NSIS or WiX, Mac OS X PackageMaker tool, OS X Drag and Drop, OS X X11 Drag and Drop, Cygwin Setup packages, Debian packages, RPMs, .tar.gz, .sh (self extracting .tar.gz files), and .zip compressed files. The implementation of CPack works in a similar way to CMake. For each type of packaging tool supported, there is a CPack generator written in C++ that is used to run the native tool and create the package. For simple tar based packages, CPack includes a library version of tar and does not require tar to be installed on the system. For many of the other installers, native tools must be present for CPack to function.
it: CPack è un tool incluso con CMake, può essere utilizzato per creare programmi di installazione e pacchetti per progetti. CPack può creare due tipi base di pacchetti, sorgente e binario. CPack funziona più o meno allo stesso modo di CMake per la creazione di software. Non mira a sostituire i tool di packaging nativi, piuttosto fornisce un'unica interfaccia a una varietà di strumenti. Attualmente CPack supporta la creazione di programmi di installazione Windows utilizzando il programma di installazione NullSoft NSIS o WiX, il tool Mac OS X PackageMaker, OS X Drag and Drop, OS X X11 Drag and Drop, pacchetti Cygwin Setup, pacchetti Debian, RPM, .tar.gz, .sh (file .tar.gz autoestraenti) e file compressi .zip. L'implementazione di CPack funziona in modo simile a CMake. Per ogni tipo di strumento di creazione pacchetti supportato, esiste un generatore CPack scritto in C++ utilizzato per eseguire il tool nativo e creare il pacchetto. Per semplici pacchetti basati su tar, CPack include una versione di libreria di tar e non richiede l'installazione di tar sul sistema. Per molti degli altri programmi di installazione, gli strumenti nativi devono essere presenti affinché CPack funzioni.

source: With source packages, CPack makes a copy of the source tree and creates a zip or tar file. For binary packages, the use of CPack is tied to the install commands working correctly for a project. When setting up install commands, the first step is to make sure the files go into the correct directory structure with the correct permissions. The next step is to make sure the software is relocatable and can run in an installed tree. This may require changing the software itself, and there are many techniques to do that for different environments that go beyond the scope of this book. Basically, executables should be able to find data or other files using relative paths to the location of where it is installed. CPack installs the software into a temporary directory, and copies the install tree into the format of the native packaging tool. Once the install commands have been added to a project, enabling CPack in the simplest case is done by including the CPack.cmake file into the project.
it: Con i pacchetti dei sorgenti, CPack crea una copia dell'albero dei sorgenti e crea un file zip o tar. Per i pacchetti binari, l'uso di CPack è legato ai comandi di installazione che funzionano correttamente per un progetto. Quando si impostano i comandi di installazione, il primo passo consiste nell'assicurarsi che i file vadano nella struttura di directory corretta con le autorizzazioni corrette. Il passaggio successivo consiste nell'assicurarsi che il software sia riposizionabile e possa essere eseguito in un albero installato. Ciò potrebbe richiedere la modifica del software stesso e ci sono molte tecniche per farlo per ambienti diversi che vanno oltre lo scopo di questo libro. Fondamentalmente, gli eseguibili dovrebbero essere in grado di trovare dati o altri file utilizzando path relativi alla posizione in cui sono installati. CPack installa il software in una directory temporanea e copia l'albero di installazione nel formato del tool di packaging nativo. Una volta che i comandi di installazione sono stati aggiunti a un progetto, l'abilitazione di CPack nel caso più semplice viene eseguita includendo il file CPack.cmake nel progetto.

source: Simple Example
it: Un Esempio Semplice

source: The most basic CPack project would look like this
it: Il progetto CPack più semplice sarebbe simile a questo

source: In the CoolStuff project, an executable is created and installed into the directory bin. Then the CPack file is included by the project. At this point project CoolStuff will have CPack enabled. To run CPack for a CoolStuff, you would first build the project as you would any other CMake project. CPack adds several targets to the generated project. These targets in Makefiles are package and package_source, and PACKAGE in Visual Studio and Xcode. For example, to build a source and binary package for CoolStuff using a Makefile generator you would run the following commands::
it: Nel progetto CoolStuff, un eseguibile viene creato e installato nella directory bin. Quindi il file CPack viene incluso dal progetto. A questo punto il progetto CoolStuff avrà CPack abilitato. Per eseguire CPack per CoolStuff, si deve prima creare il progetto come si farebbe con qualsiasi altro progetto CMake. CPack aggiunge diversi target al progetto generato. Questi target nei Makefile sono package e package_source e PACKAGE in Visual Studio e Xcode. Ad esempio, per creare un pacchetto sorgente e binario per CoolStuff utilizzando un generatore di Makefile, si eseguiranno i seguenti comandi::

source: This would create a source zip file called ``CoolStuff-0.1.1-Source.zip``, a NSIS installer called ``CoolStuff-0.1.1-win32.exe``, and a binary zip file ``CoolStuff-0.1.1-win32.zip``. The same thing could be done using the CPack command line.
it: Questo creerebbe un file zip di sorgenti chiamato ``CoolStuff-0.1.1-Source.zip``, in installer NSIS chiamato ``CoolStuff-0.1.1-win32.exe``, e un file zip binario ``CoolStuff-0.1.1-win32.zip``. La stessa cosa potrebbe essere fatta usando la riga di comando CPack.

source: What Happens When CPack.cmake Is Included?
it: Cosa Succede Quando Viene Incluso CPack.cmake?

source: When the ``include(CPack)`` command is executed, the ``CPack.cmake`` file is included into the project. By default this will use the :command:`configure_file` command to create ``CPackConfig.cmake`` and ``CPackSourceConfig.cmake`` in the binary tree of the project. These files contain a series of set commands that set variables for use when CPack is run during the packaging step. The names of the files that are configured by the ``CPack.cmake`` file can be customized with these two variables; ``CPACK_OUTPUT_CONFIG_FILE`` which defaults to ``CPackConfig.cmake`` and ``CPACK_SOURCE_OUTPUT_CONFIG_FILE`` which defaults to ``CPackSourceConfig.cmake``.
it: Quando viene eseguito il comando ``include(CPack)``, viene incluso il file ``CPack.cmake`` nel progetto. Per default userà il comando :command:`configure_file` per creare ``CPackConfig.cmake`` e ``CPackSourceConfig.cmake`` nell'albero binario del progetto. Questi file contengono una serie di comandi set che impostano le variabili da utilizzare quando CPack viene eseguito durante la fase di impacchettamento. I nomi dei file configurati dal file ``CPack.cmake`` possono essere personalizzati con queste due variabili; ``CPACK_OUTPUT_CONFIG_FILE`` il cui valore predefinito è ``CPackConfig.cmake`` e ``CPACK_SOURCE_OUTPUT_CONFIG_FILE`` il cui valore predefinito è ``CPackSourceConfig.cmake``.

source: The source for these files can be found in the ``Templates/CPackConfig.cmake.in``. This file contains some comments, and a single variable that is set by ``CPack.cmake``. The file contains this line of CMake code::
it: Il sorgente di questi file si trova in ``Templates/CPackConfig.cmake.in``. Questo file contiene alcuni commenti e una singola variabile impostata da ``CPack.cmake``. Il file contiene questa riga di codice CMake::

source: If the project contains the file ``CPackConfig.cmake.in`` in the top level of the source tree, that file will be used instead of the file in the Templates directory. If the project contains the file ``CPackSourceConfig.cmake.in``, then that file will be used for the creation of ``CPackSourceConfig.cmake``.
it: Se il progetto contiene il file ``CPackConfig.cmake.in`` nel livello superiore dell'albero dei sorgenti, tale file verrà utilizzato al posto di quello nella directory Templates. Se il progetto contiene il file ``CPackSourceConfig.cmake.in``, quel file verrà utilizzato per la creazione di ``CPackSourceConfig.cmake``.

source: The configuration files created by ``CPack.cmake`` will contain all the variables that begin with "CPACK\_\" in the current project. This is done using the command
it: I file di configurazione creati da ``CPack.cmake`` conterranno tutte le variabili che iniziano con "CPACK\_\" nel progetto corrente. Questo viene fatto usando il comando

source: The above command gets all variables defined for the current CMake project. Some CMake code then looks for all variables starting with "CPACK\_\", and each variable found is configured into the two configuration files as CMake code. For example, if you had a variable set like this in your CMake project
it: Il comando precedente ottiene tutte le variabili definite per il progetto CMake corrente. Parte del codice CMake cerca quindi tutte le variabili che iniziano con "CPACK\_\" e ogni variabile trovata viene configurata nei due file di configurazione come codice CMake. Ad esempio, se avessimo una variabile impostata come questa nel progetto CMake

source: ``CPackConfig.cmake`` and ``CPackSourceConfig.cmake`` would have the same thing in them:
it: ``CPackConfig.cmake`` e ``CPackSourceConfig.cmake`` avrebbero la stessa cosa al loro interno:

source: It is important to keep in mind that CPack is run after CMake on the project. CPack uses the same parser as CMake, but will not have the same variable values as the CMake project. It will only have the variables that start with CPACK\_\, and these variables will be configured into a configuration file by CMake. This can cause some errors and confusion if the values of the variables use escape characters. Since they are getting parsed twice by the CMake language, they will need double the level of escaping. For example, if you had the following in your CMake project:
it: È importante tenere presente che CPack viene eseguito dopo CMake sul progetto. CPack utilizza lo stesso parser di CMake, ma non avrà gli stessi valori di variabile del progetto CMake. Avrà solo le variabili che iniziano con CPACK\_\, e queste variabili saranno configurate in un file da CMake. Ciò può causare alcuni errori e confusione se i valori delle variabili utilizzano caratteri di escape. Poiché vengono analizzati due volte dal linguaggio CMake, avranno bisogno del doppio del livello di escape. Ad esempio, se avessimo quanto segue nel progetto CMake:

source: The resulting CPack files would have this:
it: I file CPack risultanti avrebbero questo:

source: That would not be exactly what you would want or expect. In fact, it just wouldn't work. To get around this problem, there are two solutions. The first is to add an additional level of escapes to the original set command like this:
it: Non sarebbe esattamente quello voluto o che ci si aspetterebbe. In effetti, semplicemente non funzionerebbe. Per aggirare questo problema, ci sono due soluzioni. La prima è aggiungere un ulteriore livello di escape al comando set originale in questo modo:

source: This would result in the correct ``set`` command which would look like this:
it: Ciò risulterebbe nel comando ``set`` corretto che sarebbe simile a questo:

source: The second solution to the escaping problem is to use a CPack project config file, explained in the next section.
it: La seconda soluzione al problema dell'escape è utilizzare un file di configurazione del progetto CPack, spiegato nella sezione successiva.

source: Adding Custom CPack Options
it: Aggiunta di Opzioni CPack Custom

source: To avoid the escaping problem a project specific CPack configure file can be specified. This file will be loaded by CPack after ``CPackConfig.cmake`` or ``CPackSourceConfig.cmake`` is loaded, and :variable:`CPACK_GENERATOR` will be set to the CPack generator being run. Variables set in this file only require one level of CMake escapes. This file can be configured or not, and contains regular CMake code. In the example above, you could move ``CPACK_FOOBAR`` into a file ``MyCPackOptions.cmake.in`` and configure that file into the build tree of the project. Then set the project configuration file path like this:
it: Per evitare il problema dell'escape, è possibile specificare un file di configurazione CPack specifico per il progetto. Questo file verrà caricato da CPack dopo il caricamento di ``CPackConfig.cmake`` o di ``CPackSourceConfig.cmake`` e :variable:`CPACK_GENERATOR` verrà impostata sul generatore CPack in funzione. Le variabili impostate in questo file richiedono solo un livello di escape CMake. Questo file può essere configurato o meno e contiene il normale codice CMake. Nell'esempio sopra, si può spostare ``CPACK_FOOBAR`` in un file ``MyCPackOptions.cmake.in`` e configurarlo nell'albero di build del progetto. Poi impostare il path del file di configurazione del progetto in questo modo:

source: Where ``MyCPackOptions.cmake.in`` contained:
it: Dove ``MyCPackOptions.cmake.in`` contiene:

source: The :variable:`CPACK_PROJECT_CONFIG_FILE` variable should contain the full path to the CPack config file for the project, as seen in the above example. This has the added advantage that the CMake code can contain if statements based on the :variable:`CPACK_GENERATOR` value, so that packager specific values can be set for a project. For example, the CMake project sets the icon for the installer in this file:
it: La variabile :variable:`CPACK_PROJECT_CONFIG_FILE` dovrebbe contenere il path completo del file di configurazione CPack per il progetto, come mostrato nell'esempio precedente. Ciò ha l'ulteriore vantaggio che il codice CMake può contenere istruzioni if basate sul valore di :variable:`CPACK_GENERATOR`, in modo che i valori specifici del packager possano essere impostati per un progetto. Ad esempio, il progetto CMake imposta l'icona per il programma di installazione in questo file:

source: Note that the path has forward slashes except for the last part which has an escaped \ as the path separator. As of the writing of this book, NSIS needed the last part of the path to have a Windows style slash. If you do not do this, you may get the following error::
it: Si noti che il path ha barre ad eccezione dell'ultima parte che ha un carattere di escape \ come separatore di path. Al momento della stesura di questo libro, NSIS aveva bisogno che l'ultima parte del path avesse una barra in stile Windows. Se non lo si fa, si potrebbe ricevere il seguente errore::

source: Options Added by CPack
it: Opzioni Aggiunte da CPack

source: In addition to creating the two configuration files, ``CPack.cmake`` will add some advanced options to your project. The options added depend on the environment and OS that CMake is running on, and control the default packages that are created by CPack. These options are of the form ``CPACK_<CPack Generator Name>``, where generator names available on each platform can be found in the following table:
it: Oltre a creare i due file di configurazione, ``CPack.cmake`` aggiungerà alcune opzioni avanzate al progetto. Le opzioni aggiunte dipendono dall'ambiente e dal sistema operativo su cui è in esecuzione CMake e controllano i pacchetti di default creati da CPack. Queste opzioni sono nel formato ``CPACK_<CPack Generator Name>``, dove i nomi dei generatori disponibili su ogni piattaforma possono essere trovati nella seguente tabella:

source: Turning these options on or off affects the packages that are created when running CPack with no options. If the option is off in the CMakeCache.txt file for the project, you can still build that package type by specifying the -G option to the CPack command line.
it: L'attivazione o la disattivazione di queste opzioni influisce sui pacchetti creati durante l'esecuzione di CPack senza opzioni. Se l'opzione è disattivata nel file CMakeCache.txt per il progetto, si può comunque creare quel tipo di pacchetto specificando l'opzione -G nella riga di comando CPack.

source: CPack Source Packages
it: Package dei Sorgenti CPack

source: Source packages in CPack simply copy the entire source tree for a project into a package file, and no install rules are used as they are in the case of binary packages. Out of source builds should be used to avoid having extra binary stuff polluting the source package. If you have files or directories in your source tree that are not wanted in the source package, you can use the variable :variable:`CPACK_SOURCE_IGNORE_FILES` to exclude things from the package. This variable contains a list of regular expressions. Any file or directory that matches a regular expression in that list will be excluded from the sources. The default setting is as follows::
it: I pacchetti di sorgenti in CPack copiano semplicemente l'intero albero dei sorgenti per un progetto in un file e non vengono utilizzate regole di installazione come nel caso dei pacchetti binari. Si dovrebbero effettuare build al di fuori dei sorgenti per evitare che materiale binario extra inquini il pacchetto sorgente. Se ci sono file o directory nell'albero dei sorgenti che non sono desiderati nel pacchetto dei sorgenti, si può usare la variabile :variable:`CPACK_SOURCE_IGNORE_FILES` per escludere delle cose dal pacchetto. Questa variabile contiene un elenco di espressioni regolari. Qualsiasi file o directory che corrisponda a un'espressione regolare in questo elenco verrà escluso dalle fonti. L'impostazione di default è la seguente::

source: There are many levels of escapes used in the default value as this variable is parsed by CMake once and CPack again. It is important to realize that the source tree will not use any install commands, it will simply copy the entire source tree minus the files it is told to ignore into the package. To avoid the multiple levels of escape, the file referenced by :variable:`CPACK_PROJECT_CONFIG_FILE` should be used to set this variable. The expression is a regular expression and not a wild card statement, see Chapter 4 for more information about CMake regular expressions.
it: Ci sono molti livelli di escape utilizzati nel valore di default poiché questa variabile viene analizzata da CMake una volta e da CPack di nuovo. È importante rendersi conto che l'albero dei sorgenti non utilizzerà alcun comando di installazione, copierà semplicemente l'intero albero dei sorgenti meno i file che gli vengono detti di ignorare nel pacchetto. Per evitare i molteplici livelli di escape, il file a cui fa riferimento :variable:`CPACK_PROJECT_CONFIG_FILE` dovrebbe essere utilizzato per impostare questa variabile. L'espressione è un'espressione regolare e non un'istruzione con caratteri jolly, vedere il Capitolo 4 per ulteriori informazioni sulle espressioni regolari di CMake.

source: CPack Installer Commands
it: Comandi CPack dell'Installer

source: Since binary packages require CPack to interact with the install rules of the project being packaged, this section will cover some of the options CPack provides to interact with the install rules of a project. CPack can work with CMake's install scripts or with external install commands.
it: Poiché i pacchetti binari richiedono che CPack interagisca con le regole di installazione del progetto da impacchettare, questa sezione coprirà alcune delle opzioni fornite da CPack per interagire con le regole di installazione di un progetto. CPack può funzionare con gli script di installazione di CMake o con comandi di installazione esterni.

source: CPack and CMake install commands
it: Comandi Install CPack e CMake

source: In most CMake projects, using the CMake install rules will be sufficient to create the desired package. By default CPack will run the install rule for the current project. However, if you have a more complicated project, you can specify sub-projects and install directories with the variable :variable:`CPACK_INSTALL_CMAKE_PROJECTS`. This variable should hold quadruplets of install directory, install project name, install component, and install subdirectory. For example, if you had a project with a sub project called MySub that was compiled into a directory called SubProject, and you wanted to install all of its components, you would have this:
it: Nella maggior parte dei progetti CMake, l'utilizzo delle regole di installazione di CMake sarà sufficiente per creare il pacchetto desiderato. Per default CPack eseguirà la regola di installazione per il progetto corrente. Tuttavia, con un progetto più complicato, si possono specificare sottoprogetti e directory di installazione con la variabile :variable:`CPACK_INSTALL_CMAKE_PROJECTS`. Questa variabile dovrebbe contenere quadruple di directory di installazione, nome del progetto di installazione, la componente dell'installazione e le sottodirectory di installazione. Ad esempio, per un progetto con un sottoprogetto chiamato MySub compilato in una directory chiamata SubProject e per installare tutti i suoi componenti, si avrebbe:

source: CPack and DESTDIR
it: CPack e DESTDIR

source: By default CPack does not use the :envvar:`DESTDIR` option during the installation phase. Instead it sets the :variable:`CMAKE_INSTALL_PREFIX` to the full path of the temporary directory being used by CPack to stage the install package. This can be changed by setting :variable:`CPACK_SET_DESTDIR` to on. If the :variable:`CPACK_SET_DESTDIR` option is on, CPack will use the project's cache value for ``CPACK_INSTALL_PREFIX``, and set :envvar:`DESTDIR` to the temporary staging area. This allows absolute paths to be installed under the temporary directory. Relative paths are installed into ``DESTDIR/${project's CMAKE_INSTALL_PREFIX}`` where :envvar:`DESTDIR` is set to the temporary staging area.
it: Per default CPack non usa l'opzione :envvar:`DESTDIR` durante la fase di installazione. Imposta invece :variable:`CMAKE_INSTALL_PREFIX` sul path completo della directory temporanea utilizzata da CPack per preparare il pacchetto di installazione. Questo si può cambiare impostando :variable:`CPACK_SET_DESTDIR` su on. Se l'opzione :variable:`CPACK_SET_DESTDIR` è on, CPack utilizzerà il valore della cache del progetto per ``CPACK_INSTALL_PREFIX`` e imposta :envvar:`DESTDIR` sul valore temporaneo dell'area di staging. Ciò consente l'installazione di path assoluti nella directory temporanea. I path relativi vengono installati in ``DESTDIR/${project's CMAKE_INSTALL_PREFIX}`` dove :envvar:`DESTDIR` è impostata sull'area di staging temporanea.

source: As noted earlier, the :envvar:`DESTDIR` approach does not work when the install rules reference files by Windows full paths beginning with drive letters (C:/).
it: Come notato in precedenza, l'approccio :envvar:`DESTDIR` non funziona quando le regole di installazione fanno riferimento ai file tramite path completi di Windows che iniziano con lettere di unità (C:/).
